000100140414     A          R LPREGLF                   PFILE(*LIBL/LPREGLP)
000101140414                K RLDCMN
000102140414                K RLADCN
