     A          R MTAUTHF                   PFILE(*LIBL/MTAUTHP)
                K AUTAGC
                K AUSEQN
                K AUISBN
                K AUDSQN
