000100140728     A          R MTBIBLF                   PFILE(*LIBL/MTBIBLP)
000101140728                K BLSUPN
000102140828                K BLSKSN
000103140728                K BLISBN
