000001140728                                            UNIQUE
000100140728     A          R MTBIBLF                   PFILE(*LIBL/MTBIBLP)
000102140728                K BLISBN
