000100140817     A          R MTBIBLF                   PFILE(*LIBL/MTBIBLP)
000101140830                K BLSUPN
000103140817                K BLISBN
