000100140817     A          R MTBIBLF                   PFILE(*LIBL/MTBIBLP)
000101140827                K BLSKSN
000103140817                K BLISBN
