000100140414     A          R MTDCMTF                   PFILE(*LIBL/MTDCMTP)
000101140414                K DTDCMT
000102140414                K DTDLTD
