000100140905     A          R MTIMPNF                   PFILE(*LIBL/MTIMPNP)
000101140905                K IPSKSN
000102140905                K IPIMPN
