000001140923                                            UNIQUE
000100140905     A          R MTIMPNF                   PFILE(*LIBL/MTIMPNP)
000102140923                K IPISBP
