000100140828     A          R MTSUPPF                   PFILE(*LIBL/MTSUPPP)
000101140827                K ESSKSN
000102140827                K ESUPN4
