000100140414     A          R SORCINF                   PFILE(*LIBL/SORCINP)
000101140414                K RDDCMC
000102140414                K RDADRF
000103140414                K RDADCN
000104140414                K RDSDRF
000105140414                K RDDCMN
000106140414                K RDISBN
000107140414                K RDDSQN
