000100140415     A          R SORCTAF                   PFILE(*LIBL/SORCTAP)
000101140415                K TRDCMN
000102140415                K TRISBN
000103140415                K TRDSQN
