000100140414     A          R SORCINF                   PFILE(*LIBL/SORCINP)
000101140414                K RDDCMN
000102140423                K RDISBN
000103140423                K RDDSQN
