000100140414     A          R SORCINF                   PFILE(*LIBL/SORCINP)
000101140414                K RDADCN
000103140414                K RDADRF
000104140414                K RDDCMN
000105140414                K RDSDRF
000108140414                K RDISBN
000109140414                K RDDSQN
000110140414                K RDDCMC
