000100140917             CMD        PROMPT('Work records: bibliographic')
000101140917
000102140917             PARM       KWD(PGM) TYPE(*NAME) CONSTANT(WRKRCDBBL) PGM(*YES) PROMPT(*NONE)
000103140917
000104140924             PARM       KWD(OPTION) TYPE(*CHAR) LEN(2) RSTD(*YES) DFT(*MAINTAIN) SPCVAL((*VIEW +
000105140924                          ' 5') (*SELECT 'F4') (*MAINTAIN '  ')) PROMPT('Program mode')
000106140924
000107140924             PARM       KWD(FKY) TYPE(*CHAR) LEN(2) CONSTANT('  ') PROMPT(*NONE)
000108140924
000109140924
000110140924             PARM       KWD(CPC) TYPE(*LGL) CONSTANT('0') PROMPT(*NONE)
000111140924
000112140917
000113140918             PARM       KWD(SCHKEY) TYPE(*GENERIC) LEN(10) DFT(*ALL) SPCVAL((*ALL) (*BLANKS +
000114140918                          '')) PROMPT('Search key/short name')
000115140917
000116140917
000117140924             PARM       KWD(SUPNBR) TYPE(*DEC) LEN(7) DFT(*ALL) RANGE(1 9999999) SPCVAL((*ALL +
000118140924                          0)) PROMPT('Suppler number')
000119140917
000120140927
000121140924             PARM       KWD(IMPNBR) TYPE(*DEC) LEN(8) DFT(*ALL) RANGE(1 99999999) SPCVAL((*ALL +
000122140924                          0)) PROMPT('Imprint number')
000123140917
000124140927
000125140924             PARM       KWD(SHWDLD) TYPE(*NAME) RSTD(*YES) DFT(*NONE) SPCVAL((*ALLRECORDS *) +
000126140924                          (*NONE N) (*ONLY O)) PROMPT('Show deleted records')
000127140917
000128140918
000129140918             PARM       KWD(ISBN) TYPE(*CHAR) LEN(10) CONSTANT('*ALL') PROMPT(*NONE)
000130140927
000131140927
000132140927             PARM       KWD(EC) TYPE(*CHAR) LEN(10) CONSTANT('*IGNORE') PROMPT(*NONE)
