000100000000      *_________________________________________________________________________
000400000000      * Description  : Standard Shell
000500000000      * Programmer   : Jonathan Wilson
000600000000      * Date Created : 31/03/1994
000700000000      *_________________________________________________________________________
000800140828      * Description  : Workwith Bibliographic data
000900000000      * System       : xxxxxxx
001000140828      * Programmer   : Jonathan Wilson
001100140828      * Date Created : 28/08/2014
001200000000      *_________________________________________________________________________
001300000000      * MODIFICATIONS
001400000000      *_________________________________________________________________________
001500000000      *
001600000000      * By           :
001700000000      * Date         :
001800000000      * Scan string  :
001900000000      * Description  :
002000000000      *_________________________________________________________________________
002100000000      * INDICATORS
002200000000      *_________________________________________________________________________
002300000000      *
002403140906      * 01   : *OFF=Control, *ON=Detail
002404140906      * 02-05: *VAR=Condition fields
002405140906      * 06   : *OFF=Allow option, *ON=Protect option
002406140906      * 07   : *OFF=Detail records to display, *ON=No detail records to display
002700140906      * 09-11: *VAR=Condition mode of operation
002800140906      * 12-14: *VAR=Condition function key text
002801140906      * 15   : *ON=RollDown
002802140906      * 16   : *ON=RollUp
002900140906      * 20   : *ON='Bottom', *OFF='More...'
003100140906      * 21   : *ON=Change record level
003200140906      * 22   : *ON=Show panel id information
003300140906      * 23   : *ON=VLDCMDKEY
003400140906      * 26   : *ON=SFLDSP, SFLDSPCTL *OFF=SFLCLR
003500140906      * 28   : *ON=SFLNXTCHG
003501140906      *      :
003600140906      * 98   : *ON=System error occured (ie. Call failed, file error, etc.)
003700140906      * 99   : *ON=Fail/Valid indicator (ie. Chain, lookup, etc.)
003701140906      *
003702140911      *-------------------------------------------------------------------------
003703140911      *
003800000000     H        1   D
003900000000      *
003901140911      *-------------------------------------------------------------------------
004000140911      * Bibliographic record
004001140928      * - [BL] ISBN(PK)
004100140828     FMTBIBLL1UF  E           K        DISK         KINFDS IDF1R1A
004200140828     F            MTBIBLF                           KRENAMEDTAF1R1
004201140928      *     [TI] Title
004202140925     FMTTITLP UF  E           K        DISK                      A
004203140925     F            MTTITLF                           KRENAMEDTAF2R1
004204140928      *     [AU] Author
004205140925     FMTAUTHP UF  E           K        DISK                      A
004206140925     F            MTAUTHF                           KRENAMEDTAF3R1
004207140911      *
004208140911      *-------------------------------------------------------------------------
004209140911      * - SUPN(AK), SKSN(AK), ISBN(PK)
004210140828     FMTBIBLL2IF  E           K        DISK
004211140828     F            MTBIBLF                           KRENAMEDTAF1R2
004212140911      * - SKSN(AK), ISBN(PK)
004213140828     FMTBIBLL3IF  E           K        DISK
004214140828     F            MTBIBLF                           KRENAMEDTAF1R3
004215140911      * - SUPN(AK), ISBN(PK)
004216140829     FMTBIBLL4IF  E           K        DISK
004217140829     F            MTBIBLF                           KRENAMEDTAF1R4
005900000000      *
005901140911      *-------------------------------------------------------------------------
006000140928      * [ES] Supplier
006100140828     FMTSUPPP IF  E           K        DISK
006102140928      * [IP] Imprint
006103140903     FMTIMPNP IF  E           K        DISK
006104140928      * [MT] Marc code
006105140928     FMRCCDE  IF  E           K        DISK
006106140928      * [BN] Binding type
006107140928     FBNDTYP  IF  E           K        DISK
007800000000      *
007801140911      *-------------------------------------------------------------------------
007900000000      * Display file
008000140828     FSO1710D CF  E                    WORKSTN      KINFDS D@INFD
008100140924     F                                        D@RR1 KSFILE S1SFL01
008200140924     F                                        D@RR1 KSFILE S1SFL02
008201141002     F                                        D@RR  KSFILE S2SFL02B
008202141002     F                                        D@RR  KSFILE S2SFL02C
008400000000      *
008401140911      *-------------------------------------------------------------------------
008402140911      *
008403140914      * PK='Primary key(s)' & '0=Control, 1=Detail'
008500140914     E                    PK         50 11
008502140914      * AK='Alternative key(s),' including PK(s) & 'indicators/options'
008503140914     E                    AK         50 60  A
008505140914      * BO='Batched options,' used on 4=Delete screen
008700140913     E                    BO         50 60
008702140914      * Overlays to C1#xx and D1#xx for ':' '.'
008900140906     E                    C1          9  1
009000140906     E                    D1         40  1
009001140917     E                    SKSW       10  3
009002141009     E                    S2TI       51 11
009003141009     E                    S2AU       51 11
009004141005     E                    S2         51  6
009006140902      *
009007140902      *
009100000000      *-------------------------------------------------------------------------
009200000000      * Data structure definitions
009300000000      *-------------------------------------------------------------------------
009301140902      *
009400000000      * Bibliographic record
009500140921     IF1DS      EIDSMTBIBLL1                  4
009505140911      *  _Title file
009506140911     ITIDS      EIDSMTTITLP
009507141009     ID1FTTL      DS                          2 540
009508141009     IW1FTTL      DS                            540
009510140911      *  _Author file
009511140911     IAUDS      EIDSMTAUTHP
009512141009     ID1FATN      DS                          2 240
009513141009     IW1FATN      DS                            540
009514140911      *
009515141001     IF@DS        DS                            500
009516140911      *
009800140923     IF1AK        DS                          5
009801140829      * Primary file keys
010002140830     I I                                      1   1 F1@CDI
010100140830     I I                                      2  11 F1ISBN
010101140914     I                                        1  11 F1PK
010102140829      * All additional keys, from alternative sequence files
010500140830     I I                                     12  180F1SUPN
010501140830     I I                                     19  28 F1SKSN
010502140829      * Stored option/error indicators
010505140907     I I                                     29  60 F1@IOP
010506140911      *
010507140914     IF@AK        DS                             60
010508000000      *
011100000000      * File sequence 1
011200140907     IF1R1        DS
011201140830     I                                        1   1 R1@CDI
011300140830     I I                                      2  11 R1ISBN
011301140829      * All additional keys, from alternative sequence files
011302140830     I I                                     12  21 R1SKSN
011303140830     I I                                     22  280R1SUPN
011304140829      * Stored option/error indicators
011306140907     I I                                     29  60 R1@IOP
011307140829      *
012001000000      * File sequence 2
012002140907     IF1R2        DS
012003140830     I                                        1   1 R2@CDI
012005140830     I I                                      2   80R2SUPN
012006140830     I I                                      9  18 R2SKSN
012007140830     I I                                     19  28 R2ISBN
012008140829      * Stored option/error indicators
012010140907     I I                                     29  60 R2@IOP
012011140829      *
012012140828      * File sequence 3
012013140907     IF1R3        DS
012014140830     I                                        1   1 R3@CDI
012016140830     I I                                      2  11 R3SKSN
012017140830     I I                                     12  21 R3ISBN
012018140829      * All additional keys, from alternative sequence files
012019140830     I I                                     22  280R3SUPN
012020140829      * Stored option/error indicators
012022140907     I I                                     29  60 R3@IOP
012023140829      *
012024140829      * File sequence 4
012025140907     IF1R4        DS
012026140830     I                                        1   1 R4@CDI
012028140830     I I                                      2   80R4SUPN
012029140830     I I                                      9  18 R4ISBN
012030140829      * All additional keys, from alternative sequence files
012031140830     I I                                     19  28 R4SKSN
012032140829      * Stored option/error indicators
012034140907     I I                                     29  60 R4@IOP
012035140829      *
012100140905      * S1OPT = '7=Rename'
012200140914     IO1PK        DS
012201140914     I I                                      1   1 O1@CDI
012300140914     I I                                      2  11 O1ISBN
012301140928      *
012302140928      * File definition daa strutcures
012303140928      *   Supplier
012304140928     IESDS      EIDSMTSUPPP
012305140928      *   Imprint
012306140928     IIPDS      EIDSMTIMPNP
012307140928      *   MARC code
012308140928     IMTDS      EIDSMRCCDE
012309140928      *   Binding
012310140928     IBNDS      EIDSBNDTYP
012311140830      *
012312140830      *
012314000000      *
012315000000      * Formatted option data structures
012316140905     IS1@IOP     IDS
012318140907     I                                        1  20 S10120
012319140905     I I            '0'                       1   1 S1@CDI
012320140907     I I            '0'                       2   2 S1@NDI
012321140907     I I            '00'                      3   4 S1@VWI
012322140915     I I            '0'                       5   5 S1@R05
012323140907     I I            '000'                     6   8 S1@MDI
012324140915     I I            '0'                       9   9 S1@R09
012325140907     I I            '0000000000'             10  19 S1@OPI
012326140915     I I            '0'                      20  20 S1@R20
012327140907     I I            '0000000000'             21  30 S18897
012328140907     I                                       31  32 S1OPT
012329140907     I                                       31  31 S1OPTL
012330140907     I                                       32  32 S1OPTR
012331000000      *
012400000000      * File information data structures
012500000000     IIDF1R1      DS
012600000000     I                                        9   9 OPN@11
012700000000     I                                       83  92 FNM@11
012800000000     I                                       93 102 FLB@11
012900000000     I                                    B 393 3940LOK@11
013000000000     I                                      401 465 KST@11
013700000000      * Common format for 'Deleting record from &1/&2' status message
013800000000     IIDF@        DS
013900000000     I                                        1  10 F@FLIB
014000000000     I                                       11  20 F@FNAM
014100000000     I                                       21  84 F@KEYS
014200000000      *
014300140906      * ':' or '.' for list panel 'subset' fields
014400140920     I            DS
014500140906     I                                        1   9 C1
014600140905     I                                        1   1 C1#01
014700140905     I                                        2   2 C1#02
014800140905     I                                        3   3 C1#03
014900140906     I                                        4   4 C1#04
015000140905     I                                        5   5 C1#05
015001140906     I                                        6   6 C1#06
015002140906     I                                        7   7 C1#07
015003140906     I                                        8   8 C1#08
015004140906     I                                        9   9 C1#09
015100000000      *
015200140914      * ':' or '.' for edit panel(s)
015300140920     I            DS
015400140906     I                                        1  40 D1
015500000000     I                                        1   1 D1#01
015600000000     I                                        2   2 D1#02
015700000000     I                                        3   3 D1#03
015800000000     I                                        4   4 D1#04
015900000000     I                                        5   5 D1#05
016000000000     I                                        6   6 D1#06
016100000000     I                                        7   7 D1#07
016200000000     I                                        8   8 D1#08
016300000000     I                                        9   9 D1#09
016400000000     I                                       10  10 D1#10
016500000000     I                                       11  11 D1#11
016600000000     I                                       12  12 D1#12
016700000000     I                                       13  13 D1#13
016800000000     I                                       14  14 D1#14
016900000000     I                                       15  15 D1#15
017000000000     I                                       16  16 D1#16
017100000000     I                                       17  17 D1#17
017200000000     I                                       18  18 D1#18
017300000000     I                                       19  19 D1#19
017400000000     I                                       20  20 D1#20
017500000000     I                                       21  21 D1#21
017600000000     I                                       22  22 D1#22
017700000000     I                                       23  23 D1#23
017800000000     I                                       24  24 D1#24
017900000000     I                                       25  25 D1#25
018000000000     I                                       26  26 D1#26
018100000000     I                                       27  27 D1#27
018200000000     I                                       28  28 D1#28
018300000000     I                                       29  29 D1#29
018400000000     I                                       30  30 D1#30
018500000000     I                                       31  31 D1#31
018600000000     I                                       32  32 D1#32
018700000000     I                                       33  33 D1#33
018800000000     I                                       34  34 D1#34
018900000000     I                                       35  35 D1#35
019000000000     I                                       36  36 D1#36
019100000000     I                                       37  37 D1#37
019200000000     I                                       38  38 D1#38
019300000000     I                                       39  39 D1#39
019400000000     I                                       40  40 D1#40
020808140921      *
020809140921     I@MODE       DS
020810140921     I                                        1   2 @MDD
020811140921     I                                        3   4 @MDS
020812140921     I                                        5   6 @MSD
020813140921     I                                        7   8 @MSS
022700000000      *
022800000000      * Binary/packed decimal conversion data structures
022900000000     IPD0052      DS
023000000000     I                                    P   1   32DC0052
023100000000     IPD0092      DS
023200000000     I                                    P   1   52DC0092
023300000000     IPD0070      DS
023400000000     I                                    P   1   70CD0070
023500000000     IBN002C      DS
023600000000     I                                    B   1   20BD002C
023601140917     IBN004C      DS
023602140917     I                                    B   1   40BD004C
023700000000      *
023800000000      * External perameters for calls
023900000000     IX@LOMD     IDS
024000000000     I I            256                   B   1   40BZ0001
024100000000     IX@PSC      IDS
024200000000     I                                    B   1   40BZ0002
024300000000     IX@MK       IDS
024400000000     I                                    B   1   40BZ0003
024500000000     IX@EC       IDS
024600000000     I I            272                   B   1   40X@ECBP
024700000000     I                                    B   5   80X@ECBA
024800000000     I                                        9  15 X@MI
024900000000     I                                       16  16 X@EC#1
025000000000     I                                       17 272 X@MDIT
025100140923     IE@EC        DS
025101140923     I                                    B   1   40E@ECBP
025102140923     I                                    B   5   80E@ECBA
025103140923     I                                        9  15 E@MI
025104140923     I                                       16  16 E@EC#1
025105140923     I                                       17 272 E@MDIT
025200000000     IX@ID       IDS
025300000000     I                                        1   10X@IDC
025400000000     I                                        2   70X@IDD
025500000000     I                                        8  130X@IDT
025600000000     I                                       14  140X@IDM
025700000000     IX@OD       IDS
025900000000     I                                        1   10X@ODC
026000000000     I                                        2   30X@OD1
026100000000     I                                        4   50X@OD2
026200000000     I                                        6   70X@OD3
026300000000     I                                        2   70X@ODD
026400000000     I                                        8  130X@ODT
026500000000     I                                       14  160X@ODU
026600000000      *
026700000000      * Formated date/time stamp
026800000000     I@DT        IDS
026900000000     I I            0001                      1   40DT@Y
027000000000     I I            '-'                       5   5 DT@F01
027100000000     I I            01                        6   70DT@M
027200000000     I I            '-'                       8   8 DT@F02
027300000000     I I            01                        9  100DT@D
027400000000     I I            '-'                      11  11 DT@F03
027500000000     I                                       12  130DT@H
027600000000     I I            '.'                      14  14 DT@F04
027700000000     I                                       15  160DT@MI
027800000000     I I            '.'                      17  17 DT@F05
027900000000     I                                       18  190DT@S
028000000000     I I            '.'                      20  20 DT@F06
028100000000     I                                       21  260DT@U
028101140917      *
028102140917      *
028103140917     I@RCB       IDS                             22
028104140917     I I            1                     B   1   40@CT
028105140917     I I            0                     B   5   80@CI
028106140917     I I            0                     B   9  120@CC
028107140917     I                                       13  22 @CR
028108140923      *
028109140923      *
028110140917     IX@SID       DS                            580
028111140917     IX@SOD       DS                            580
028112141009     IW2FTTL      DS                            580
028115140929      *
028116140929      *
028117140930     IS2KD       IDS
028118140930     I                                        1   6 S2KY
028119140929     I                                        1   30S2TAGC
028120140929     I                                        4   60S2SEQN
028121140929     I                                        7   70S2MSEQ
028122140929     I                                        8   8 S2CI
028123141006     I                                        9   9 S2NEF
028124141006     I                                       10  10 S2I09
028125141009     I                                       11  11 S2CHG
028126140929      *
028127140929      *
028200000000      *
028300000000      * Display file information data structure
028400000000     ID@INFD      DS
028401141001     I                                      369 369 D@AIB
028500000000     I                                    B 370 3710D@ROCL
028501141001     I                                    B 376 3770D@RRN
028502141001     I                                    B 378 3790D@RRL
028503141001     I                                    B 380 3810D@RRT
028504141001     I                                      372 385 D@@@@
028600000000      *
028700000000      * Program status data structure
028800000000     I           SDS
028900000000     I                                     *PROGRAM S@PGM
029000000000     I                                      254 263 S@USER
029100000000      *
029200000000      * Local data area
029300000000     I#LDA        DS                            256
029400000000      *
029500000000      * Constants
029600140906     I              9                     C         D@RR1M
029700140913     I              13                    C         D@RR1D
029702140913     I              50                    C         O1
029704140913     I              50                    C         O2
029800140925     I              4                     C         D@MVF1
029900000000     I              11                    C         C@PROW
030000000000     I              2                     C         C@PCOL
030100000000     I              '1'                   C         YES
030200000000     I              '0'                   C         NO
030300140916     I              '0'                   C         UP
030400140916     I              '1'                   C         DOWN
030500000000     I              '1'                   C         BOTTOM
030600000000     I              '0'                   C         MORE
030601140923     I              1                     C         #NRKEY
030700140923     I              2                     C         #INKEY
030800140923     I              3                     C         #LOKEY
030900140923     I              4                     C         #HIKEY
031000140923     I              5                     C         #CHKEY
031001140921     I              1                     C         #CRRCD
031002140921     I              2                     C         #ORRCD
031003140921     I              3                     C         #SCRCD
031004140921     I              4                     C         #UPRCD
031100000000     I              'LMMSGF    *LIBL     'C         C@PMFN
031101140916     I              'QCPFMSG   *LIBL     'C         C@SMFN
031102140917     I              'BCDFGHJKLMNPQRSTVWXY-C         VLCHR
031103140917     I              'Z '
031104140917     I              'BCDFGHJKLMNPQRSTVWXY-C         VLCHRG
031105140917     I              'Z* '
032405140907      *
032406140907      * *ENTRY, main program start
032407140907     C           *ENTRY    PLIST
032408140907     C                     PARM           E@PGM
032409140907     C                     PARM           E@OPT
032410140924     C                     PARM           E@FKY
032411140924     C                     PARM           E@CPC
032412140918     C                     PARM           E@SKSN
032413140918     C                     PARM           E@SUPN
032414140918     C                     PARM           E@IMPN
032415140918     C                     PARM           E@DLTD
032416140907     C                     PARM           E@ISBN
032417140923     C                     PARM           E@EC
032418140913      *
032419140913      * The runtime automatically calls *INZSR here.
032420140913      ***C EXSR *INZSR. For documentation clarity only.
032424140911      *
032425140911      * Perform program 'checks'
032427140919     C                     EXSR PR@PG
032430140918      *
032431140919      *
032432140919     C                     MOVE 'E@>C1'   KY@DIR
032433140922     C                     EXSR PR@KY
035200000000      *
035300140906      * If all 'PK' keys passed setup key and call edit subroutine
035400000000     C                     SELEC
035500140918     C           E@ISBN    WHNE '*ALL'
035800140906     C                     MOVE E@OPT     S1OPT
035900000000     C                     MOVE E@ISBN    BLISBN
036100000000     C                     EXSR @EDT01
036101140906      *
036102140906      * Otherwise call list subroutine
036200000000     C                     OTHER
036300140922     C                     EXSR @LST01
036301140918      *
036302140918      *
036400000000     C                     ENDSL
036800000000      *
036900000000      * *EXIT, end main program
037000000000     C                     OUT  #LDA
037100000000     C                     SETON                     LR
037200000000     C                     RETRN
037300000000      *
037400000000      *-------------------------------------------------------------------------
037500140922     C           @LST01    BEGSR
037600000000      *-------------------------------------------------------------------------
037700000000      *
037800000000      *
037900000000     C                     MOVE '*ENT'    @FMT
038000000000      *
038100000000      *
038200000000B1   C           @FMT      DOWNE*BLANKS
038800000000      *
038900000000      *
039000140918B2   C           @FMT      IFEQ '*ENT'
039100000000      *
039200140919      * Find F1 file access sequence
039300140920     C                     EXSR SQ@F1
039301140918      *
039302140919      *
039303140919     C                     MOVE 'C1>V1'   KY@DIR
039304140922     C                     EXSR PR@KY
040909140918      *
040910140919      *
040911140919     C                     MOVE 'V1>F1'   KY@DIR
040912140922     C                     EXSR PR@KY
040913140916      *
040914140916      * Move values to LOKEY
040915140916     C                     MOVE F1AK      F@AK
040916140916     C           #LOKEY    OCUR F1AK
040917140916     C                     MOVE F@AK      F1AK
041300000000      *
041400000000      *
041500140918E2   C                     ENDIF
041600000000      *
041700000000      *
041800140918B2   C           @FMT      IFEQ '*ENT'
041801140918     C           @FMT      OREQ '*CRT'
041802140922      *
041803140922      * Clear stored options.
041804140919     C                     EXSR PI@AK
041812140922      *
041813140922      *
041814140922E2   C                     ENDIF
041815140922      *
041816140922      *
041817140922B2   C           @FMT      IFEQ '*ENT'
041818140922     C           @FMT      OREQ '*CRT'
041819140922     C           @FMT      OREQ '*RFD'
041823140922      *
041824140922      * Get for display
041825140922     C                     MOVE *OFF      C1@CE
041826140922     C                     EXSR VL@C1
041843140922      *
041844140922      *
041845140922E2   C                     ENDIF
041846140918      *
041847140918      *
041848140918B2   C           @FMT      IFEQ '*ENT'
041849140918     C           @FMT      OREQ '*CRT'
041850140922     C           @FMT      OREQ '*RFD'
041851140918     C           @FMT      OREQ '*UPD'
042602000000      *
042603000000      * Clear subfile
042604140906     C                     MOVE *ON       *IN02
042605140924     C                     WRITEC1PNL01
045500000000      *
045600000000      *
045700140922     C           #CRRCD    OCUR F1DS
046000000000      *
046100000000      * RollUp/PageDown
046200000000B3   C                     SELEC
046300000000W3   C           @ROLL     WHEQ UP
046400000000      *
046500000000      * All ready at bottom of area
046600000000B4   C           D@MOB     IFEQ BOTTOM
046700000000     C                     MOVE 'CPD6A69' X@MI
046800000000     C                     CALL 'QMHSNDPM'@SNDSM
046900140914     C           #LOKEY    OCUR F1AK
047000140920     C                     EXSR SL@F1
047100000000X4   C                     ELSE
047200140914     C           #HIKEY    OCUR F1AK
047300140920     C                     EXSR SG@F1
047400000000E4   C                     ENDIF
047500000000      *
047600000000      * RollDown/PageUp
047700000000W3   C           @ROLL     WHEQ DOWN
047800140914     C           #LOKEY    OCUR F1AK
047900140920     C                     EXSR SL@F1
048000140920     C                     EXSR RP@F1
048100000000      *
048200000000      * All ready at top area
048300140908B4   C           F1@EOF    IFEQ *ON
048400000000     C                     MOVE 'CPD6A66' X@MI
048500000000     C                     CALL 'QMHSNDPM'@SNDSM
048600000000E4   C                     ENDIF
048700000000      *
048800000000      * Read backwards a page of records
048900000000     C                     Z-ADD1         D@RR1
049000140908B4   C           F1@EOF    DOWEQ*OFF
049100000000     C           D@RR1     ANDLTD@RR1M
049600000000     C                     ADD  1         D@RR1
049700140920     C                     EXSR RP@F1
049800000000E4   C                     ENDDO
049900000000      *
050000000000      * If begining of file reset *LOWKEY
050100140908B4   C           F1@EOF    IFEQ *ON
050200140914     C           #INKEY    OCUR F1AK
050300000000      *
050400000000      * Else set the record found to the lowest key
050500000000X4   C                     ELSE
050600140919     C           #LOKEY    OCUR F1AK
050601140919     C                     MOVE 'f?>F1'   KY@DIR
050700140922     C                     EXSR PR@KY
050800000000E4   C                     ENDIF
051200000000      *
051300000000      * Reposition file pointer
051400140920     C                     EXSR SL@F1
051500000000      *
051600000000      * Enter or refresh requested
051700000000W3   C                     OTHER
051800140914     C           #LOKEY    OCUR F1AK
051900140920     C                     EXSR SL@F1
052000000000E3   C                     ENDSL
052100140920      *
052200000000      * Perform first read for the subfile page
052300140920     C                     EXSR RD@F1
052400000000      *
052500000000      * If end of file get first previous record
052600140908B3   C           F1@EOF    IFEQ *ON
052700140920     C                     EXSR SG@F1
052800140920     C                     EXSR RP@F1
052900000000      *
053000000000      * If valid record, use it to set *LOWKEY
053100140917B4   C           F1@EOF    IFEQ *OFF
053200140919     C           #LOKEY    OCUR F1AK
053201140919     C                     MOVE 'f?>F1'   KY@DIR
053202140922     C                     EXSR PR@KY
053400140920     C                     EXSR SL@F1
053500140920     C                     EXSR RD@F1
053600000000E4   C                     ENDIF
053700000000E3   C                     ENDIF
053711000000      *
053712000000      * If still end of file then
053713140908B3   C           F1@EOF    IFEQ *ON
053719000000     C                     MOVE BOTTOM    D@MOB
053720000000      *
053721000000      * Reset LOKEY to initial values
053722140914     C           #INKEY    OCUR F1AK
053723140914     C                     MOVE F1AK      F@AK
053724140914     C           #LOKEY    OCUR F1AK
053725140914     C                     MOVE F@AK      F1AK
053726000000      *
053727000000      * Else records exist, set key(s)
053728000000X3   C                     ELSE
053729140914     C           #LOKEY    OCUR F1AK
053730140919     C                     MOVE 'f?>F1'   KY@DIR
053731140922     C                     EXSR PR@KY
053733000000E3   C                     ENDIF
053734000000      *
053735000000      * Save key(s)
053736140914     C                     MOVE F1AK      F@AK
053737140914     C           #CHKEY    OCUR F1AK
053768000000      *
053769140906      * Write input 'control' subfile
053770140908     C                     MOVE *OFF      F1@CDI
053774140920     C                     EXSR FM@S1F
053775140920     C           S1@WCR    IFEQ *ON
053776140924     C                     WRITES1SFL01
053777140920     C                     ENDIF
053778000000      *
053779000000      * Restore key(s)
053780140914     C                     MOVE F@AK      F1AK
053781140919     C                     MOVE 'F1>f?'   KY@DIR
053782140922     C                     EXSR PR@KY
056600000000      *
056700000000      * Setup 'standard record' subfile
057600000000     C                     Z-ADD0         D@RR1
057700140908B3   C           F1@EOF    DOWEQ*OFF
057800000000     C           D@RR1     ANDLTD@RR1M
057900000000      *
058000000000      * Format subfle record
058001140919     C                     MOVE *ON       F1@CDI
058100140920     C                     EXSR FM@S1F
058300000000      *
058400000000      * Write subfile record
058500000000     C                     ADD  1         D@RR1
058600140924     C                     WRITES1SFL01
058700000000      *
058800000000      * Save key values if last record on screen
058900000000B4   C           D@RR1     IFEQ D@RR1M
059100140922     C           #UPRCD    OCUR F1DS
059400000000E4   C                     ENDIF
059500000000      *
059600000000      * Get next record
059700140920     C                     EXSR RD@F1
059800000000E3   C                     ENDDO
059900000000      *
060000000000      * If end of file show it
060100140908B3   C           F1@EOF    IFEQ *ON
060200000000     C                     MOVE BOTTOM    D@MOB
060300000000      *
060400000000      * Else save keys to HIKEY
060500000000X3   C                     ELSE
060600000000     C                     MOVE MORE      D@MOB
060700140922     C           #CRRCD    OCUR F1DS
061100140914     C           #HIKEY    OCUR F1AK
061101140919     C                     MOVE 'f?>F1'   KY@DIR
061102140922     C                     EXSR PR@KY
061300000000E3   C                     ENDIF
061400000000      *
061500000000      * End of create/update test
061600000000E2   C                     ENDIF
062000000000      *
062100000000      * Set/Reset display output
062200140914     C           #CHKEY    OCUR F1AK
062400140906     C                     MOVE D@MOB     *IN25
062500000000      *
062600000000      * If error, position cursor to error
062700140831B2   C                     SELEC
062800140831W2   C           @FMT      WHEQ '*ERR'
062900000000     C                     CLEARD@PROW
063000000000     C                     CLEARD@PCOL
063100140831W2   C                     OTHER
063101000000      *
063102000000      * Otherwise position cursor to last cursor position
063200140905     C                     Z-ADDC@PROW    D@PROW
063300140905     C                     Z-ADDC@PCOL    D@PCOL
063400140831E2   C                     ENDSL
065300000000      *
065400000000      * Process display format
065606141001     C                     MOVEAC10120    *IN,01
065607141001     C                     MOVEAC18897    *IN,88
065608140924     C                     WRITEC1PNL01
065609141001      *
065610141001     C                     WRITEC1FTR01
065611141001     C                     WRITE#ERRCTL
065612141001      *
065700140924     C                     READ C1PNL01                  99
065701140907      *
065702140907      * Set/Reset display input
065704140907     C                     MOVE *IN21     @CHG
065705140916     C                     MOVE *IN22     @VCF
065706140924     C                     CLEARE@FKY
065707140907     C                     CLEAR@FMT
065708140906B2   C                     SELEC
065709140906W2   C           *IN23     WHEQ *ON
065710140906     C                     MOVE UP        @ROLL
065711140906     C                     MOVE '*UPD'    @FMT
065712140906W2   C           *IN24     WHEQ *ON
065713140906     C                     MOVE DOWN      @ROLL
065714140906     C                     MOVE '*UPD'    @FMT
065715140906W2   C                     OTHER
065716140906     C                     CLEAR@ROLL
065717140906E2   C                     ENDSL
065718140906     C                     CALL 'QMHRMVPM'@RMVPM
065719140908     C                     MOVEA*ALL'0'   *IN,50
065720140905     C           D@ROCL    DIV  256       D@PROW
065721140905     C                     MVR            D@PCOL
077300000000      *
077400140917      * Validate the screen as a whole
077600140919     C                     EXSR VL@C01
078200000000      *
078300140913      * Process entered option(s)
078400140831B3   C           @FMT      IFEQ *BLANKS
078401140924     C           E@FKY     ANDEQ*BLANKS
078402140919     C                     EXSR PR@S1
088804140901E3   C                     ENDIF
089500000000      *
089600000000      * Panel has changed, redisplay
089700140831B3   C           @FMT      IFEQ *BLANKS
089701140924     C           E@FKY     ANDEQ*BLANKS
089800140831B4   C           @CHG      IFEQ YES
089900000000     C                     MOVE '*DSP'    @FMT
090000140831E4   C                     ENDIF
090100140831E3   C                     ENDIF
091000000000      *
091100000000      * End display format loop
091200140831E1   C                     ENDDO
091300000000      *
091400000000      *
091500000000     C                     ENDSR
091694000000      *
091700000000      *-------------------------------------------------------------------------
091800140919     C           VL@C01    BEGSR
091900000000      *-------------------------------------------------------------------------
091912140918      *
091913140918      * Get and store options
091915140914     C                     MOVE *OFF      S1DO
091916140919     C                     EXSR VL@S01
092676140916      *
092677140916      * Test and validate display format
092678140916B1   C                     SELEC
092679140916      *
092680140916      * F3=Exit
092681140916W1   C           *INKC     WHEQ *ON
092682140924     C                     MOVE 'KC'      E@FKY
092683140916      *
092684140916      * F5=Refresh
092685140916W1   C           *INKE     WHEQ *ON
092688140919     C                     MOVE 'M1>C1'   KY@DIR
092689140922     C                     EXSR PR@KY
092690140916     C                     MOVE '*CRT'    @FMT
092691140916      *
092692140916      * F12=Cancel
092693140916W1   C           *INKL     WHEQ *ON
092694140924     C                     MOVE 'KL'      E@FKY
092695140916      *
092696140916      * Enter, RollDown, RollUp, F4, F6, F11, F16, F17
092697140917W1   C           @VCF      WHNE *ON
092698140916     C           @ROLL     OREQ UP
092699140916     C           @ROLL     OREQ DOWN
092700140916     C           *INKD     OREQ *ON
092701140916     C           *INKF     OREQ *ON
092702140916     C           *INKK     OREQ *ON
092703140916     C           *INKQ     OREQ *ON
092704140916     C           *INKR     OREQ *ON
092705140920      *
092706140920      *
092707140920     C                     MOVE *ALL'0'   C18897
092708140920     C                     MOVEAC18897    *IN,88
092709140920      *
092710140920      *
092711140920B2   C                     SELEC
092712140920W2   C           *INKD     WHEQ *ON
092713140920     C                     EXSR @F4L01
092714140920B3   C                     SELEC
092715140920W3   C           X@ECBA    WHNE *ZERO
092716140920     C                     CALL 'QMHSNDPM'@SNDPM
092717140920     C                     MOVE '*ERR'    @FMT
092718140926     C                     OTHER
092721140922     C                     MOVE '*DSP'    @FMT
092722140920E3   C                     ENDSL
092723140920E2   C                     ENDSL
092724140919      *
092725140919      * Find first '1:Detail' option
092726140919     C                     Z-ADDE1        AK@SQ
092727140919     C                     EXSR PR@AK1
092741140901      *
092742140901      *
092743140916B2   C                     SELEC
092744140916W2   C           C1SKSN    WHNE M1SKSN
092745140905     C           C1SUPN    ORNE M1SUPN
092746140905     C           C1IMPN    ORNE M1IMPN
092751140902      *
092752140902      *
092753140916B3   C                     SELEC
092754140902      *
092755140902      * Cannot change list with options pending.
092800140919W3   C           AK@I      WHEQ *ON
093200000000     C                     MOVE 'MSG1833' X@MI
093300140920     C                     CALL 'QMHSNDPM'@SNDPM
093305140921B4   C           C1SKSN    IFNE M1SKSN
093306140920     C                     MOVE *ON       *IN97
093307140921E4   C                     ENDIF
093501140921B4   C           C1SUPN    IFNE M1SUPN
093502140920     C                     MOVE *ON       *IN96
093503140921E4   C                     ENDIF
093505140921B4   C           C1IMPN    IFNE M1IMPN
093506140920     C                     MOVE *ON       *IN95
093507140921E4   C                     ENDIF
093600000000     C                     MOVE '*ERR'    @FMT
093700000000      *
093800000000      * You cannot change the list and press a function key.
093900140916W3   C           @VCF      WHEQ *ON
094100140907     C           @ROLL     ANDEQ*BLANKS
094500000000     C                     MOVE 'MSG1834' X@MI
094600000000     C                     CALL 'QMHSNDPM'@SNDPM
094602140921B4   C           C1SKSN    IFNE M1SKSN
094603140920     C                     MOVE *ON       *IN97
094604140921E4   C                     ENDIF
094606140921B4   C           C1SUPN    IFNE M1SUPN
094607140920     C                     MOVE *ON       *IN96
094608140921E4   C                     ENDIF
094610140921B4   C           C1IMPN    IFNE M1IMPN
094611140920     C                     MOVE *ON       *IN95
094612140921E4   C                     ENDIF
094900000000     C                     MOVE '*ERR'    @FMT
094901140916      *
094902140916      * You cannot change the list and press a roll key
094906140921W3   C           @ROLL     WHNE *BLANKS
094909140916     C                     MOVE 'MSG1837' X@MI
094910140916     C                     CALL 'QMHSNDPM'@SNDPM
094912140921B4   C           C1SKSN    IFNE M1SKSN
094913140920     C                     MOVE *ON       *IN97
094914140921E4   C                     ENDIF
094916140921B4   C           C1SUPN    IFNE M1SUPN
094917140920     C                     MOVE *ON       *IN96
094918140921E4   C                     ENDIF
094920140921B4   C           C1IMPN    IFNE M1IMPN
094921140920     C                     MOVE *ON       *IN95
094922140921E4   C                     ENDIF
094923140916     C                     MOVE '*ERR'    @FMT
094924140902      *
094925140902      *
094926140920E3   C                     ENDSL
094930140918      *
094931140918      *
094932140920B3   C           @FMT      IFNE '*ERR'
094933140918     C                     MOVE '*ENT'    @FMT
094934140920E3   C                     ENDIF
094935140902      *
094936140920      * F17=Subset
094937140920W2   C           *INKR     WHEQ *ON
094938140920     C           AK@I      ANDEQ*ON
094939140902      *
094940140902      * Function key is not allowed with options pending
094941140916     C                     MOVE 'MSG1836' X@MI
094942140916     C                     CALL 'QMHSNDPM'@SNDPM
094943140916     C                     MOVE '*ERR'    @FMT
094944140922      *
094945140922      * F17=Subset
094946140922W2   C           *INKR     WHEQ *ON
094947140922     C           AK@I      ANDEQ*OFF
094948140922     C                     EXSR @SBS01
094949140924B3   C           E@FKY     IFEQ *BLANKS
094950140922     C                     MOVE '*ENT'    @FMT
094951140922X3   C                     ELSE
094952140922     C                     MOVE '*DSP'    @FMT
094953140922E3   C                     ENDIF
095201140922      *
095202140922      * F6=Create not allowed when record selection not entered.
095203140922W2   C           *INKF     WHEQ *ON
095204140922     C           *BLANKS   ANDNE*BLANKS
095207140922     C                     MOVE 'MSG1899' X@MI
095208140922     C                     CALL 'QMHSNDPM'@SNDPM
095209140922     C                     MOVE '*ERR'    @FMT
095210140922      *
095211140922      *
095212140922E2   C                     ENDSL
095213140923      *
095214140923      *
095215140923     C                     MOVEA*IN,88    C18897
095216140922      *
095217140922      * Get and validate control
095218140922B2   C           @FMT      IFNE '*ERR'
095219140924     C           E@FKY     ANDEQ*BLANKS
095220140922     C                     MOVE *ON       C1@CE
095221140922     C                     EXSR VL@C1
095222140922E2   C                     ENDIF
095226140922      *
095227140922      * Get and validate options
095228140922B2   C           @FMT      IFNE '*ERR'
095229140924     C           E@FKY     ANDEQ*BLANKS
095230140922     C                     MOVE *ON       S1DO
095231140922     C                     EXSR VL@S01
095232140922E2   C                     ENDIF
095233140922      *
095234140922      *
095235140922B2   C                     SELEC
095236140916      *
095237140916      * F11=View x
095238140922W2   C           *INKK     WHEQ *ON
095239140922     C           @FMT      ANDNE'*ERR'
095240140916     C                     ADD  1         F1V
095241140922B3   C           F1V       IFGT 2
095242140916     C                     Z-ADD1         F1V
095243140922E3   C                     ENDIF
095244140922     C                     MOVE '*RFD'    @FMT
095245140916      *
095246140916      * F16=Position to
095247140922W2   C           *INKQ     WHEQ *ON
095248140922     C           @FMT      ANDNE'*ERR'
095249140916     C                     EXSR @POS01
095250140924B3   C           E@FKY     IFEQ *BLANKS
095251140916     C           #LOKEY    OCUR F1AK
095252140916     C                     MOVE P1ISBN    F1ISBN
095253140916     C                     MOVE '*UPD'    @FMT
095254140922X3   C                     ELSE
095255140916     C                     MOVE '*DSP'    @FMT
095256140922E3   C                     ENDIF
095264140922      *
095265140922      *
095266140922E2   C                     ENDSL
095529140916      *
095530140916      * Function key not allowed
095531140916W1   C           @VCF      WHEQ *ON
095532140916     C                     MOVE 'CPD6A60' X@MI
095533140916     C                     CALL 'QMHSNDPM'@SNDSM
095534140916     C                     MOVE '*ERR'    @FMT
095535140916      *
095536140916      * End process display
095537140916E1   C                     ENDSL
103215140914      *
103216140914      *
103300000000     C                     ENDSR
103301140918      *
103302140918      *-------------------------------------------------------------------------
103303140919     C           VL@C1     BEGSR
103304140918      *-------------------------------------------------------------------------
103307140918      *
103308140918      * Set all indicators off
103309140918     C                     MOVE *ALL'0'   C10120
103310140918     C                     MOVEAC10120    *IN,01
103311140923      *
103312140923      *
103313140923     C           C1@CE     IFEQ *OFF
103314140918     C                     MOVE *ALL'0'   C18897
103315140923     C                     ENDIF
103318140918     C                     MOVEAC18897    *IN,88
103319140918      *
103320140918      *
103321140918     C                     MOVEA*ALL'.'   C1
103322140918B1   C           E@SKSN    IFNE '*ALL'
103323140918     C                     MOVE ':'       C1,01
103324140918     C                     MOVE *ON       *IN11
103325140918E1   C                     ENDIF
103326140918B1   C           E@SUPN    IFNE *ZERO
103327140918     C                     MOVE ':'       C1,02
103328140918     C                     MOVE *ON       *IN12
103329140918E1   C                     ENDIF
103330140918B1   C           E@IMPN    IFNE *ZERO
103331140918     C                     MOVE ':'       C1,03
103332140918     C                     MOVE *ON       *IN13
103333140918E1   C                     ENDIF
103334140918      *
103335140918      * Issue this is a subsetted list for tests not on SFLCTL
103336140919     C           C1@CE     IFEQ *OFF
103337140918B2   C           C1DLTD    ANDNE'*'
103338140918     C           C1DLTD    ANDNEB1DLTD
103339140918     C                     MOVE 'MSG1830' X@MI
103340140918     C                     CALL 'QMHSNDPM'@SNDPM
103341140918     C                     MOVE C1DLTD    B1DLTD
103342140918E2   C                     ENDIF
103343140918      *
103344140918      * Validate SKSN
103345140919B1   C           C1@CE     IFEQ *ON
103346140918     C           C1SKSN    ANDNE'*ALL'
103347140918     C           C1SKSN    ANDNE'*BLANKS'
103349140918      *
103350140918      *
103351140918     C           ' '       CHECKC1SKSN    I
103352140918     C           ' '       CHEKRC1SKSN    J
103353140918B2   C           I         IFEQ 1
103354140918     C           ' '       SCAN C1SKSN:2  K
103355140918X2   C                     ELSE
103356140918     C                     Z-ADD*ZERO     K
103357140918E2   C                     ENDIF
103358140918      *
103359140918      *
103360140918B2   C                     SELEC
103361140918W2   C           I         WHEQ *ZERO
103362140918     C                     MOVE *ON       *IN97
103363140918     C                     MOVE 'MSG1843' X@MI
103364140918     C                     CALL 'QMHSNDPM'@SNDPM
103365140918     C                     MOVE '*ERR'    @FMT
103366140918W2   C           I         WHGT 1
103367140918     C           K         ORNE *ZERO
103368140918     C           K         ANDLTJ
103369140918     C                     MOVE *ON       *IN97
103370140918     C                     MOVE 'MSG1844' X@MI
103371140918     C                     CALL 'QMHSNDPM'@SNDPM
103372140918     C                     MOVE '*ERR'    @FMT
103373140918      *
103374140918      *
103375140918W2   C                     OTHER
103376140918      *
103377140918      *
103378140918     C           '*'       SCAN C1SKSN    I
103379140918      *
103380140918      *
103381140918B3   C                     SELEC
103382140918W3   C           I         WHNE *ZERO
103383140918     C           I         ANDLTJ
103384140918     C                     MOVE *ON       *IN97
103385140918     C                     MOVE 'MSG1840' X@MI
103386140918     C                     CALL 'QMHSNDPM'@SNDPM
103387140918     C                     MOVE '*ERR'    @FMT
103388140918W3   C           I         WHEQ 1
103389140918     C                     MOVE *ON       *IN97
103390140918     C                     MOVE 'MSG1841' X@MI
103391140918     C                     CALL 'QMHSNDPM'@SNDPM
103392140918     C                     MOVE '*ERR'    @FMT
103393140918E3   C                     ENDSL
103394140918      *
103395140918      *
103396140918E2   C                     ENDSL
103397140918      *
103398140918      *
103399140918E1   C                     ENDIF
103400140918      *
103401140918      * Get supplier, error if not "...flagged as deleted"
103402140918     C                     MOVE C1SUPN    ESUPN4
103403140918     C                     EXSR @RTES
103404140919B1   C           C1@CE     IFEQ *ON
103405140918     C           X@ECBA    ANDNE*ZERO
103406140918     C           C1SUPN    ANDNE*ZERO
103407140918     C           X@MI      ANDNE'MSG1352'
103408140918     C                     CALL 'QMHSNDPM'@SNDPM
103409140918     C                     MOVE *ON       *IN96
103410140918     C                     MOVE '*ERR'    @FMT
103411140918E1   C                     ENDIF
103412140918      *
103413140918      * Get imprint, error if not "...flagged as deleted"
103414140918     C                     MOVE C1IMPN    IPIMPN
103415140918     C                     EXSR @RTIP
103416140923     C                     MOVELIPIPNM    C1IPNM
103417140919B1   C           C1@CE     IFEQ *ON
103418140918     C           X@ECBA    ANDNE*ZERO
103419140918     C           C1IMPN    ANDNE*ZERO
103420140918     C           X@MI      ANDNE'MSG1561'
103421140918     C                     CALL 'QMHSNDPM'@SNDPM
103422140918     C                     MOVE *ON       *IN95
103423140918     C                     MOVE '*ERR'    @FMT
103424140918E1   C                     ENDIF
103425140918      *
103426140918      * ViewX
103427140918B1   C                     SELEC
103428140918W1   C           F1V       WHEQ 1
103429140918     C                     MOVEA'00'      *IN,03
103430140918W1   C           F1V       WHEQ 2
103431140918     C                     MOVEA'01'      *IN,03
103432140918E1   C                     ENDSL
103433140918      *
103434140918      * ModeX
103435140918B1   C                     SELEC
103436140921W1   C           @MSD      WHEQ '*M'
103437140918     C                     MOVEA'000'     *IN,06
103438140921W1   C           @MSD      WHEQ '*V'
103439140918     C                     MOVEA'001'     *IN,06
103440140921W1   C           @MSD      WHEQ '*S'
103441140918     C                     MOVEA'010'     *IN,06
103442140918E1   C                     ENDSL
103445140918      *
103446140918      * Update M1 fields
103447140918B1   C           @FMT      IFNE '*ERR'
103448140919     C           C1@CE     ANDEQ*OFF
103449140919     C                     MOVE 'C1>M1'   KY@DIR
103450140922     C                     EXSR PR@KY
103451140918E1   C                     ENDIF
103467140918      *
103468140918      *
103470140918     C                     MOVEA*IN,01    C10120
103471140923     C                     MOVEA*IN,88    C18897
103478140918      *
103479140918      *
103480140919     C                     MOVE *OFF      C1@CE
103481140918      *
103482140918      *
103483140918     C                     ENDSR
103484140914      *
103485140914      *-------------------------------------------------------------------------
103486140919     C           VL@S01    BEGSR
103487140914      *-------------------------------------------------------------------------
103488140914      *
103489140914      * Read and process subfile records
103490140924     C                     READCS1SFL01                  99
103491140914B1   C           *IN99     DOWEQ*OFF
103492140915      *
103493140915      *
103494140915     C                     MOVE *OFF      *IN21
103495140914      *
103496140914      * Validate subfile record
103497140919     C                     EXSR VL@S1
103498140915B2   C                     SELEC
103499140915W2   C           X@ECBA    WHNE *ZERO
103500140915     C           S1DO      ANDEQ*ON
103501140914     C                     MOVE '*ERR'    @FMT
103502140915     C                     MOVE *ON       *IN21
103503140917     C           S1DO      WHEQ *OFF
103504140915     C                     MOVE *ON       *IN21
103505140915E2   C                     ENDSL
103506140921      *
103507140921      *
103508140921     C                     MOVE *ON       @CHG
103509140914      *
103510140914      * Update subfile record
103512140924     C                     UPDATS1SFL01
103513140914      *
103514140914      * Get next subfile record
103515140924     C                     READCS1SFL01                  99
103516140914E1   C                     ENDDO
103517140914      *
103518140914      *
103519140914     C                     ENDSR
103520140914      *
103521140914      *-------------------------------------------------------------------------
103522140919     C           PR@S1     BEGSR
103523140914      *-------------------------------------------------------------------------
103526140922      *
103527140922      * F6=Create
103528140922W1   C           *INKF     IFEQ *ON
103529140922      *
103530140923      * Keep creating until exit key pressed
103533140924B2   C           E@FKY     DOWEQ*BLANKS
103534140922     C                     MOVE 'KF'      S1OPT
103539140922     C                     EXSR @EDT01
103540140922E2   C                     ENDDO
103542140923      *
103543140923      *
103544140923     C                     MOVE '*RFD'    @FMT
103545140922     C                     ENDIF
103556140916      *
103557140916      * Sequence options into display sequence
103558140919     C                     MOVE 'AK:AK'   KY@DIR
103559140922     C                     EXSR PR@KY
103560140919      *
103561140919      *
103562140919     C                     Z-ADDE1        S1S
103563140916      *
103564140916      *
103565140919B1   C           S1S       DOWLEO1
103566140924     C           E@FKY     ANDEQ*BLANKS
103567140920     C           S1@S1O    ANDEQ*ON
103568140916      *
103569140916      *
103570140916     C           #CHKEY    OCUR F1AK
103571140916      *
103572140916      *
103573140919     C                     MOVELAK,S1S    F1AK
103574140914     C                     MOVE F1@IOP    S1@IOP
103575140920      *
103576140920      *
103577140922B2   C           S1OPT     IFNE *LOVAL
103578140920      *
103579140920      *
103580140919     C                     MOVE 'F1>f?'   KY@DIR
103581140922     C                     EXSR PR@KY
103582140914      *
103583140923      * Check if option has become invalid
103585140920     C                     EXSR TS@F1O
103586140914      *
103587140922      * If option is in error and 'control', report error
103588140922B3   C                     SELEC
103589140922W3   C           X@ECBA    WHNE *ZERO
103590140914     C           F1@CDI    ANDEQ*OFF
103591140914     C                     CALL 'QMHSNDPM'@SNDPM
103592140914     C                     MOVE *ALL'1'   S18897
103593140914     C                     MOVE S1@IOP    F1@IOP
103594140919     C                     MOVELF1AK      AK,S1S
103595140924     C                     MOVE '//'      E@FKY
103596140922      *
103597140922      * If option is in error and 'detail', remove from stack
103598140922W3   C           X@ECBA    WHNE *ZERO
103599140922     C           F1@CDI    ANDEQ*ON
103600140922     C                     MOVE *LOVAL    AK,S1S
103601140922     C                     MOVE *LOVAL    PK,S1S
103602140922      *
103603140922      *
103604140922W3   C                     OTHER
103605140914      *
103606140914      * Process option
103607140919     C                     MOVE *ON       S1@DO
103608140920     C                     EXSR TS@S1O
103609140914      *
103610140914      * If Exit
103611140924B4   C           E@FKY     IFNE *BLANKS
103612140914      *
103613140914      * Test validity of record to display if 'detail'
103614140919     C                     MOVELAK,S1S    F1AK
103615140916B5   C           F1@CDI    IFEQ *ON
103616140919     C                     MOVE 'F1>f?'   KY@DIR
103617140922     C                     EXSR PR@KY
103619140920     C                     EXSR TS@F1O
103620140920     C                     EXSR VL@F1S
103621140914      *
103622140914      * If record cannot be displayed, remove from stack
103623140916B6   C           X@ECBA    IFNE *ZERO
103624140919     C           F1@VR     ANDEQ*OFF
103625140919     C                     MOVE *LOVAL    AK,S1S
103626140919     C                     MOVE *LOVAL    PK,S1S
103627140916E6   C                     ENDIF
103628140916E5   C                     ENDIF
103629140914      *
103630140914      *
103631140916X4   C                     ELSE
103632140919     C                     MOVE *LOVAL    AK,S1S
103633140919     C                     MOVE *LOVAL    PK,S1S
103634140914      *
103635140914      *
103636140916E4   C                     ENDIF
103637140922      *
103638140923      * If exit key is not ' /' select, refresh full display
103639140924B4   C           E@FKY     IFNE ' /'
103640140922     C                     MOVE '*RFD'    @FMT
103641140923      *
103642140923      *
103643140924B5   C           E@FKY     IFNE *BLANKS
103644140922      *
103645140922      * Find first '1:Detail' option
103646140922     C                     Z-ADDE1        AK@SQ
103647140922     C                     EXSR PR@AK1
103648140922      *
103649140923      * If '1:detail' found, use it to position to
103650140923B6   C           AK@I      IFEQ *ON
103651140922     C           #LOKEY    OCUR F1AK
103652140922     C                     MOVE AK,AK@SQ  F1AK
103653140923E6   C                     ENDIF
103654140923      *
103655140923      *
103656140923E3   C                     ENDIF
103657140922      *
103658140922      *
103659140922E4   C                     ENDIF
103660140914      *
103661140914      *
103662140922E3   C                     ENDSL
103663140916      *
103664140916      *
103665140916E2   C                     ENDIF
103666140914      *
103667140914      *
103668140919     C                     ADD  1         S1S
103669140914      *
103670140914      *
103671140914E1   C                     ENDDO
103673140914      *
103674140914      *
103675140914     C                     ENDSR
106300000000      *
106400000000      *-------------------------------------------------------------------------
106500140920     C           FM@S1F    BEGSR
106501000000      *-------------------------------------------------------------------------
106505140915      *
106506140915      *
106507140915     C                     OCUR F1AK      W1
106508140915     C           #CHKEY    OCUR F1AK
106509140915      *
106510140915      *
106511140915     C                     SELEC
106512140917     C           F1@CDI    WHEQ *OFF
106513140920     C                     MOVE *HIVAL    O1PK
106514140920     C                     MOVE *OFF      O1@CDI
106515140916     C                     MOVE O1PK      F1PK
106516140915     C           F1@CDI    WHEQ *ON
106517140919     C                     MOVE 'f?>F1'   KY@DIR
106518140922     C                     EXSR PR@KY
106520140915     C                     ENDSL
106521140915      *
106522140915      *
106523140915     C                     Z-ADDE1        I
106524140915     C           F1PK      LOKUPPK,I                     99
106525140920B1   C                     SELEC
106526140920W1   C           F1@CDI    WHEQ *OFF
106527140915     C           *IN99     ANDEQ*OFF
106528140923     C           #NRKEY    OCUR F1AK
106532140915     C                     MOVE *OFF      F1@CDI
106533140920W1   C           F1@CDI    WHEQ *OFF
106534140915     C           *IN99     ANDEQ*ON
106535140915     C                     MOVE AK,I      F1AK
106536140915     C                     MOVE *OFF      F1@CDI
106537140915     C           F1@CDI    WHEQ *ON
106538140915     C           *IN99     ANDEQ*ON
106539140915     C                     MOVE AK,I      F1AK
106540140915     C                     MOVE *ON       F1@CDI
106541140920E1   C                     ENDSL
106542140915      *
106543140915      *
106544140920B1   C           F1@CDI    IFEQ *OFF
106545140919     C                     MOVE 'F1>f?'   KY@DIR
106546140922     C                     EXSR PR@KY
106547140920E1   C                     ENDIF
106548140915      *
106549140915      *
106550140920B1   C           *IN99     IFEQ *ON
106551140915     C                     MOVE F1@IOP    S1@IOP
106552140915     C                     MOVE *ON       *IN21
106553140920X1   C                     ELSE
106554140915     C                     RESETS1@IOP
106555140915     C                     MOVE *OFF      *IN21
106556140920E1   C                     ENDIF
106557140915      *
106558140915      *
106559140915     C           W1        OCUR F1AK
106560000000      *
106561140908      * Set all record conditioning indicators off
106562140915     C                     MOVE *ALL'0'   S10120
106563140908     C                     MOVEAS10120    *IN,01
106564140915     C                     MOVE *ALL'0'   S18897
106565140915     C                     MOVEAS18897    *IN,88
106566140908      *
106567140908      * 'Control' or 'detail'
106568140908     C                     MOVE F1@CDI    *IN01
106569140908      *
106570140908      * '(no records to display)'
106571140908     C                     MOVE F1@EOF    *IN02
106572140920      *
106573140920      *
106574140920     C                     MOVE *ON       S1@WCR
106575140920     C           F1@EOF    IFEQ *ON
106576140920     C                     MOVE *ON       S1@WCR
106577140920     C                     ENDIF
106579140908      *
106580140908      * ViewX
106581140914B1   C                     SELEC
106582140914W1   C           F1V       WHEQ 1
106583140906     C                     MOVEA'00'      *IN,03
106584140914W1   C           F1V       WHEQ 2
106585140906     C                     MOVEA'01'      *IN,03
106586140914E1   C                     ENDSL
106587140908      *
106588140908      * ModeX
106589140914B1   C                     SELEC
106590140921W1   C           @MSD      WHEQ '*M'
106591140908     C                     MOVEA'000'     *IN,06
106592140921W1   C           @MSD      WHEQ '*V'
106593140908     C                     MOVEA'001'     *IN,06
106594140921W1   C           @MSD      WHEQ '*S'
106595140908     C                     MOVEA'010'     *IN,06
106596140914E1   C                     ENDSL
106619140908      *
106620140915      * Record is 'detail'
106621140915B1   C           F1@CDI    IFEQ *ON
106626140920      *
106627140920      * Retreive title
106628140920     C                     MOVE BLISBN    EISBN3
106629140928     C                     Z-ADD130       TITAGC
106630140928     C                     CLEARDSEQN0
106631140926     C                     CLEARTIDSQN
106634140920     C                     EXSR @RTTI
106635140923     C                     MOVELW1FTTL    S1FTTL
106639140920      *
106640140920      * Retreive author
106641140924     C                     MOVE BLISBN    AUISBN
106642140926     C                     Z-ADD100       AUTAGC
106643140928     C                     CLEARAUSEQN
106644140926     C                     CLEARAUDSQN
106646140920     C                     EXSR @RTAU
106647140923     C                     MOVELW1FATN    S1FATN
106651140920      *
106652140920      * Deleted record status
106653140920     C                     CLEARS1DLTD
106654140920B2   C           BLDLTD    IFNE *BLANKS
106655140920     C                     MOVEL'*DLT'    S1DLTD
106656140920E2   C                     ENDIF
106657140920      *
106658140920      *
116503140915E1   C                     ENDIF
116506140908      *
116507140908      * Save field display indicators
116508140908     C                     MOVEA*IN,01    S10120
116600000000      *
116700000000      *
116800000000     C                     ENDSR
116900000000      *
117000000000      *-------------------------------------------------------------------------
117100140919     C           VL@S1     BEGSR
117200000000      *-------------------------------------------------------------------------
117300000000      *
117400000000      *
117500140915B1   C           S1OPTL    IFEQ *ZERO
117600140905     C                     CLEARS1OPTL
117700140915E1   C                     ENDIF
117800140915B1   C           S1OPTL    IFEQ *BLANKS
117900140905     C           S1OPTR    ANDEQ*ZERO
118000140905     C                     CLEARS1OPTR
118100140915E1   C                     ENDIF
118200140915B1   C           S1OPTR    IFEQ *BLANKS
118300140905     C                     MOVE S1OPTL    S1OPTR
118400140905     C                     CLEARS1OPTL
118500140915E1   C                     ENDIF
118600000000      *
118700000000      * Reset error indicators
118701140915     C                     MOVE *ALL'0'   S18897
118800140908     C                     MOVEAS18897    *IN,88
118900000000      *
119000000000      * Validate entered option
119100140920     C                     EXSR TS@S1O
119101140915B1   C           X@ECBA    IFNE *ZERO
119102140921B2   C           S1DO      IFEQ *ON
119103140914     C                     MOVE *ON       *IN97
119104140914     C                     CALL 'QMHSNDPM'@SNDPM
119301140921E2   C                     ENDIF
119302140921      *
119303140921      *
119304140921X1   C                     ELSE
119802000000      *
119810000000      * Is 'control' record
119811000000     C                     SELEC
119900140921B2   C           S1@CDI    WHEQ *OFF
119901140915      *
119902140915      *
119903140921B3   C           S1OPT     IFEQ *BLANKS
119904140915      *
119905140915      * Option must be entered when key fields are not empty.
119906140921B4   C           BLISBN    IFNE *BLANKS
119907140915     C           S1DO      ANDEQ*ON
119908140921      ***C           ......    ORNE *.....
119909140915      ***C           S1DO      ANDEQ*ON
119910140915     C                     MOVE *ON       *IN97
119911140915     C                     MOVE 'MSG1525' X@MI
119912140915     C                     CALL 'QMHSNDPM'@SNDPM
119913140921E4   C                     ENDIF
119914140915      *
119915140915      *
119916140921X3   C                     ELSE
121301000000      *
121302000000      * If any key is blank, error
121400140921B4   C           BLISBN    IFEQ *BLANKS
121401140914     C           S1DO      ANDEQ*ON
121402140918      ***C           ......    OREQ *.....
121403140915      ***C           S1DO      ANDEQ*ON
121404140920     C                     MOVE 'MSG1524' X@MI
121405140920     C                     CALL 'QMHSNDPM'@SNDPM
121406140920      *
121407140920      *
121408140921B5   C           BLISBN    IFEQ *BLANKS
121600140906     C                     MOVE *ON       *IN96
121601140921E5   C                     ENDIF
121900000000      *
122000140915      *
122100140921X4   C                     ELSE
122302140911      *
122303140911      * Check file is valid
122304140920     C                     EXSR TS@F1O
122305140921B5   C           X@ECBA    IFNE *ZERO
122306140914     C           S1DO      ANDEQ*ON
122307140915     C                     MOVE *ON       *IN96
122309140911     C                     CALL 'QMHSNDPM'@SNDPM
122311140921E5   C                     ENDIF
122312140911      *
122313140911      *
122400140921E4   C                     ENDIF
122401140915      *
122402140915      *
123600140921E3   C                     ENDIF
124200000000      *
124300000000      * Is 'data' record
124400140921X2   C           S1@CDI    WHEQ *ON
124401140911      *
124402140911      * Check file is valid
124404140920     C                     EXSR TS@F1O
124405140921B3   C           X@ECBA    IFNE *ZERO
124406140914     C           S1DO      ANDEQ*ON
124407140911     C                     MOVE *ON       *IN97
124408140911     C                     CALL 'QMHSNDPM'@SNDPM
124409140921E3   C                     ENDIF
124410140914      *
124411140914      * Deleted record status
124412140914     C                     CLEARS1DLTD
124413140921B3   C           BLDLTD    IFNE *BLANKS
124414140914     C                     MOVEL'*DLT'    S1DLTD
124415140921E3   C                     ENDIF
129200000000      *
129300000000      * End of control or detail test
129400140921E2   C                     ENDSL
129404140915      *
129405140915      *
129406140921E1   C                     ENDIF
129407140921      *
129408140921      *
129409140915     C                     OCUR F1AK      W1
129410140915     C           #CHKEY    OCUR F1AK
129411140915      *
129412140915      *
129413140916B1   C                     SELEC
129414140917W1   C           S1@CDI    WHEQ *OFF
129415140923     C           #NRKEY    OCUR F1AK
129416140920     C                     MOVE F1AK      F@AK
129417140920     C           #CHKEY    OCUR F1AK
129418140920     C                     MOVE *HIVAL    O1PK
129419140920     C                     MOVE *OFF      O1@CDI
129420140916     C                     MOVE O1PK      F1PK
129421140916W1   C           S1@CDI    WHEQ *ON
129422140920     C                     MOVE 'f?>F1'   KY@DIR
129423140922     C                     EXSR PR@KY
129424140915     C                     ENDSL
129425140920      *
129426140920      *
129427140915     C                     MOVE S1@CDI    F1@CDI
129428140915      *
129429140915      * Save details
129430140915     C                     Z-ADDE1        I
129431140915     C           F1PK      LOKUPPK,I                     99
129432140915      *
129433140915      *
129434140915B1   C                     SELEC
129435140915      *
129436140915      * Update option
129437140915W1   C           *IN99     WHEQ *ON
129438140915     C           S1@CDI    ANDEQ*OFF
129439140920     C           S1OPT     ANDNE*BLANKS
129440140921     C           *IN99     OREQ *ON
129441140920     C           S1@CDI    ANDEQ*OFF
129442140920     C           F@AK      ANDNEF1AK
129443140915     C           *IN99     OREQ *ON
129444140915     C           S1@CDI    ANDEQ*ON
129445140915     C           S1OPT     ANDNE*BLANKS
129446140915      *
129447140915      *
129448140915     C                     MOVEA*IN,88    S18897
129449140915     C                     MOVE S1@IOP    F1@IOP
129450140919     C                     MOVE 'f?>F1'   KY@DIR
129451140922     C                     EXSR PR@KY
129452140915     C                     MOVE F1AK      AK,I
129453140915      *
129454140915      * Clear option
129455140915W1   C           *IN99     WHEQ *ON
129456140915      *
129457140915      *
129458140915     C                     MOVE *LOVAL    PK,I
129459140915     C                     MOVE *LOVAL    AK,I
129460140915      *
129461140915      * Save option
129462140917W1   C           S1@CDI    WHEQ *OFF
129463140920     C           S1OPT     ANDNE*BLANKS
129464140920     C           S1@CDI    OREQ *OFF
129465140920     C           F@AK      ANDNEF1AK
129466140915     C           S1@CDI    OREQ *ON
129467140915     C           S1OPT     ANDNE*BLANKS
129468140915      *
129469140915      *
129470140915     C                     Z-ADDE1        I
129471140915     C           *LOVAL    LOKUPPK,I                     99
129472140917B2   C           *IN99     IFEQ *OFF
129473140915     C                     SUB  1         E1
129474140915     C                     Z-ADDE1        I
129475140915E2   C                     ENDIF
129476140915B2   C           I         IFGT *ZERO
129477140920B3   C           S1@CDI    IFEQ *OFF
129478140920     C                     MOVE O1PK      PK,I
129479140920X3   C                     ELSE
129480140915     C                     MOVE F1PK      PK,I
129481140920E3   C                     ENDIF
129482140915     C                     MOVEA*IN,88    S18897
129483140915     C                     MOVE S1@IOP    F1@IOP
129484140919     C                     MOVE 'f?>F1'   KY@DIR
129485140922     C                     EXSR PR@KY
129486140915     C                     MOVE F1AK      AK,I
129487140915X2   C                     ELSE
129488140915     C                     Z-ADD1         E1
129489140915B3   C           S1DO      IFEQ *ON
129490140915     C                     Z-ADD7         X@ECBA
129491140915     C                     MOVE *ON       *IN97
129492140915     C                     MOVE 'MSG1527' X@MI
129493140915     C                     CALL 'QMHSNDPM'@SNDPM
129494140915     C                     CLEARS1OPT
129495140915     C                     MOVEA*IN,88    S18897
129496140915E3   C                     ENDIF
129497140915E2   C                     ENDIF
129498140915      *
129499140915      *
129500140915E1   C                     ENDSL
129501140915      *
129502140915      *
129503140915     C           W1        OCUR F1AK
129800000000      *
129900000000      * Set change flag if option is not "exitable"
130000140921B1   C           S1OPT     IFNE ' /'
130002140916     C           S1OPT     ANDNE'  '
130003140920     C           S1DO      ANDEQ*ON
130100000000     C                     MOVE *ON       @CHG
130200140921E1   C                     ENDIF
130300000000      *
130400000000      * Restore saved indicators
130500140907     C                     MOVEAS10120    *IN,01
130600000000      *
130700000000      * If an error has occured, show that the subroutine has failed
130900140921B1   C           S18897    IFNE *ZEROS
130901140915     C                     MOVE 'MSG1526' X@MI
130902140915     C                     Z-ADD7         X@ECBA
131300140921E1   C                     ENDIF
131400000000      *
131500000000      *
131600000000     C                     ENDSR
131760000000      *
131800000000      *-------------------------------------------------------------------------
131900140920     C           TS@S1O    BEGSR
132000000000      *-------------------------------------------------------------------------
132001140915      *
132002140915      *
132003140915     C                     CLEARX@ECBA
132400000000      *
132500000000      * '  '=No option
132600000000     C                     SELEC
132700140905     C           S1OPT     WHEQ '  '
132800000000      *
132900000000      * ' /'=Select
133000140905     C           S1OPT     WHEQ ' /'
133100140921     C           @MSD      ANDEQ'*S'
133200140919     C           S1@DO     IFEQ *ON
133300000000     C                     EXSR @SLC01
133400000000     C                     ENDIF
133500000000      *
133600140915      * ' 1'=Create 'control'
133700140905     C           S1OPT     WHEQ ' 1'
133800140921     C           @MSD      ANDEQ'*M'
133801140908     C           S1@CDI    ANDEQ*OFF
133900140919     C           S1@DO     IFEQ *ON
134000000000     C                     EXSR @EDT01
134100000000     C                     ENDIF
134101140915      *
134102140915      * ' 1'=Create 'detail'
134103140915     C           S1OPT     WHEQ ' 1'
134104140921     C           @MSD      ANDEQ'*M'
134105140915     C           S1@CDI    ANDEQ*ON
134106140915     C                     MOVE 'MSG1551' X@MI
134107140915     C                     Z-ADD7         X@ECBA
134900000000      *
135000000000      * ' 2'=Change
135100140905     C           S1OPT     WHEQ ' 2'
135200140921     C           @MSD      ANDEQ'*M'
135300000000     C                     SELEC
135400140919     C           S1@DO     WHEQ *ON
135600000000     C                     EXSR @EDT01
136000000000     C                     ENDSL
136100000000      *
136200000000      * ' 3'=Copy
136300140905     C           S1OPT     WHEQ ' 3'
136400140921     C           @MSD      ANDEQ'*M'
136500140919     C           S1@DO     IFEQ *ON
136600000000     C                     EXSR @EDT01
136700000000     C                     ENDIF
136800000000      *
136900000000      * ' 4'=Delete
137000140905     C           S1OPT     WHEQ ' 4'
137100140921     C           @MSD      ANDEQ'*M'
137200140919     C           S1@DO     IFEQ *ON
137300000000     C                     EXSR @CND01
137400140922     C                     ENDIF
138200000000      *
138300000000      * ' 5'=View
138400140905     C           S1OPT     WHEQ ' 5'
138500000000     C                     SELEC
138600140919     C           S1@DO     WHEQ *ON
138800000000     C                     EXSR @EDT01
139200000000     C                     ENDSL
139300000000      *
139400000000      * ' 6'=Print
139500140905      ***C           S1OPT     WHEQ ' 6'
139600140919      ***C           S1@DO     IFEQ *ON
139700000000      ***C                     EXSR @PRT01
139800000000      ***C                     ENDIF
139900000000      *
140000000000      * ' 7'=Rename
140100140905     C           S1OPT     WHEQ ' 7'
140200140921     C           @MSD      ANDEQ'*M'
140300140919     C           S1@DO     IFEQ *ON
140400000000     C                     EXSR @EDT01
140500000000     C                     ENDIF
140600000000      *
140700000000      *     =Invalid option
140800000000     C                     OTHER
140900000000     C                     MOVE 'CPD6A7C' X@MI
140901140914     C                     Z-ADD7         X@ECBA
141200000000     C                     ENDSL
141300000000      *
141400000000      * Turn off 'action this option'
141500140919     C                     MOVE *OFF      S1@DO
141600000000      *
141700000000      *
141800000000     C                     ENDSR
141900000000      *
142000000000      *-------------------------------------------------------------------------
142100000000     C           @SLC01    BEGSR
142200000000      *-------------------------------------------------------------------------
142800000000      *
142900000000      *
142901140923     C                     MOVE 'f?>E@'   KY@DIR
142902140923     C                     EXSR PR@KY
143000140924     C                     MOVE ' /'      E@FKY
143100000000      *
143200000000      *
143300000000     C                     ENDSR
143301140921      *
143302140921      *-------------------------------------------------------------------------
143303140921     C           @F4L01    BEGSR
143304140921      *-------------------------------------------------------------------------
143305140921      *
143306140921      *
143307140921     C                     CLEARX@ECBA
143308140921      *
143309140921      *
143310140921B1   C                     SELEC
143311140921      *
143312140921      * List panel
143313140924W1   C           D@CRCD    WHEQ 'C1PNL01'
143314140921      *
143315140921      *
143316140921B2   C                     SELEC
143317140921      *
143318140921      * _Search key short name
143319140921W2   C           D@CFLD    WHEQ 'C1SKSN'
143320140921     C           C1,01     ANDNE':'
143321140921     C                     EXSR @SSS01
143322140924B3   C           E@FKY     IFEQ *BLANKS
143323140921     C                     MOVE C1SSGT    C1SKSN
143324140921E3   C                     ENDIF
143325140921      *
143326140921      * _Supplier no.
143327140921W2   C           D@CFLD    WHEQ 'C1SUPN'
143328140921     C           C1,02     ANDNE':'
143329140921     C                     CALL 'SO1730'  SO1730       98
143330140921B3   C                     SELEC
143331140921W3   C           *IN98     WHEQ *ON
143332140921     C                     MOVE *ON       *IN96
143333140921     C                     Z-ADD7         X@ECBA
143334140921     C                     MOVE 'MSG1838' X@MI
143335140924W3   C           E@FKY     WHEQ *BLANKS
143336140921     C                     MOVE X@SUPN    C1SUPN
143337140921E3   C                     ENDSL
143338140921      *
143339140921      * _Imprint no.
143340140921W2   C           D@CFLD    WHEQ 'C1IMPN'
143341140921     C           C1,03     ANDNE':'
143342140921     C                     CALL 'SO1710'  SO1710       98
143343140921B3   C                     SELEC
143344140921W3   C           *IN98     WHEQ *ON
143345140921     C                     MOVE *ON       *IN95
143346140921     C                     Z-ADD7         X@ECBA
143347140921     C                     MOVE 'MSG1838' X@MI
143348140924W3   C           E@FKY     WHEQ *BLANKS
143349140921     C                     MOVE X@SUPN    C1IMPN
143350140921E3   C                     ENDSL
143351140921      *
143352140921      * _Cursor location is invalid for F4=List
143353140921W2   C                     OTHER
143354140921     C                     Z-ADD7         X@ECBA
143355140921     C                     MOVE 'MSG1839' X@MI
143356140921E2   C                     ENDSL
143357140921      *
143358140921      * Subfile 'control' record
143359140924W1   C           D@CRCD    WHEQ 'S1SFL01'
143360140930      ***C           D@SCRR    ANDEQ1
143361140921      *
143362140921      * No fields are valid, force to '..location is invalid...'
143363140921B2   C                     SELEC
143364140921W2   C           D@CFLD    WHNE D@CFLD
143365140921      *
143366140921      * _Cursor location is invalid for F4=List
143367140921W2   C                     OTHER
143368140921     C                     Z-ADD7         X@ECBA
143369140921     C                     MOVE 'MSG1839' X@MI
143370140921E2   C                     ENDSL
143371140921      *
143372140921      * Edit panel
143373140924W1   C           D@CRCD    WHEQ 'D1PNL01'
143374140921      *
143375140921      *
143376140921B2   C                     SELEC
143377140921      *
143378140921      * _Supplier no.
143379140921W2   C           D@CFLD    WHEQ 'BLSUPN'
143380140921     C           D1,03     ANDNE':'
143381140921     C                     CALL 'SO1730'  SO1730       98
143382140921B3   C                     SELEC
143383140921W3   C           *IN98     WHEQ *ON
143384140921     C                     MOVE *ON       *IN96
143385140921     C                     Z-ADD7         X@ECBA
143386140921     C                     MOVE 'MSG1838' X@MI
143387140924W3   C           E@FKY     WHEQ *BLANKS
143388140921     C                     MOVE X@SUPN    C1SUPN
143389140921E3   C                     ENDSL
143390140921      *
143391140921      * _Imprint no.
143392140921W2   C           D@CFLD    WHEQ 'BLIMPN'
143393140921     C           D1,04     ANDNE':'
143394140921     C                     CALL 'SO1710'  SO1710       98
143395140921B3   C                     SELEC
143396140921W3   C           *IN98     WHEQ *ON
143397140921     C                     MOVE *ON       *IN95
143398140921     C                     Z-ADD7         X@ECBA
143399140921     C                     MOVE 'MSG1838' X@MI
143400140924W3   C           E@FKY     WHEQ *BLANKS
143401140921     C                     MOVE X@SUPN    C1IMPN
143402140921E3   C                     ENDSL
143403140921      *
143404140921      * _Cursor location is invalid for F4=List
143405140921W2   C                     OTHER
143406140921     C                     Z-ADD7         X@ECBA
143407140921     C                     MOVE 'MSG1839' X@MI
143408140921E2   C                     ENDSL
143409140921      *
143410140921      * Cursor location is invalid for F4=List
143411140921W1   C                     OTHER
143412140921     C                     Z-ADD7         X@ECBA
143413140921     C                     MOVE 'MSG1839' X@MI
143414140921E1   C                     ENDSL
143415140921      *
143416140921      *
143417140921     C                     ENDSR
143418140921      *
143419140921      *-------------------------------------------------------------------------
143420140922     C           PR@KY     BEGSR
143421140921      *-------------------------------------------------------------------------
143422140921      *
143423140921      *
143424140923B1   C                     SELEC
143425140923      *
143426140923      *
143427140923W1   C           KY@DIR    WHEQ 'E@>C1'
143428140923     C                     MOVE E@SKSN    C1SKSN
143429140923     C                     MOVE E@SUPN    C1SUPN
143430140923     C                     MOVE E@IMPN    C1IMPN
143431140923     C                     MOVE E@DLTD    C1DLTD
143432140923      *
143433140923      *
143434140923W1   C           KY@DIR    WHEQ 'C1>V1'
143435140923      *
143436140923B2   C                     SELEC
143437140923W2   C           C1SKSN    WHEQ '*ALL'
143438140923     C                     MOVE *BLANKS   V1SKSN
143439140923W2   C           C1SKSN    WHEQ '*BLANKS'
143440140923     C                     MOVE *BLANKS   V1SKSN
143441140923W2   C                     OTHER
143442140923     C           ' *'      CHEKRC1SKSN    I              99
143443140923B3   C           *IN99     IFEQ *ON
143444140923     C           I         SUBSTC1SKSN:1  V1SKSN    P
143445140923X3   C                     ELSE
143446140923     C                     MOVE C1SKSN    V1SKSN
143447140923E3   C                     ENDIF
143448140923E2   C                     ENDSL
143449140923      *
143450140923     C                     MOVE C1SUPN    V1SUPN
143451140923      *
143452140923     C                     MOVE C1IMPN    V1IMPN
143453140923     C                     MOVE V1IMPN    IPIMPN
143454140923     C                     EXSR @RTIP
143455140923     C                     MOVE IPISBP    V1ISBP
143456140923      *
143457140923B2   C                     SELEC
143458140923W2   C           C1DLTD    WHEQ '*'
143459140923     C                     MOVE *BLANKS   V1DLTD
143460140924W2   C           C1DLTD    WHEQ 'O'
143461140923     C                     MOVE '*'       V1DLTD
143462140923W2   C           C1DLTD    WHEQ 'N'
143463140923     C                     MOVE *BLANKS   V1DLTD
143464140923E2   C                     ENDSL
143465140923      *
143466140923      *
143467140923W1   C           KY@DIR    WHEQ 'V1>F1'
143468140923      *
143469140923     C           #NRKEY    OCUR F1AK
143470140923     C                     CLEARF1AK
143471140923     C                     MOVE V1SKSN    F1SKSN
143472140923     C                     MOVE V1SUPN    F1SUPN
143473140923     C           #INKEY    OCUR F1AK
143474140923     C                     MOVE V1SKSN    F1SKSN
143475140923     C                     MOVE V1SUPN    F1SUPN
143476140923     C                     MOVELV1ISBP    F1ISBN    P
143482140923      *
143483140923      *
143484140923W1   C           KY@DIR    WHEQ 'C1>M1'
143485140923     C                     MOVE C1SKSN    M1SKSN
143486140923     C                     MOVE C1SUPN    M1SUPN
143487140923     C                     MOVE C1IMPN    M1IMPN
143488140923     C                     MOVE C1DLTD    M1DLTD
143489140923      *
143490140923      *
143491140923W1   C           KY@DIR    WHEQ 'M1>C1'
143492140923     C                     MOVE M1SKSN    C1SKSN
143493140923     C                     MOVE M1SUPN    C1SUPN
143494140923     C                     MOVE M1IMPN    C1IMPN
143495140923     C                     MOVE M1DLTD    C1DLTD
143500140923      *
143501140923      * Code values here for defaults if required.
143502140923W1   C           KY@DIR    WHEQ 'V1>f?'
143503140923     C                     MOVE V1SUPN    BLSUPN
143504140923     C                     MOVE V1IMPN    BLIMPN
143505140923      *
143506140923      *
143507140923W1   C           KY@DIR    WHEQ 'f?>E@'
143508140923     C                     MOVE BLISBN    E@ISBN
143509140921      *
143510140921      *
143511140923W1   C           KY@DIR    WHEQ 'F1>f?'
143512140921      *
143513140921      *   Primary (unique) keys
143514140921     C                     MOVE F1ISBN    BLISBN
143515140921      *   Secondary/Alternative sequence keys
143516140921     C                     MOVE F1SUPN    BLSUPN
143517140921     C                     MOVE F1SKSN    BLSKSN
143518140921      *
143519140921      *
143520140923W1   C           KY@DIR    WHEQ 'f?>F1'
143521140921      *
143522140921      *   Primary (unique) keys
143523140921     C                     MOVE BLISBN    F1ISBN
143524140921      *   Secondary/Alternative sequence keys
143525140921     C                     MOVE BLSUPN    F1SUPN
143526140921     C                     MOVE BLSKSN    F1SKSN
143527140921      *
143528140921      *
143529140923W1   C           KY@DIR    WHEQ 'AK:AK'
143530140921      *
143531140921      *
143532140923B2   C           E1        DO   O1        I
143533140921      *
143534140921      *
143535140923B3   C           AK,I      IFEQ *LOVAL
143536140921     C                     MOVE *LOVAL    PK,I
143537140923X3   C                     ELSE
143538140921     C                     MOVE AK,I      F1AK
143539140921      *
143540140921      * File sequence 1
143541140923B4   C                     SELEC
143542140923W4   C           F1@SQ     WHEQ 1
143543140921     C                     MOVE F1@CDI    R1@CDI
143544140921     C                     MOVE F1@IOP    R1@IOP
143545140921      *
143546140921     C                     MOVE F1ISBN    R1ISBN
143547140921     C                     MOVE F1SKSN    R1SKSN
143548140921     C                     MOVE F1SUPN    R1SUPN
143549140921      *
143550140921     C                     MOVE F1R1      AK,I
143551140921      *
143552140921      *   File sequence 2
143553140923W4   C           F1@SQ     WHEQ 2
143554140921     C                     MOVE F1@CDI    R2@CDI
143555140921     C                     MOVE F1@IOP    R2@IOP
143556140921      *
143557140921     C                     MOVE F1SUPN    R2SUPN
143558140921     C                     MOVE F1SKSN    R2SKSN
143559140921     C                     MOVE F1ISBN    R2ISBN
143560140921      *
143561140921     C                     MOVE F1R2      AK,I
143562140921      *
143563140921      *   File sequence 3
143564140923W4   C           F1@SQ     WHEQ 3
143565140921     C                     MOVE F1@CDI    R3@CDI
143566140921     C                     MOVE F1@IOP    R3@IOP
143567140921      *
143568140921     C                     MOVE F1SKSN    R3SKSN
143569140921     C                     MOVE F1ISBN    R3ISBN
143570140921     C                     MOVE F1SUPN    R3SUPN
143571140921      *
143572140921     C                     MOVE F1R3      AK,I
143573140921      *
143574140921      *   File sequence 4
143575140923W4   C           F1@SQ     WHEQ 4
143576140921     C                     MOVE F1@CDI    R4@CDI
143577140921     C                     MOVE F1@IOP    R4@IOP
143578140921      *
143579140921     C                     MOVE F1SUPN    R4SUPN
143580140921     C                     MOVE F1ISBN    R4ISBN
143581140921     C                     MOVE F1SKSN    R4SKSN
143582140921      *
143583140921     C                     MOVE F1R4      AK,I
143584140921      *
143585140921      *
143586140923E4   C                     ENDSL
143587140921      *
143588140921      *
143589140923E3   C                     ENDIF
143590140921      *
143591140921      *
143592140923E2   C                     ENDDO
143593140921      *
143594140921      * Sort array
143595140921     C                     SORTAAK
143596140921      *
143597140921      *
143598140923B2   C           E1        DO   O1        I
143599140921      *
143600140921      *
143601140923B3   C           AK,I      IFEQ *LOVAL
143602140921     C                     MOVE *LOVAL    PK,I
143603140923X3   C                     ELSE
143604140921      *
143605140921      *   File sequence 1
143606140923B4   C                     SELEC
143607140923W4   C           F1@SQ     WHEQ 1
143608140921     C                     MOVE AK,I      F1R1
143609140921     C                     MOVE R1@CDI    F1@CDI
143610140921     C                     MOVE R1@IOP    F1@IOP
143611140921      *
143612140921     C                     MOVE R1ISBN    F1ISBN
143613140921     C                     MOVE R1SUPN    F1SUPN
143614140921     C                     MOVE R1SKSN    F1SKSN
143615140921      *
143616140921      *
143617140921      *   File sequence 2
143618140923W4   C           F1@SQ     WHEQ 2
143619140921     C                     MOVE AK,I      F1R2
143620140921     C                     MOVE R2@CDI    F1@CDI
143621140921     C                     MOVE R2@IOP    F1@IOP
143622140921      *
143623140921     C                     MOVE R2SUPN    F1SUPN
143624140921     C                     MOVE R2SKSN    F1SKSN
143625140921     C                     MOVE R2ISBN    F1ISBN
143626140921      *
143627140921      *   File sequence 3
143628140923W4   C           F1@SQ     WHEQ 3
143629140921     C                     MOVE AK,I      F1R3
143630140921     C                     MOVE R3@CDI    F1@CDI
143631140921     C                     MOVE R3@IOP    F1@IOP
143632140921      *
143633140921     C                     MOVE R3SKSN    F1SKSN
143634140921     C                     MOVE R3ISBN    F1ISBN
143635140921     C                     MOVE R3SUPN    F1SUPN
143636140921      *
143637140921      *   File sequence 4
143638140923W4   C           F1@SQ     WHEQ 4
143639140921     C                     MOVE AK,I      F1R4
143640140921     C                     MOVE R4@CDI    F1@CDI
143641140921     C                     MOVE R4@IOP    F1@IOP
143642140921      *
143643140921     C                     MOVE R4SUPN    F1SUPN
143644140921     C                     MOVE R4ISBN    F1ISBN
143645140921     C                     MOVE R4SKSN    F1SKSN
143646140921      *
143647140921      *
143648140923E4   C                     ENDSL
143649140921      *
143650140921      *
143651140921     C                     MOVE F1AK      AK,I
143652140921      *
143653140921      *
143654140923B4   C           F1@CDI    IFEQ *OFF
143655140921     C                     MOVE *HIVAL    O1PK
143656140921     C                     MOVE *OFF      O1@CDI
143657140921     C                     MOVE O1PK      F1PK
143658140923E4   C                     ENDIF
143659140921     C                     MOVE F1PK      PK,I
143660140921      *
143661140921      *
143662140923E3   C                     ENDIF
143663140921      *
143664140921      *
143665140923E2   C                     ENDDO
143666140921      *
143667140921      * Find first non blank
143668140921     C           *LOVAL    LOKUPAK,E1                99
143669140921     C                     MOVE *IN99     S1@S1O
143670140923B2   C           S1@S1O    IFEQ *OFF
143671140921     C                     Z-ADDO1        E1
143672140923E2   C                     ENDIF
143675140921      *
143676140921      *
143677140923W1   C                     OTHER
143678140921      *
143679140921      *
143680140921     C                     Z-ADD7         X@ECBA
143681140921     C                     MOVE 'MSG1847' X@MI
143682140921     C                     CALL 'QMHSNDPM'@SNDPM
143683140921      *
143684140921      *
143685140923E1   C                     ENDSL
143686140921      *
143687140921      *
143688140921     C                     ENDSR
203300000000      *
203400000000      *-------------------------------------------------------------------------
203500000000     C           @EDT01    BEGSR
203600000000      *-------------------------------------------------------------------------
203700000000      *
203800000000      *
203900000000     C                     MOVE '*ENT'    @FMT
204000000000      *
204100000000      * Do while exit not requested
204200140912B1   C           @FMT      DOWNE*BLANKS
204800000000      *
204900000000      *
205000140918B2   C           @FMT      IFEQ '*ENT'
206300000000      *
206400000000      *
206500140918E2   C                     ENDIF
206600000000      *
206700000000      *
206701140918B2   C           @FMT      IFEQ '*ENT'
206800140918     C           @FMT      OREQ '*CRT'
211200000000      *
211300140922      * Retrieve file(s)
211400141002     C                     EXSR @RTP00
211800000000      *
211900140908      *
212000140918E2   C                     ENDIF
212001140922      *
212002140922      *
212003140922B2   C           @FMT      IFEQ '*ENT'
212004140922     C           @FMT      OREQ '*CRT'
212005140922     C           @FMT      OREQ '*RFD'
212009140922      *
212010140922      * Get for display
212011140929     C                     EXSR @VLP00
212015140922      *
212016140922      *
212017140922E2   C                     ENDIF
212018140918      *
212019140918      *
212020140918B2   C           @FMT      IFEQ '*ENT'
212021140918     C           @FMT      OREQ '*CRT'
212022140922     C           @FMT      OREQ '*RFD'
212023140918     C           @FMT      OREQ '*UPD'
212024141010      *
212025141010      *
212026141010B3   C           @ROLL     IFNE *BLANKS
212027141010     C                     EXSR @RLPR
212028141010E3   C                     ENDIF
214900000000      *
215000000000      *
215100140912E2   C                     ENDIF
215200000000      *
215300000000      *
215400141003B2    ***C                     SELEC
215500141003W2    ***C           @FMT      WHEQ '*ERR'
215600000000     C                     CLEARD@PROW
215700000000     C                     CLEARD@PCOL
215800000000      ***C           D1#02     WHEQ ':'
215900000000      ***C           D@VPF1    ANDEQQ1
216000000000      ***C                     Z-ADD7         D@PROW
216100000000      ***C                     Z-ADD33        D@PROW
216200140925W2    ***C                     OTHER
216300140925      ***C                     Z-ADD11        D@PROW
216400140925      ***C                     Z-ADD33        D@PCOL
216500141003E2    ***C                     ENDSL
216600000000      *
216700000000      * Process display format
216701141002     C                     MOVEAP00#01    *IN,01
216801140925     C                     WRITED1HDR00
216802141003      *
216803141003      *
216804141004     C           D@VPF1    IFLT D@MVF1
216805141004     C                     MOVE MORE      *IN25
216806141004     C                     ELSE
216807141004     C                     MOVE BOTTOM    *IN25
216808141004     C                     ENDIF
216809141003     C                     WRITED1FTR00
216810141003      *
216811141003      *
216812141003     C                     WRITE#ERRCTL
216816141002      *
216817141002      *
217100140912B2   C                     SELEC
217200140912W2   C           D@VPF1    WHEQ 1
217201141001      *
217204141001     C                     MOVEAP01A60    *IN,60
217205140925     C                     WRITED1PNL01A
217207141001      *
217208141001      *
217400141003     C           D@VPF1    WHEQ 2
217401141003      *
217402141004     C                     MOVEAP02D60    *IN,60
217403141004     C                     WRITED1PNL02D
217404141004     C                     MOVEAP02C60    *IN,60
217405141004     C                     WRITEC2PNL02C
217406141004     C                     MOVEAP02B60    *IN,60
217407141004     C                     WRITEC2PNL02B
217408141004     C                     MOVEAP02A60    *IN,60
217409141003     C                     WRITED1PNL02A
217415141003      *
217416141004      * Multiple formats with DSPATR(PC) need the first one with
217417141004      *   an error to be the last one output to the display for
217418141004      *   it, the DSPATR(PC), to work correctly.
217420141003B3   C                     SELEC
217424141006W3   C           D@SE02    WHEQ 2.2
217425141003     C                     MOVEAP02B60    *IN,60
217426141003     C                     WRITEC2PNL02B
217427141006W3   C           D@SE02    WHEQ 2.3
217428141003     C                     MOVEAP02C60    *IN,60
217429141003     C                     WRITEC2PNL02C
217431141006W3   C           D@SE02    WHEQ 2.4
217432141004     C                     MOVEAP02D60    *IN,60
217433141004     C                     WRITED1PNL02D
217437141003E3   C                     ENDSL
217438141001      *
217439141001      *
217600140912E2   C                     ENDSL
217617140925      *
217618140925      *
217619141003     C                     MOVE NO        @CHG
217620140925     C                     READ D1HDR00                  99
217621141006      *
217622141006      *
217623140925B2   C                     SELEC
217624140925W2   C           D@VPF1    WHEQ 1
217625140925     C                     READ D1PNL01A                 99
217626141003B3   C           *IN21     IFEQ YES
217627141003     C                     MOVE YES       @CHG
217628141003E3   C                     ENDIF
217629141006      *
217630141006      *
217631140925     C           D@VPF1    WHEQ 2
217632141003     C                     READ D1PNL02A                 99
217633141003B3   C           *IN21     IFEQ YES
217634141003     C                     MOVE YES       @CHG
217635141003E3   C                     ENDIF
217637141003     C                     READ C2PNL02B                 99
217638141003B3   C           *IN21     IFEQ YES
217639141003     C                     MOVE YES       @CHG
217640141003E3   C                     ENDIF
217641141003     C                     READ C2PNL02C                 99
217642141003B3   C           *IN21     IFEQ YES
217643141003     C                     MOVE YES       @CHG
217644141003E3   C                     ENDIF
217646141003     C                     READ D1PNL02D                 99
217647141003B3   C           *IN21     IFEQ YES
217648141003     C                     MOVE YES       @CHG
217649141003E3   C                     ENDIF
217650141006      *
217651141006      *
217652140925E2   C                     ENDSL
217653140905      *
217654140905      *
217655140905     C           D@ROCL    DIV  256       D@PROW
217656140905     C                     MVR            D@PCOL
217700000000      *
217800000000      * Set/Reset display format
217901140916     C                     MOVE *IN22     @VCF
218000140924     C                     CLEARE@FKY
218100000000     C                     CLEAR@FMT
218200140912B2   C                     SELEC
218201140912W2   C           *IN23     WHEQ *ON
218202140907     C                     MOVE UP        @ROLL
218203140907     C                     MOVE '*UPD'    @FMT
218300140912W2   C           *IN24     WHEQ *ON
218400000000     C                     MOVE DOWN      @ROLL
218500000000     C                     MOVE '*UPD'    @FMT
218900140912W2   C                     OTHER
219000000000     C                     CLEAR@ROLL
219001140912E2   C                     ENDSL
219002141006      *
219003141006      *
219004141009      ***C           @ROLL     IFEQ *BLANKS
219005141009      ***C           @ROLL     ORNE *BLANKS
219006141009      ***C           @VOR      ANDEQ*ON
219100000000     C                     CALL 'QMHRMVPM'@RMVPM
219101141009      ***C                     ENDIF
219300000000      *
219400000000      * Test and validate display format
219500140912B2   C                     SELEC
219600000000      *
219700000000      * F3=Exit
219800140912W2   C           *INKC     WHEQ *ON
219900140924     C                     MOVE 'KC'      E@FKY
220500000000      *
220600000000      * F5=Refresh
220700140912W2   C           *INKE     WHEQ *ON
220800000000     C                     MOVE '*CRT'    @FMT
220900000000      *
221000000000      * F12=Cancel
221100140912W2   C           *INKL     WHEQ *ON
221200000000      *
221300140920      * Display formats in decending order until last, then exit
221400140912B3   C           D@VPF1    IFGT 1
221500000000     C                     SUB  1         D@VPF1
221600000000     C                     MOVE '*DSP'    @FMT
221700140912X3   C                     ELSE
221800140924     C                     MOVE 'KL'      E@FKY
221900140912E3   C                     ENDIF
222000000000      *
222100140922      * Enter, RollUp, RollDown, F4=List
222200140917W2   C           @VCF      WHNE *ON
222300140907     C           @ROLL     OREQ UP
222400140907     C           @ROLL     OREQ DOWN
222401140922     C           *INKD     OREQ *ON
222402140922      *
222403140922      *
222404140922B3   C                     SELEC
222405140922W3   C           *INKD     WHEQ *ON
222406140922     C                     EXSR @F4L01
222407140922B4   C                     SELEC
222408140922W4   C           X@ECBA    WHNE *ZERO
222409140922     C                     CALL 'QMHSNDPM'@SNDPM
222410140922     C                     MOVE '*ERR'    @FMT
222413140923W4   C                     OTHER
222414140923     C                     MOVE '*DSP'    @FMT
222415140922E4   C                     ENDSL
222416140922E3   C                     ENDSL
222417140921      *
222418140921      *
222419141006     C           @ROLL     IFEQ *BLANKS
222420141006     C           @ROLL     ORNE *BLANKS
222421141006     C           @VOR      ANDEQ*ON
222422141006      *
222423141006      *
223100000000     C                     MOVE *ON       D1DO
223200140929     C                     EXSR @VLP00
223201141006      *
223202141006      *
223203141006     C                     ENDIF
224600000000      *
224700000000      * Details are valid
224800140912B3   C           @FMT      IFEQ *BLANKS
224900000000      *
225000140913      * 'Details are valid, press Enter to confirm' message
225200140912B4   C           @CHG      IFEQ YES
225300000000     C                     MOVE 'MSG1532' X@MI
225400000000     C                     CALL 'QMHSNDPM'@SNDPM
225500000000     C                     MOVE '*DSP'    @FMT
225600140912X4   C                     ELSE
225700000000      *
225800000000      * Perform updates
225801140928     C                     MOVE *ON       F1@COC
225900000000     C                     EXSR @UPF1
226000140912B5   C           X@ECBA    IFNE *ZERO
226100000000     C                     CALL 'QMHSNDPM'@SNDPM
226200140906     C                     MOVE *ON       *IN97
226300000000     C                     MOVE '*ERR'    @FMT
226400140912X5   C                     ELSE
226500140912E5   C                     ENDIF
226600000000      *
226700000000      *
227100140912E4   C                     ENDIF
227200000000      *
227300000000      *
227400140912E3   C                     ENDIF
227500000000      *
227600000000      * Invalid function key
227700140912W2   C                     OTHER
227800000000     C                     MOVE 'CPD6A60' X@MI
227900000000     C                     CALL 'QMHSNDPM'@SNDSM
228000140923     C                     MOVE '*ERR'    @FMT
228100000000      *
228200000000      *
228300140912E2   C                     ENDSL
228400000000      *
228500000000      *
228600140912E1   C                     ENDDO
228700000000      *
228800000000      *
228900000000     C                     ENDSR
228901141010      *
228902141010      *-------------------------------------------------------------------------
228903141010     C           @RLPR     BEGSR
228904141010      *-------------------------------------------------------------------------
228905141010      *
228906141010      *
228907141010B1   C                     SELEC
228908141010W1   C           D@CRCD    WHEQ 'C2PNL02B'
228909141010     C           D@CRCD    OREQ 'S2SFL02B'
228910141010B2   C           @ROLL     IFEQ UP
228911141012     C           S1OPT     ANDNE' 5'
228912141012     C           P02BRR    ANDLT50
228914141010     C                     Z-ADDP02BRR    D@RR
228915141012     C           D@RR      CHAINS2SFL02B             99
228916141012B3   C           S2TAGC    IFNE *ZERO
228917141012     C           P02BRR    ADD  1         P02BRN
228918141012     C                     Z-ADD4         D@PTF
228919141010     C                     EXSR @FBF2
228920141010     C                     CLEAR@ROLL
228921141012     C                     Z-ADD2.2       D@SE02
228922141012E3   C                     ENDIF
228923141010E2   C                     ENDIF
228924141010      *
228925141010      *
228926141010W1   C           D@CRCD    WHEQ 'S2PNL02C'
228927141010     C           D@CRCD    OREQ 'S2SFL02C'
228928141010B2   C           @ROLL     IFEQ UP
228929141012     C           S1OPT     ANDNE' 5'
228930141012     C           P02CRR    ANDLT50
228931141010     C                     Z-ADDP02CRR    D@RR
228932141012     C           D@RR      CHAINS2SFL02C             99
228940141012     C                     ENDIF
228941141012B3   C           S2TAGC    IFNE *ZERO
228942141012     C           P02CRR    ADD  1         P02CRN
228943141010     C                     Z-ADD2         D@PTF
228944141010     C                     EXSR @FBF3
228945141010     C                     CLEAR@ROLL
228946141012     C                     Z-ADD2.3       D@SE02
228947141012E3   C                     ENDIF
228948141010E2   C                     ENDIF
228949141010      *
228950141010      *
228951141010E1   C                     ENDSL
228952141010      *
228953141010      * Already at bottom of area
228954141010B1   C                     SELEC
228955141010W1   C           @ROLL     WHEQ UP
228956141010B2   C           D@VPF1    IFGE D@MVF1
228957141010     C                     MOVE 'CPD6A69' X@MI
228958141010     C                     CALL 'QMHSNDPM'@SNDSM
228959141010     C                     Z-ADDD@MVF1    D@VPF1
228960141010X2   C                     ELSE
228961141010     C                     ADD  1         D@VPF1
228962141010E2   C                     ENDIF
228963141010      *
228964141010      * Already at top of area
228965141010W1   C           @ROLL     WHEQ DOWN
228966141010B2   C           D@VPF1    IFEQ 1
228967141010     C                     MOVE 'CPD6A66' X@MI
228968141010     C                     CALL 'QMHSNDPM'@SNDSM
228969141010X2   C                     ELSE
228970141010     C                     SUB  1         D@VPF1
228971141010E2   C                     ENDIF
228972141010E1   C                     ENDSL
228973141010      *
228974141010      *
228975141010     C                     ENDSR
229000000000      *
229100000000      *-------------------------------------------------------------------------
229200141002     C           @RTP00    BEGSR
229300000000      *-------------------------------------------------------------------------
229301140920      *
229302140920      *
229303141002     C                     MOVE *ZEROS    P00#01
229304141002     C                     MOVEAP00#01    *IN,01
229305141002     C                     MOVE *ZEROS    P00#88
229306141002     C                     MOVEAP00#88    *IN,88
229307140920      *
229308140920      * Setup mode, F6=Create
229309140920B1   C                     SELEC
229310140920W1   C           S1OPT     WHEQ 'KF'
229311140920     C                     MOVE *OFF      *IN01
229312140920     C                     MOVE *OFF      *IN02
229313140920     C                     MOVEA*ALL'.'   D1
229317140920      *
229318140920      * 1=Create
229319140920W1   C           S1OPT     WHEQ ' 1'
229320140920     C                     MOVE *ON       *IN01
229321140920     C                     MOVE *OFF      *IN02
229322140920     C                     MOVEA*ALL'.'   D1
229323140920     C                     MOVE ':'       D1,01
229325140920      *
229326140920      * 2=Change
229327140920W1   C           S1OPT     WHEQ ' 2'
229328140920     C                     MOVE *ON       *IN01
229329140920     C                     MOVE *OFF      *IN02
229330140920     C                     MOVEA*ALL'.'   D1
229331140920     C                     MOVE ':'       D1,01
229332140920      *
229333140920      * 3=Copy
229334140920W1   C           S1OPT     WHEQ ' 3'
229335140920     C                     MOVE *OFF      *IN01
229336140920     C                     MOVE *OFF      *IN02
229337140920     C                     MOVEA*ALL'.'   D1
229338140920      *
229339140920      * 5=View
229340140920W1   C           S1OPT     WHEQ ' 5'
229341140920     C                     MOVE *ON       *IN01
229342140920     C                     MOVE *ON       *IN02
229343140920     C                     MOVEA*ALL':'   D1
229344140920      *
229345140920      * 7=Rename
229346140920W1   C           S1OPT     WHEQ ' 7'
229347140920     C                     MOVE *OFF      *IN01
229348140920     C                     MOVE *ON       *IN02
229349140920     C                     MOVEA*ALL':'   D1
229350140920     C                     MOVE '.'       D1,01
229351140920      *
229352140920      *
229353140920E1   C                     ENDSL
229373140920      *
229374140920      *
229379140925     C                     EXSR RT@F1
229380141002B1   C           X@ECBA    IFNE *ZERO
229381140920     C                     CALL 'QMHSNDPM'@SNDPM
229382140920     C                     MOVE *ON       *IN97
229383140920     C                     MOVE '*ERR'    @FMT
229384140920     C                     MOVE *ON       *IN01
229385140921     C                     MOVE *ON       *IN02
229386140920     C                     MOVEA*ALL':'   D1
229387141002E1   C                     ENDIF
229391140929      *
229392140929      *
229393141002     C                     MOVEA*IN,01    P00#01
229394141002     C                     MOVEA*IN,88    P00#88
229395141002      *
229396141002      *
229397141002     C                     Z-ADD1         D@VPF1
229398140929      *
229399140929      * Get all titles
229400140929     C                     EXSR RT@F2
229402140929      *
229403140929      * Get all authors.
229406140929     C                     EXSR RT@F3
229435140923      *
229436140923      *
229437140929     C                     ENDSR
229438141002      *
229439141002      *-------------------------------------------------------------------------
229440141002     C           @VLP00    BEGSR
229441141002      *-------------------------------------------------------------------------
229442141006      *
229443141006      *
229444141006     C                     CLEARD@SE00
229527141002      *
229528141006      *---
229529141002      *
229530141006     C                     CLEARD@SE01
229531141006     C                     CLEAR@FMT01
229532141006      *
229533141006      *
229534141002     C                     EXSR @VP01A
229535141006B1   C           @FMT01    IFEQ '*ERR'
229536141006     C           D@SE01    ANDEQ*ZERO
229537141006     C                     Z-ADD1.1       D@SE01
229538141006     C                     MOVE @FMT01    @FMT
229539141003E1   C                     ENDIF
229540141006      *
229541141006      *
229542141006     C           D@SE00    IFEQ *ZERO
229543141006     C                     Z-ADDD@SE01    D@SE00
229544141006     C                     ENDIF
229545141006      *
229546141006      *---
229547141006      *
229548141006     C                     CLEARD@SE02
229549141006     C                     CLEAR@FMT02
229550141006      *
229551141006      *
229562141002     C                     EXSR @VP02A
229565141006B1   C           @FMT02    IFEQ '*ERR'
229566141006     C           D@SE02    ANDEQ*ZERO
229567141006     C                     Z-ADD2.1       D@SE02
229568141006     C                     MOVE @FMT02    @FMT
229569141003E1   C                     ENDIF
229587141002      *
229588141002      *
229590141002     C                     EXSR @VP02B
229593141006B1   C           @FMT02    IFEQ '*ERR'
229594141006     C           D@SE02    ANDEQ*ZERO
229595141006     C                     Z-ADD2.2       D@SE02
229596141006     C                     MOVE @FMT02    @FMT
229597141003E1   C                     ENDIF
229609141002      *
229610141002      *
229611141002     C                     EXSR @VP02C
229614141006B1   C           @FMT02    IFEQ '*ERR'
229615141006     C           D@SE02    ANDEQ*ZERO
229616141006     C                     Z-ADD2.3       D@SE02
229617141006     C                     MOVE @FMT02    @FMT
229618141003E1   C                     ENDIF
229635141004      *
229636141004      *
229637141004     C                     EXSR @VP02D
229638141006B1   C           @FMT02    IFEQ '*ERR'
229639141006     C           D@SE02    ANDEQ*ZERO
229640141006     C                     Z-ADD2.4       D@SE02
229641141006     C                     MOVE @FMT02    @FMT
229642141004E1   C                     ENDIF
229648141006      *
229649141006      *
229651141006     C           D@SE00    IFEQ *ZERO
229652141006     C                     Z-ADDD@SE02    D@SE00
229653141006     C                     ENDIF
229654141006      *
229655141006      *---
229656141006      *
229657141006     C           D@SE00    IFNE *ZERO
229658141006     C                     Z-ADDD@SE00    D@VPF1
229659141006     C                     ENDIF
229660141006      *
229661141006      *
229662141002     C                     MOVE *OFF      D1DO
229665141002      *
229666141002      *
229667141002     C                     ENDSR
229668140929      *
229669140929      *-------------------------------------------------------------------------
229670140929     C           @VP01A    BEGSR
229671140929      *-------------------------------------------------------------------------
229672141002      *
229673141002      *
229674141002     C                     MOVE *ZEROS    P01A60
229675141002     C                     MOVEAP01A60    *IN,60
229676141002      *
229677141002      * Special as @RTP00 does some pre-validation.
229678141002     C                     MOVEAP00#88    *IN,88
229679141002      *
229680141002      *
229681141002B1   C           BLISBN    IFEQ *BLANKS
229682141002     C           D1DO      ANDEQ*ON
229683141002     C           D1,01     ANDEQ'.'
229684141002     C                     MOVE 'MSG1546' X@MI
229685141002     C                     CALL 'QMHSNDPM'@SNDPM
229686141002     C                     MOVE *ON       *IN97
229687141006     C                     MOVE '*ERR'    @FMT01
229688141002X1   C                     ELSE
229689141002      *
229690141002      *
229691141002     C                     MOVE *ON       F1@COC
229692141002     C                     EXSR RT@F1
229693141002B2   C           X@ECBA    IFNE *ZERO
229694141002     C           D1DO      ANDEQ*ON
229695141002     C                     CALL 'QMHSNDPM'@SNDPM
229696141002     C                     MOVE *ON       *IN97
229697141006     C                     MOVE '*ERR'    @FMT01
229698141002     C                     MOVE *ON       *IN01
229699141002     C                     MOVE *ON       *IN02
229700141002     C                     MOVEA*ALL':'   D1
229701141002E2   C                     ENDIF
229702141002      *
229703141002      *
229704141002     C                     MOVEA*IN,60    P01A60
229705141002     C                     MOVELF1DS      F@DS      P
229706141002     C                     MOVE *ON       F1@TE
229707141002     C                     EXSR TS@F1O
229708141002B2   C           X@ECBA    IFNE *ZERO
229709141002     C           D1DO      ANDEQ*ON
229710141002     C           D1,01     ANDEQ'.'
229711141002     C                     CALL 'QMHSNDPM'@SNDPM
229712141002     C                     MOVE *ON       *IN97
229713141006     C                     MOVE '*ERR'    @FMT01
229714141002E2   C                     ENDIF
229715141002     C                     MOVELF@DS      F1DS      P
229716141002      *
229717141002      *
229718141002E1   C                     ENDIF
229719140923      *
229720140923      *
229721141002B1   C           BLDLTD    IFNE *BLANKS
229722140923     C                     MOVE '*Dlt'    D1DLTD
229723141002X1   C                     ELSE
229724140923     C                     CLEARD1DLTD
229725141002E1   C                     ENDIF
231927140902      *
231928140902      * Get supplier
231929140902     C                     MOVE BLSUPN    ESUPN4
231930140903     C                     EXSR @RTES
231931140912B1   C           X@ECBA    IFNE *ZERO
231932140902     C           D1DO      ANDEQ*ON
231933140929     C           D1,02     ANDEQ'.'
231934140902     C                     CALL 'QMHSNDPM'@SNDPM
231935140906     C                     MOVE *ON       *IN96
231936141006     C                     MOVE '*ERR'    @FMT01
231937140912E1   C                     ENDIF
231938140902      *
231939140902      * Get imprint
231940140903     C                     MOVE BLIMPN    IPIMPN
231941140923     C                     EXSR @RTIP
231943140912B1   C           X@ECBA    IFNE *ZERO
231944140902     C           D1DO      ANDEQ*ON
231945140929     C           D1,03     ANDEQ'.'
231946140902     C                     CALL 'QMHSNDPM'@SNDPM
231947140906     C                     MOVE *ON       *IN95
231948141006     C                     MOVE '*ERR'    @FMT01
231949140912E1   C                     ENDIF
231965140906      *
231966140929      * 130-Title
231967140914B1   C           D1FTTL    IFEQ *BLANKS
231968140912     C           D1DO      ANDEQ*ON
231969140929     C           D1,04     ANDEQ'.'
231970140929     C                     MOVE 'MSG1567' X@MI
231971140912     C                     CALL 'QMHSNDPM'@SNDPM
231972140906     C                     MOVE *ON       *IN94
231973141006     C                     MOVE '*ERR'    @FMT01
231974140912E1   C                     ENDIF
231975140929      *
231976140929      * 130-Title continuation indicator
231977140929B1   C           D1CI01    IFNE '*'
231978140929     C           D1CI01    ANDNE'.'
231979140929     C           D1DO      ANDEQ*ON
231980140929     C           D1,05     ANDEQ'.'
231981140929     C                     MOVE 'MSG1566' X@MI
231982140929     C                     CALL 'QMHSNDPM'@SNDPM
231983140929     C                     MOVE *ON       *IN93
231984141006     C                     MOVE '*ERR'    @FMT01
231985140929E1   C                     ENDIF
231987140928      *
231988140928      * Get binding
231989140928     C                     MOVE BLBIND    BNBIND
231990140928     C                     EXSR @RTBN
231991140928B1   C           X@ECBA    IFNE *ZERO
231992140928     C           D1DO      ANDEQ*ON
231993140929     C           D1,06     ANDEQ'.'
231994140928     C                     CALL 'QMHSNDPM'@SNDPM
231995140928     C                     MOVE *ON       *IN92
231996141006     C                     MOVE '*ERR'    @FMT01
231997140928E1   C                     ENDIF
231998140929      *
231999140929      * 100-Author
232001140929B1   C           D1FATN    IFEQ *BLANKS
232002140929     C           D1DO      ANDEQ*ON
232003140929     C           D1,07     ANDEQ'.'
232004140929     C                     MOVE 'MSG1568' X@MI
232005140929     C                     CALL 'QMHSNDPM'@SNDPM
232006140929     C                     MOVE *ON       *IN91
232007141006     C                     MOVE '*ERR'    @FMT01
232008140929E1   C                     ENDIF
232009140929      *
232010140929      * 100-Author continuation indicator
232011140929B1   C           D1CI02    IFNE '*'
232012140929     C           D1CI02    ANDNE'.'
232013140929     C           D1DO      ANDEQ*ON
232014140929     C           D1,08     ANDEQ'.'
232015140929     C                     MOVE 'MSG1566' X@MI
232016140929     C                     CALL 'QMHSNDPM'@SNDPM
232017140929     C                     MOVE *ON       *IN90
232018141006     C                     MOVE '*ERR'    @FMT01
232019140929E1   C                     ENDIF
232020141002      *
232021141002      *
232024141002     C                     MOVEA*IN,60    P01A60
232500000000      *
232600000000      *
232700000000     C                     ENDSR
232701140929      *
232702140929      *-------------------------------------------------------------------------
232703140929     C           @VP02A    BEGSR
232704140929      *-------------------------------------------------------------------------
232705141002      *
232706141002      *
232712141002     C                     MOVE *ZEROS    P02A60
232713141002     C                     MOVEAP02A60    *IN,60
232714140929      *
232715140929      * Published date
232716140929      ***C
232717140929      *
232718140929      * Reprint date
232719140929      ***C
232720141003     C           D1RPDT    IFNE *BLANKS
232721141003     C                     MOVE *ON       *IN95
232722141006     C                     MOVE '*ERR'    @FMT02
232723141003     C                     ENDIF
232724141002      *
232725141002      *
232726141002     C                     MOVEA*IN,60    P02A60
232739140929      *
232740140929      *
232741140929     C                     ENDSR
232742140929      *
232743140929      *-------------------------------------------------------------------------
232744140929     C           @VP02B    BEGSR
232745140929      *-------------------------------------------------------------------------
232746141002      *
232747141002      *
232748141002     C                     MOVE *ZEROS    P02B60
232749141002     C                     MOVEAP02B60    *IN,60
232750141002      *
232751141002      *
232752141002     C                     MOVEA*IN,60    P02B60
232753141002      *
232754141002      * Title(s)
232755141002     C                     EXSR @VS02B
232774141002      *
232775141002      *
232776141002     C                     ENDSR
232777141002      *
232778141002      *-------------------------------------------------------------------------
232779141002     C           @VS02B    BEGSR
232780141002      *-------------------------------------------------------------------------
232781141002      *
232782141002      *
232783141002     C                     CLEARP02BSR
232784140930      *
232785140930      *
232786140930     C                     READCS2SFL02B                 21
232787141008      *
232788141008      * If records changed, force "header file" into changed state.
232789141008     C           *IN21     IFEQ *ON
232790141008     C                     MOVEL'*CURRENT'X@IDF     P
232791141008     C                     EXSR @DTDTS
232792141008     C                     MOVE @DT       BLEDTS
232793141008     C                     ENDIF
232794141008      *
232795141008      *
232796140930B1   C           *IN21     DOWEQ*OFF
232797141002     C                     MOVEAS02B01    *IN,01
232798141002     C                     MOVE *ZEROS    S02B80
232799141002     C                     MOVEAS02B80    *IN,80
232803141009      *
232804141009      *
232805141009     C                     MOVE *ON       S2CHG
232806140930      *
232807140930      * If no MARC tag, all fields must be empty
232808140930B2   C           S2TAGC    IFEQ *ZERO
232809140930      *
232810140930      *
232811140930B3   C           S2SEQN    IFNE *ZERO
232812140930     C           D1DO      ANDEQ*ON
232813140930     C                     MOVE 'MSG1569' X@MI
232814140930     C                     CALL 'QMHSNDPM'@SNDPM
232815140930     C                     MOVE *ON       *IN96
232816141006     C                     MOVE '*ERR'    @FMT02
232817140930E3   C                     ENDIF
232818140930      *
232819140930      *
232820140930B3   C           S2FTTL    IFNE *BLANKS
232821140930     C           S2FTTL    ANDNE'*BLANK'
232822140930     C           D1DO      ANDEQ*ON
232823140930     C           D1,11     ANDEQ'.'
232824140930     C                     MOVE 'MSG1570' X@MI
232825140930     C                     CALL 'QMHSNDPM'@SNDPM
232826140930     C                     MOVE *ON       *IN95
232827141006     C                     MOVE '*ERR'    @FMT02
232828140930E3   C                     ENDIF
232829140930      *
232830140930      *
232831140930B3   C           S2CI      IFNE *BLANKS
232832140930     C           D1DO      ANDEQ*ON
232833140930     C           D1,12     ANDEQ'.'
232834140930     C                     MOVE 'MSG1571' X@MI
232835140930     C                     CALL 'QMHSNDPM'@SNDPM
232836140930     C                     MOVE *ON       *IN94
232837141006     C                     MOVE '*ERR'    @FMT02
232838140930E3   C                     ENDIF
232839140930      *
232840140930      *
232841140930X2   C                     ELSE
232842140930      *
232843140930      * MARC tag
232844140930     C                     MOVE S2TAGC    MTTAGC
232845140930     C                     EXSR @RTMT
232846140930B3   C           X@ECBA    IFNE *ZERO
232847140930     C           D1DO      ANDEQ*ON
232848140930     C                     CALL 'QMHSNDPM'@SNDPM
232849140930     C                     MOVE *ON       *IN97
232850141006     C                     MOVE '*ERR'    @FMT02
232851140930E3   C                     ENDIF
232852140930      *
232853140930      * MARC tag is not a valid 'Title' tag
232854140930B3   C           MTTGTP    IFNE 'TI'
232855140930     C           D1DO      ANDEQ*ON
232856140930     C                     MOVE 'MSG1574' X@MI
232857140930     C                     CALL 'QMHSNDPM'@SNDPM
232858140930     C                     MOVE *ON       *IN97
232859141006     C                     MOVE '*ERR'    @FMT02
232860140930E3   C                     ENDIF
232861140930      *
232862140930      * Sequence must be zero when tag is non repeatable.
232863140930B3   C           MTTGIR    IFNE 'Y'
232864140930     C           S2SEQN    ANDNE*ZERO
232865140930     C           D1DO      ANDEQ*ON
232866141004     C           *IN10     ANDEQ*OFF
232867140930     C                     MOVE 'MSG1573' X@MI
232868140930     C                     CALL 'QMHSNDPM'@SNDPM
232869140930     C                     MOVE *ON       *IN96
232870141006     C                     MOVE '*ERR'    @FMT02
232871140930E3   C                     ENDIF
232872140930      *
232873140930      * Title
232874140930B3   C                     SELEC
232875140930W3   C           S2FTTL    WHEQ *BLANKS
232876140930     C           D1DO      ANDEQ*ON
232877140930     C           D1,11     ANDEQ'.'
232878140930     C           *IN10     ANDEQ*OFF
232879140930     C                     MOVE 'MSG1567' X@MI
232880140930     C                     CALL 'QMHSNDPM'@SNDPM
232881140930     C                     MOVE *ON       *IN95
232882141006     C                     MOVE '*ERR'    @FMT02
232883140930      *
232884140930      * Title
232885140930W3   C           S2FTTL    WHEQ *BLANKS
232886140930     C           D1DO      ANDEQ*ON
232887140930     C           D1,11     ANDEQ'.'
232888140930     C                     MOVE 'MSG1572' X@MI
232889140930     C                     CALL 'QMHSNDPM'@SNDPM
232890140930     C                     MOVE *ON       *IN95
232891141006     C                     MOVE '*ERR'    @FMT02
232892140930E3   C                     ENDSL
232893140930      *
232894140930      * Title continuation indicator
232895140930B3   C           S2CI      IFNE '*'
232896140930     C           S2CI      ANDNE'.'
232897140930     C           D1DO      ANDEQ*ON
232898140930     C           D1,12     ANDEQ'.'
232899140930     C                     MOVE 'MSG1566' X@MI
232900140930     C                     CALL 'QMHSNDPM'@SNDPM
232901140930     C                     MOVE *ON       *IN94
232902141006     C                     MOVE '*ERR'    @FMT02
232903140930E3   C                     ENDIF
232904140930      *
232905140930      *
232906140930E2   C                     ENDIF
232907140930      *
232908140930      *
232909141006      *
232910141006      *
232911141006     C                     MOVEA*IN,80    S02B80
232912141006B2   C           S02B80    IFNE *ZEROS
232913141006     C                     MOVE *OFF      *IN,09
232914141006     C                     MOVE *IN09     S2I09
232915141006     C                     MOVE *OFF      S2NEF
232916141006     C                     MOVE *ON       *IN,21
232917141006B3   C           P02BSR    IFEQ *ZERO
232918141006     C                     Z-ADDD@RR      P02BSR
232919141006E3   C                     ENDIF
232920141006X2   C                     ELSE
232921141006      *
232922141006      *
232923141006     C           D@RR      DIV  P02BSP    I
232924141006     C                     MVR            I
232925141006B3   C           I         IFLE 1
232926141006     C                     MOVE *ON       *IN09
232927141006E3   C                     ENDIF
232928141006     C                     MOVE *IN09     S2I09
232929141006     C                     MOVE *ON       S2NEF
232930141006      *
232931141006      *
232932141006E2   C                     ENDIF
232933141006      *
232934141006      *
232935141006     C                     MOVEA*IN,01    S02B01
232936141006     C                     UPDATS2SFL02B
232937141006      *
232938141006      *
232939141006     C                     Z-ADDD@RR      I
232940141006     C                     MOVE S2KD      S2TI,I
232941141006     C                     MOVE YES       @CHG
232942140930      *
232943140930      *
232944140930     C                     READCS2SFL02B                 21
232945140930E1   C                     ENDDO
232981141006      *
232982141006      *
232983141006B1   C           P02BSR    IFEQ *ZERO
232984141009      *
232985141009      * Setup from PNL01A
232986141009     C                     CLEARS2KD
232987141009     C                     Z-ADD130       S2TAGC
232988141009     C                     MOVE D1CI01    S2CI
232989141006      *
232990141006      *
232991141006     C                     CLEARS2
232992141006     C                     CLEARI
232993141006     C                     Z-ADD50        E2
232994141006B2   C           I         DOUEQP02BRR
232995141009      ***C                     ADD  1         I
232996141006      *
232997141006      *
232998141009     C           I         IFGT *ZERO
232999141006     C                     MOVE S2TI,I    S2KD
233000141009     C                     ENDIF
233001141006B3   C           S2TAGC    IFNE *ZERO
233002141006      *
233003141006      *
233004141006     C                     Z-ADDE2        J
233005141006     C           S2KY      LOKUPS2,J                     99
233006141006B4   C                     SELEC
233007141006W4   C           *IN99     WHEQ *ON
233008141006      *
233009141006      *
233010141006W4   C           *IN99     WHEQ *OFF
233011141006      *
233012141006      *
233013141006     C                     SUB  1         E2
233014141006     C                     Z-ADDE2        J
233015141006     C                     MOVE S2KY      S2,J
233016141006      *
233017141006      *
233018141006E4   C                     ENDSL
233019141006      *
233020141006      *
233021141006     C                     MOVE *OFF      *IN99
233022141006     C                     MOVE S2CI      T1CI
233023141006      *
233024141006      *
233025141006     C           I         ADD  1         K
233026141006B4   C           K         DOWLEP02BRR
233027141006     C           *IN99     ANDEQ*OFF
233028141006     C                     MOVE S2TI,K    S2KD
233029141006B5   C                     SELEC
233030141006W5   C           T1CI      WHEQ '.'
233031141006     C           S2KY      ANDEQS2,J
233032141006     C           S2CI      ANDEQ'*'
233033141006     C                     MOVE *ON       *IN99
233034141006W5   C           T1CI      WHEQ '*'
233035141006     C           S2KY      ANDEQS2,J
233036141006     C                     MOVE *ON       *IN99
233037141006E5   C                     ENDSL
233038141006     C                     ADD  1         K
233039141006E4   C                     ENDDO
233040141006      *
233041141006      *
233042141006B4   C           *IN99     IFEQ *OFF
233043141006     C           T1CI      ANDEQ'.'
233044141006     C           *IN99     OREQ *ON
233045141006     C           T1CI      ANDEQ'*'
233046141009      *
233047141009      *
233048141009B4   C                     SELEC
233049141009W4   C           T1CI      WHEQ '.'
233050141009     C                     MOVE 'MSG1589' X@MI
233051141009     C                     CALL 'QMHSNDPM'@SNDPM
233052141009W4   C           T1CI      WHEQ '*'
233053141009     C                     MOVE 'MSG1588' X@MI
233054141009     C                     CALL 'QMHSNDPM'@SNDPM
233055141009E4   C                     ENDSL
233056141009      *
233057141009      *
233058141009B5   C                     SELEC
233059141009W5   C           I         WHEQ *ZERO
233060141009      *
233061141009      * Process error indicators for PNL01A
233062141009     C                     MOVEAP01A60    *IN,60
233063141009     C                     MOVE *ON       *IN93
233064141009     C                     MOVE '*ERR'    @FMT02
233065141009     C                     MOVEA*IN,60    P01A60
233066141009     C           1.1       IFLT D@SE01
233067141009     C           D@SE01    OREQ *ZERO
233068141009     C                     Z-ADD1.1       D@SE01
233069141009     C                     ENDIF
233070141009     C           1.1       IFLT D@SE00
233071141009     C           D@SE00    OREQ *ZERO
233072141009     C                     Z-ADD1.1       D@SE00
233073141009     C                     ENDIF
233074141009      *
233075141009      * Process error indicators for PNL02C
233076141009W5   C           I         WHGT *ZERO
233077141009      *
233078141009      *
233079141006     C           I         CHAINS2SFL02B             99
233080141006     C                     MOVEAS02B01    *IN,01
233081141006     C                     MOVEAS02B80    *IN,80
233082141006      *
233083141006      *
233084141006     C                     MOVE *ON       *IN94
233085141006     C                     MOVE '*ERR'    @FMT02
233086141006      *
233087141006      *
233088141006     C                     MOVEA*IN,80    S02B80
233089141006     C                     MOVE *ON       *IN,21
233090141009B6   C           P02BSR    IFEQ *ZERO
233091141009     C                     Z-ADDI         P02BSR
233092141009E6   C                     ENDIF
233093141006      *
233094141006      *
233095141006     C                     MOVE *OFF      *IN,09
233096141006     C                     MOVE *IN09     S2I09
233097141006     C                     MOVE *OFF      S2NEF
233098141006     C                     MOVEA*IN,01    S02B01
233099141006     C                     UPDATS2SFL02B
233100141006      *
233101141006      *
233102141006     C                     MOVE S2KD      S2TI,I
233103141006      *
233104141006      *
233105141006     C                     MOVE YES       @CHG
233106141006      *
233107141006      *
233108141006     C                     Z-ADDI         T1I
233109141006      ***C                     EXSR @I902C
233110141006     C                     Z-ADDT1I       I
233111141009      *
233112141009      *
233113141009E5   C                     ENDSL
233114141006      *
233115141006      *
233116141006E4   C                     ENDIF
233117141006      *
233118141006      *
233119141006E3   C                     ENDIF
233120141006      *
233121141006      *
233122141009     C                     ADD  1         I
233123141006E2   C                     ENDDO
233124141006      *
233125141006      *
233126141006E1   C                     ENDIF
233127141001      *
233128141001      *
233129141001B1   C           P02BSR    IFNE *ZERO
233130141001     C                     Z-ADDP02BSR    P02BRN
233131141001X1   C                     ELSE
233132141001B2   C           P02BSC    IFLE P02BRR
233133141001     C                     Z-ADDP02BSC    P02BRN
233134141001E2   C                     ENDIF
233135141001B2   C           P02BRN    IFEQ *ZERO
233136141001     C                     Z-ADD1         P02BRN
233137141001E2   C                     ENDIF
233138141001E1   C                     ENDIF
233139140929      *
233140140929      *
233141140929     C                     ENDSR
233142140929      *
233143141002      *
233144141002      *-------------------------------------------------------------------------
233145141002     C           @VP02C    BEGSR
233146141002      *-------------------------------------------------------------------------
233147141002      *
233148141002      *
233149141002     C                     MOVE *ZEROS    P02C60
233150141002     C                     MOVEAP02C60    *IN,60
233151141002      *
233152141002      *
233153141002     C                     MOVEA*IN,60    P02C60
233154141002      *
233155141002      * Author(s)
233156141002     C                     EXSR @VS02C
233157141002      *
233158141002      *
233159141002     C                     ENDSR
233160141002      *
233161141002      *-------------------------------------------------------------------------
233162141002     C           @VS02C    BEGSR
233163141002      *-------------------------------------------------------------------------
233164141002      *
233165141002      *
233166141002     C                     CLEARP02CSR
233167141002      *
233168141002      *
233169141002     C                     READCS2SFL02C                 21
233170141008      *
233171141008      * If records changed, force "header file" into changed state.
233172141008     C           *IN21     IFEQ *ON
233173141008     C                     MOVEL'*CURRENT'X@IDF     P
233174141008     C                     EXSR @DTDTS
233175141008     C                     MOVE @DT       BLEDTS
233176141008     C                     ENDIF
233177141008      *
233178141008      *
233179141002B1   C           *IN21     DOWEQ*OFF
233180141002     C                     MOVEAS02C01    *IN,01
233181141002     C                     MOVE *ZEROS    S02C80
233182141002     C                     MOVEAS02C80    *IN,80
233183141009      *
233184141009      *
233185141009     C                     MOVE *ON       S2CHG
233186141002      *
233187141002      * If no MARC tag, all fields must be empty
233188141002B2   C           S2TAGC    IFEQ *ZERO
233189141002      *
233190141002      *
233191141002B3   C           S2SEQN    IFNE *ZERO
233192141002     C           D1DO      ANDEQ*ON
233193141002     C                     MOVE 'MSG1569' X@MI
233194141002     C                     CALL 'QMHSNDPM'@SNDPM
233195141002     C                     MOVE *ON       *IN96
233196141006     C                     MOVE '*ERR'    @FMT02
233197141002E3   C                     ENDIF
233198141002      *
233199141002      *
233200141002B3   C           S2FATN    IFNE *BLANKS
233201141002     C           S2FATN    ANDNE'*BLANK'
233202141002     C           D1DO      ANDEQ*ON
233203141002     C           D1,11     ANDEQ'.'
233204141002     C                     MOVE 'MSG1575' X@MI
233205141002     C                     CALL 'QMHSNDPM'@SNDPM
233206141002     C                     MOVE *ON       *IN95
233207141006     C                     MOVE '*ERR'    @FMT02
233208141002E3   C                     ENDIF
233209141002      *
233210141002      *
233211141002B3   C           S2CI      IFNE *BLANKS
233212141002     C           D1DO      ANDEQ*ON
233213141002     C           D1,12     ANDEQ'.'
233214141002     C                     MOVE 'MSG1571' X@MI
233215141002     C                     CALL 'QMHSNDPM'@SNDPM
233216141002     C                     MOVE *ON       *IN94
233217141006     C                     MOVE '*ERR'    @FMT02
233218141002E3   C                     ENDIF
233219141002      *
233220141002      *
233221141002X2   C                     ELSE
233222141002      *
233223141002      * MARC tag
233224141002     C                     MOVE S2TAGC    MTTAGC
233225141002     C                     EXSR @RTMT
233226141002B3   C           X@ECBA    IFNE *ZERO
233227141002     C           D1DO      ANDEQ*ON
233228141002     C                     CALL 'QMHSNDPM'@SNDPM
233229141002     C                     MOVE *ON       *IN97
233230141006     C                     MOVE '*ERR'    @FMT02
233231141002E3   C                     ENDIF
233232141002      *
233233141002      * MARC tag is not a valid 'Author' tag
233234141002B3   C           MTTGTP    IFNE 'AU'
233235141002     C           D1DO      ANDEQ*ON
233236141002     C                     MOVE 'MSG1576' X@MI
233237141002     C                     CALL 'QMHSNDPM'@SNDPM
233238141002     C                     MOVE *ON       *IN97
233239141006     C                     MOVE '*ERR'    @FMT02
233240141002E3   C                     ENDIF
233241141002      *
233242141002      * Sequence must be zero when tag is non repeatable.
233243141002B3   C           MTTGIR    IFNE 'Y'
233244141002     C           S2SEQN    ANDNE*ZERO
233245141002     C           D1DO      ANDEQ*ON
233246141004     C           *IN10     ANDEQ*OFF
233247141002     C                     MOVE 'MSG1573' X@MI
233248141002     C                     CALL 'QMHSNDPM'@SNDPM
233249141002     C                     MOVE *ON       *IN96
233250141006     C                     MOVE '*ERR'    @FMT02
233251141002E3   C                     ENDIF
233252141002      *
233253141002      * Author
233254141002B3   C                     SELEC
233255141002W3   C           S2FATN    WHEQ *BLANKS
233256141002     C           D1DO      ANDEQ*ON
233257141002     C           D1,11     ANDEQ'.'
233258141002     C           *IN10     ANDEQ*OFF
233259141002     C                     MOVE 'MSG1568' X@MI
233260141002     C                     CALL 'QMHSNDPM'@SNDPM
233261141002     C                     MOVE *ON       *IN95
233262141006     C                     MOVE '*ERR'    @FMT02
233263141002      *
233264141002      * Author
233265141002W3   C           S2FATN    WHEQ *BLANKS
233266141002     C           D1DO      ANDEQ*ON
233267141002     C           D1,11     ANDEQ'.'
233268141002     C                     MOVE 'MSG1577' X@MI
233269141002     C                     CALL 'QMHSNDPM'@SNDPM
233270141002     C                     MOVE *ON       *IN95
233271141006     C                     MOVE '*ERR'    @FMT02
233272141002E3   C                     ENDSL
233273141002      *
233274141006      * Author continuation indicator
233275141002B3   C           S2CI      IFNE '*'
233276141002     C           S2CI      ANDNE'.'
233277141002     C           D1DO      ANDEQ*ON
233278141002     C           D1,12     ANDEQ'.'
233279141002     C                     MOVE 'MSG1566' X@MI
233280141002     C                     CALL 'QMHSNDPM'@SNDPM
233281141002     C                     MOVE *ON       *IN94
233282141006     C                     MOVE '*ERR'    @FMT02
233283141002E3   C                     ENDIF
233284141002      *
233285141002      *
233286141002E2   C                     ENDIF
233287141002      *
233288141002      *
233289141002     C                     MOVEA*IN,80    S02C80
233290141006B2   C           S02C80    IFNE *ZEROS
233291141006     C                     MOVE *OFF      *IN09
233292141006     C                     MOVE *IN09     S2I09
233293141006     C                     MOVE *OFF      S2NEF
233294141002     C                     MOVE *ON       *IN,21
233295141006B3   C           P02CSR    IFEQ *ZERO
233296141002     C                     Z-ADDD@RR      P02CSR
233297141006E3   C                     ENDIF
233298141006X2   C                     ELSE
233299141006      *
233300141006      *
233301141006     C           D@RR      DIV  P02CSP    I
233302141005     C                     MVR            I
233303141006B3   C           I         IFLE 1
233304141006     C                     MOVE *ON       *IN09
233305141006E3   C                     ENDIF
233306141006     C                     MOVE *IN09     S2I09
233307141006     C                     MOVE *ON       S2NEF
233308141006      *
233309141006      *
233310141006E2   C                     ENDIF
233311141006      *
233312141006      *
233313141006     C                     MOVEA*IN,01    S02C01
233314141002     C                     UPDATS2SFL02C
233315141002      *
233316141002      *
233317141004     C                     Z-ADDD@RR      I
233318141004     C                     MOVE S2KD      S2AU,I
233319141002     C                     MOVE YES       @CHG
233320141006      *
233321141006      *
233322141008     C                     MOVE *OFF      @NSU
233323141006     C                     EXSR @I902C
233324141006      *
233325141006      *
233326141006     C                     READCS2SFL02C                 21
233327141006E1   C                     ENDDO
233328141006      *
233329141006      *
233330141006B1   C           P02CSR    IFEQ *ZERO
233331141006      *
233332141009      * Setup from PNL01A
233333141009     C                     CLEARS2KD
233334141009     C                     Z-ADD100       S2TAGC
233335141009     C                     MOVE D1CI02    S2CI
233336141009      *
233337141009      *
233338141006     C                     CLEARS2
233339141006     C                     CLEARI
233340141006     C                     Z-ADD50        E2
233341141009B2   C           I         DOUGTP02CRR
233342141009      ***C                     ADD  1         I
233343141006      *
233344141006      *
233345141009     C           I         IFGT *ZERO
233346141006     C                     MOVE S2AU,I    S2KD
233347141009     C                     ENDIF
233348141006B3   C           S2TAGC    IFNE *ZERO
233349141006      *
233350141006      *
233351141006     C                     Z-ADDE2        J
233352141006     C           S2KY      LOKUPS2,J                     99
233353141006B4   C                     SELEC
233354141006W4   C           *IN99     WHEQ *ON
233355141006      *
233356141006      *
233357141006W4   C           *IN99     WHEQ *OFF
233358141006      *
233359141006      *
233360141006     C                     SUB  1         E2
233361141006     C                     Z-ADDE2        J
233362141006     C                     MOVE S2KY      S2,J
233363141006      *
233364141006      *
233365141006E4   C                     ENDSL
233366141006      *
233367141006      *
233368141006     C                     MOVE *OFF      *IN99
233369141006     C                     MOVE S2CI      T1CI
233370141006      *
233371141006      *
233372141006     C           I         ADD  1         K
233373141006B4   C           K         DOWLEP02CRR
233374141006     C           *IN99     ANDEQ*OFF
233375141006     C                     MOVE S2AU,K    S2KD
233376141006B5   C                     SELEC
233377141006W5   C           T1CI      WHEQ '.'
233378141006     C           S2KY      ANDEQS2,J
233379141006     C           S2CI      ANDEQ'*'
233380141006     C                     MOVE *ON       *IN99
233381141006W5   C           T1CI      WHEQ '*'
233382141006     C           S2KY      ANDEQS2,J
233383141006     C                     MOVE *ON       *IN99
233384141006E5   C                     ENDSL
233385141006     C                     ADD  1         K
233386141006E4   C                     ENDDO
233387141006      *
233388141006      *
233389141006B4   C           *IN99     IFEQ *OFF
233390141006     C           T1CI      ANDEQ'.'
233391141006     C           *IN99     OREQ *ON
233392141006     C           T1CI      ANDEQ'*'
233393141009      *
233394141009      *
233395141009B5   C                     SELEC
233396141009W5   C           T1CI      WHEQ '.'
233397141009     C                     MOVE 'MSG1589' X@MI
233398141009     C                     CALL 'QMHSNDPM'@SNDPM
233399141009W5   C           T1CI      WHEQ '*'
233400141009     C                     MOVE 'MSG1588' X@MI
233401141009     C                     CALL 'QMHSNDPM'@SNDPM
233402141009E5   C                     ENDSL
233403141009      *
233404141009      *
233405141009B5   C                     SELEC
233406141009W5   C           I         WHEQ *ZERO
233407141009      *
233408141009      * Process error indicators for PNL01A
233409141009     C                     MOVEAP01A60    *IN,60
233410141009     C                     MOVE *ON       *IN90
233411141009     C                     MOVE '*ERR'    @FMT02
233412141009     C                     MOVEA*IN,60    P01A60
233413141009     C           1.1       IFLT D@SE01
233414141009     C           D@SE01    OREQ *ZERO
233415141009     C                     Z-ADD1.1       D@SE01
233416141009     C                     ENDIF
233417141009     C           1.1       IFLT D@SE00
233418141009     C           D@SE00    OREQ *ZERO
233419141009     C                     Z-ADD1.1       D@SE00
233420141009     C                     ENDIF
233421141009      *
233422141009      * Process error indicators for PNL02C
233423141009W5   C           I         WHGT *ZERO
233424141009      *
233425141009      *
233426141006     C           I         CHAINS2SFL02C             99
233427141006     C                     MOVEAS02C01    *IN,01
233428141006     C                     MOVEAS02C80    *IN,80
233429141006      *
233430141006      *
233431141006     C                     MOVE *ON       *IN94
233432141006     C                     MOVE '*ERR'    @FMT02
233433141006      *
233434141006      *
233435141006     C                     MOVEA*IN,80    S02C80
233436141006     C                     MOVE *ON       *IN,21
233437141009B6   C           P02CSR    IFEQ *ZERO
233438141006     C                     Z-ADDI         P02CSR
233439141009E6   C                     ENDIF
233440141006      *
233441141006      *
233442141006     C                     MOVE *OFF      *IN,09
233443141006     C                     MOVE *IN09     S2I09
233444141006     C                     MOVE *OFF      S2NEF
233445141006     C                     MOVEA*IN,01    S02C01
233446141008      *
233447141008      *
233448141006     C                     UPDATS2SFL02C
233449141006      *
233450141006      *
233451141006     C                     MOVE S2KD      S2AU,I
233452141006      *
233453141006      *
233454141006     C                     MOVE YES       @CHG
233455141006      *
233456141006      *
233457141006     C                     Z-ADDI         T1I
233458141008     C                     MOVE *ON       @NSU
233459141008     C                     EXSR @I902C
233460141006     C                     Z-ADDT1I       I
233461141009      *
233462141009      *
233463141009E5   C                     ENDSL
233464141006      *
233465141006      *
233466141006E4   C                     ENDIF
233467141006      *
233468141006      *
233469141006E3   C                     ENDIF
233470141006      *
233471141006      *
233472141009     C                     ADD  1         I
233473141006E2   C                     ENDDO
233474141006      *
233475141006      *
233476141006E1   C                     ENDIF
233477141006      *
233478141006      *
233479141006B1   C           P02CSR    IFNE *ZERO
233480141006     C                     Z-ADDP02CSR    P02CRN
233481141006X1   C                     ELSE
233482141006B2   C           P02CSC    IFLE P02CRR
233483141006     C                     Z-ADDP02CSC    P02CRN
233484141006E2   C                     ENDIF
233485141006B2   C           P02CRN    IFEQ *ZERO
233486141006     C                     Z-ADD1         P02CRN
233487141006E2   C                     ENDIF
233488141006E1   C                     ENDIF
233489141006      *
233490141006      *
233491141006     C                     ENDSR
233492141006      *
233493141006      *-------------------------------------------------------------------------
233494141006     C           @I902C    BEGSR
233495141006      *-------------------------------------------------------------------------
233496141004      *
233497141006      * Adjust *in09=(PC) for first record on page...
233498141006     C                     Z-ADDD@RR      T2I
233499141006      *
233500141006      * Calculate "last" record on subfile "page" for current record.
233501141006     C           D@RR      DIV  P02CSP    I
233502141006     C                     MVR            I
233503141006B2   C           I         IFNE *ZERO
233504141006     C           P02CSP    SUB  I         I
233505141006E2   C                     ENDIF
233506141006     C           D@RR      ADD  I         J                'last'
233507141006      *
233508141006      * Calculate "first" record on subfile "page" for current record.
233509141006     C           J         SUB  P02CSP    I
233510141006     C           I         ADD  1         I                'first'
233511141006      *
233512141006      *
233513141006      *
233514141006      * Read array backwards, from "last" to "first+1" subfile on "page."
233515141006      *   Test NEF for each record.
233516141008     C                     MOVE *OFF      *IN99
233517141006B2   C           J         DOULTI
233518141006     C                     MOVE S2AU,J    S2KD
233519141006B3   C           S2NEF     IFEQ *OFF
233520141008     C                     MOVE *ON       *IN99
233521141006E3   C                     ENDIF
233522141006     C                     SUB  1         J
233523141006E2   C                     ENDDO
233524141006      *
233525141006      *
233526141006     C                     MOVE S2AU,I    S2KD
233527141006      *
233528141006      * Make status of *IN09 reflect (no)errors found on page.
233529141008B2   C           *IN99     IFEQ *ON
233530141006     C           S2I09     ANDEQ*ON
233531141008     C           *IN99     OREQ *OFF
233532141006     C           S2I09     ANDEQ*OFF
233533141006      *
233534141006      *
233535141008     C           I         CHAINS2SFL02C             21
233536141006     C                     MOVEAS02C01    *IN,01
233537141006     C                     MOVEAS02C80    *IN,80
233538141006     C           S02C80    IFNE *ZEROS
233539141006     C                     MOVE *ON       *IN21
233540141006     C                     ENDIF
233541141008B3   C           *IN99     IFEQ *ON
233542141006     C                     MOVE *OFF      *IN09
233543141006X3   C                     ELSE
233544141006     C                     MOVE *ON       *IN09
233545141006E3   C                     ENDIF
233546141006     C                     MOVE *IN09     S2I09
233547141006     C                     MOVEA*IN,01    S02C01
233548141006     C                     UPDATS2SFL02C
233549141006     C                     MOVE S2KD      S2AU,I
233550141006      *
233551141006      * Refresh original record processed, so its not re-read.
233552141006B3   C           T2I       IFNE I
233553141008     C           @NSU      ANDEQ*OFF
233554141008     C           T2I       CHAINS2SFL02C             21
233555141008B4   C           *IN21     IFEQ *OFF
233556141008     C                     MOVEAS02C01    *IN,01
233557141006     C                     MOVEAS02C80    *IN,80
233558141006B5   C           S02C80    IFNE *ZEROS
233559141006     C                     MOVE *ON       *IN,21
233560141006E5   C                     ENDIF
233561141006     C                     UPDATS2SFL02C
233562141006E4   C                     ENDIF
233563141006E3   C                     ENDIF
233564141006      *
233565141006      *
233566141006E2   C                     ENDIF
233567141002      *
233568141002      *
233569141002     C                     ENDSR
233570141002      *
233571141002      *-------------------------------------------------------------------------
233572141002     C           @VP02D    BEGSR
233573141002      *-------------------------------------------------------------------------
233574141002      *
233575141002      *
233576141002     C                     MOVE *ZEROS    P02D60
233577141002     C                     MOVEAP02D60    *IN,60
233578141003      *
233579141003      *
233580141003     C           D1RPDD    IFNE *BLANKS
233581141003     C                     MOVE *ON       *IN97
233582141006     C                     MOVE '*ERR'    @FMT02
233583141003     C                     ENDIF
233584141002      *
233585141002      *
233586141002     C                     MOVEA*IN,60    P02D60
233587141002      *
233588141002      *
233589141002     C                     ENDSR
233590140925      *
233591140925      *-------------------------------------------------------------------------
233592140925     C           RT@F2     BEGSR
233593140925      *-------------------------------------------------------------------------
233594140925      *
233595140925      *
233596140925     C                     CLEARX@ECBA
233597140928      *
233598140928      *
233599140928     C                     CLEARD1FTTL
233600140928     C                     CLEARD1CI01
233601140925      *
233602140925      *
233603141002     C                     MOVE *ON       *IN03
233604141005     C                     Z-ADD1         P02BSP
233605141005     C                     Z-ADD1         P02BSC
233606140927     C                     WRITEC2PNL02B
233607140925      *
233608140925      *
233609141002     C                     CLEARD@RR
233610140930      ***C                     CLEARTI@RR
233611140926     C                     CLEARJ
233612140926      *
233613140926      *
233614140928     C                     MOVE BLISBN    EISBN3
233615140926     C                     CLEARTITAGC
233616140926     C                     CLEARDSEQN0
233617140928     C                     CLEARTIDSQN
233618140925      *
233619140925      *
233620140927B1   C           TI@EOF    DOUEQ*ON
233621141002      *
233622141002      *
233623141002     C                     MOVEAD1,11     WK002C  2
233624141002     C                     CLEARS2SFL02B
233625141002     C                     MOVEAWK002C    D1,11
233626141002      *
233627141002      *
233628141002     C                     MOVE *ZEROS    S02B01
233629141002     C                     MOVEAS02B01    *IN,01
233630141002     C                     MOVE *ZEROS    S02B80
233631141002     C                     MOVEAS02B80    *IN,80
233632141002      *
233633141002      *
233634141002     C           1         SUBSTP00#01:2  *IN,02
233635140925      *
233636140925      *
233637140925     C                     EXSR @RTTI
233638140928      *
233639140928      * If first part of 130=Main entry, uniform title
233640140929     C                     SELEC
233641141002B2   C           X@ECBA    WHEQ *ZERO
233642140929W2   C           F2TAGC    ANDEQ130
233643140928     C           F2SEQN    ANDEQ0
233644140928     C           F2DSQN    ANDEQ0
233645140928      *
233646140928      *
233647141009     C           1         OCUR D1FTTL
233648140928     C                     MOVELW1FTTL    D1FTTL
233649141009     C           2         OCUR D1FTTL
233650141009     C                     MOVELW1FTTL    D1FTTL
233651140928     C                     MOVE TI@CI     D1CI01
233652140928      *
233653140928      *
233654140929W2   C           X@ECBA    WHEQ *ZERO
233655140929      *
233656140929      *
233657140929     C                     MOVE *ON       *IN,10
233658140928      *
233659140928      *
233660140928     C                     Z-ADDF2TAGC    S2TAGC
233661140928     C                     Z-ADDF2SEQN    S2SEQN
233662140928     C                     MOVELW1FTTL    S2FTTL
233663140928     C                     MOVE TI@CI     S2CI
233664140928      *
233665140928      *
233666140928     C                     MOVE F2TAGC    MTTAGC
233667140928     C                     EXSR @RTMT
233668140928      *
233669140928      *
233670141002     C                     ADD  1         D@RR
233671141005     C           D@RR      DIV  P02BSP    J
233672140926     C                     MVR            J
233673140925     C                     SELEC
233674140926     C           J         WHNE *ZERO
233675140926     C                     CLEARS2EOF
233676140928     C           TI@EOF    WHEQ *OFF
233677141005     C           D@RR      ANDGTP02BSP
233678140928     C                     MOVE '-/+'     S2EOF
233679140928     C           TI@EOF    WHEQ *OFF
233680140928     C                     MOVE ' /+'     S2EOF
233681141002     C           D@RR      WHGT 1
233682140929     C           S1OPT     ANDEQ' 5'
233683140929     C           TI@EOF    ANDEQ*ON
233684140929     C                     MOVE '-/ '     S2EOF
233685141005     C           D@RR      WHGT P02BSP
233686140928     C           S1OPT     ANDNE' 5'
233687140928     C                     MOVE '-/+'     S2EOF
233688140926     C           S1OPT     WHNE ' 5'
233689140926     C                     MOVE ' /+'     S2EOF
233690140925     C                     OTHER
233691140925     C                     MOVE ' / '     S2EOF
233692140925     C                     ENDSL
233693141005      *
233694141005      *
233695141005     C           D@RR      DIV  P02BSP    K
233696141004     C                     MVR            K
233697141004     C           K         IFLE 1
233698141005     C                     MOVE *ON       *IN09
233699141004     C                     ENDIF
233700141006     C                     MOVE *IN09     S2I09
233701141006     C                     MOVE *ON       S2NEF
233702141005      *
233703141005      *
233704141005     C                     MOVEA*IN,01    S02B01
233705141005     C                     MOVEA*IN,80    S02B80
233706140927     C                     WRITES2SFL02B
233707141004      *
233708141004      *
233709141004     C                     Z-ADDD@RR      K
233710141004     C                     MOVE S2KD      S2TI,K
233711140926      *
233712140926      *
233713140929E2   C                     ENDSL
233714140925      *
233715140925      *
233716140926E1   C                     ENDDO
233717141010      *
233718141010      *
233719141010     C                     Z-ADDD@RR      P02BRR
233720141010      *
233721141010      *
233722141010     C                     EXSR @FBF2
233723141010      *
233724141010      *
233725141010     C                     ENDSR
233726141010      *
233727141010      *-------------------------------------------------------------------------
233728141010     C           @FBF2     BEGSR
233729141010      *-------------------------------------------------------------------------
233732140929      *
233733140929      *
233734141002     C                     Z-ADDD@RR      I
233735140929      *
233736140929      *
233737140929B1   C                     SELEC
233738140929W1   C           S1OPT     WHNE ' 5'
233739141006     C                     ADD  3         I
233740140929W1   C           I         WHEQ *ZERO
233741140929     C                     Z-ADD1         I
233742140929E1   C                     ENDSL
233743140929      *
233744140929      *
233745141005     C           I         DIV  P02BSP    J
233746140929     C                     MVR            J
233747140929      *
233748140929      * If J is not zero then "some" more records must be added to fill.
233749140929     C           J         IFNE *ZERO
233750140929     C           1         SUB  J         J
233751140929     C           I         ADD  J         I
233752140929     C                     ENDIF
233753141004      *
233754141004      *
233755141004     C           I         IFGT 50
233756141004     C                     Z-ADD50        I
233757141004     C                     ENDIF
233758140929      *
233759140929      *
233760141002     C           D@RR      DOWLTI
233761140929      *
233762140929      *
233763140929     C                     MOVEAD1,11     WK002C  2
233764140929     C                     CLEARS2SFL02B
233765140929     C                     MOVEAWK002C    D1,11
233766141002      *
233767141002      *
233768141002     C                     MOVE *ZEROS    S02B01
233769141002     C                     MOVEAS02B01    *IN,01
233770141002     C                     MOVE *ZEROS    S02B80
233771141002     C                     MOVEAS02B80    *IN,80
233772141002      *
233773141002      *
233774141002     C           1         SUBSTP00#01:2  *IN,02
233775140929      *
233776140929      *
233777141002     C                     ADD  1         D@RR
233778141002     C           D@RR      IFEQ I
233779140929     C                     MOVE *ON       TI@EOF
233780140929     C                     ELSE
233781140929     C                     MOVE *OFF      TI@EOF
233782140929     C                     ENDIF
233783141005     C           D@RR      DIV  P02BSP    J
233784140929     C                     MVR            J
233785140929     C                     SELEC
233786140929     C           J         WHNE *ZERO
233787140929     C                     CLEARS2EOF
233788140929     C           TI@EOF    WHEQ *OFF
233789141005     C           D@RR      ANDGTP02BSP
233790140929     C                     MOVE '-/+'     S2EOF
233791140929     C           TI@EOF    WHEQ *OFF
233792140929     C                     MOVE ' /+'     S2EOF
233793141005     C           D@RR      WHGT P02BSP
233794140929     C           TI@EOF    ANDEQ*ON
233795140929     C                     MOVE '-/ '     S2EOF
233796141005     C           D@RR      WHGT P02BSP
233797140929     C                     MOVE '-/+'     S2EOF
233798140929     C                     OTHER
233799140929     C                     MOVE ' / '     S2EOF
233800140929     C                     ENDSL
233801140929      *
233802140929      *
233803141005     C           D@RR      DIV  P02BSP    K
233804141004     C                     MVR            K
233805141004     C           K         IFLE 1
233806141005     C                     MOVE *ON       *IN09
233807141004     C                     ENDIF
233808141006     C                     MOVE *IN09     S2I09
233809141006     C                     MOVE *ON       S2NEF
233810141005      *
233811141005      *
233812141005     C                     MOVEA*IN,01    S02B01
233813141005     C                     MOVEA*IN,80    S02B80
233814140927     C                     WRITES2SFL02B
233815141004      *
233816141004      *
233817141004     C                     Z-ADDD@RR      K
233818141004     C                     MOVE S2KD      S2TI,K
233819140929      *
233820140929      *
233821140925     C                     ENDDO
233822140930      *
233823140930      *
233824141002     C                     Z-ADDD@RR      P02BRR
233825140925      *
233826140925      *
233827140925     C                     ENDSR
233828140929      *
233829140929      *-------------------------------------------------------------------------
233830140929     C           RT@F3     BEGSR
233831140929      *-------------------------------------------------------------------------
233832140929      *
233833140929      *
233834140929     C                     CLEARX@ECBA
233835140929      *
233836140929      *
233837140929     C                     CLEARD1FATN
233838140929     C                     CLEARD1CI02
233839140929      *
233840140929      *
233841141002     C                     MOVE *ON       *IN03
233842141008     C                     Z-ADD2         P02CSP
233843141005     C                     Z-ADD1         P02CSC
233844140929     C                     WRITEC2PNL02C
233845140929      *
233846140929      *
233847141002     C                     CLEARD@RR
233848140929      ***C                     CLEARAU@RR
233849140929     C                     CLEARJ
233850140929      *
233851140929      *
233852140929     C                     MOVE BLISBN    AUISBN
233853140929     C                     CLEARAUTAGC
233854140929     C                     CLEARAUSEQN
233855140929     C                     CLEARAUDSQN
233856140929      *
233857140929      *
233858140929B1   C           AU@EOF    DOUEQ*ON
233859141002      *
233860141002      *
233861141002     C                     MOVEAD1,13     WK002C  2
233862141002     C                     CLEARS2SFL02C
233863141002     C                     MOVEAWK002C    D1,13
233864141002      *
233865141002      *
233866141002     C                     MOVE *ZEROS    S02C01
233867141002     C                     MOVEAS02C01    *IN,01
233868141002     C                     MOVE *ZEROS    S02C80
233869141002     C                     MOVEAS02C80    *IN,80
233870141002      *
233871141002      *
233872141002     C           1         SUBSTP00#01:2  *IN,02
233873140929      *
233874140929      *
233875140929     C                     EXSR @RTAU
233876140929      *
233877140929      * If first part of 100=Main entry, personal name
233878140929B2   C                     SELEC
233879140929W2   C           X@ECBA    WHEQ *ZERO
233880140929     C           F3TAGC    ANDEQ100
233881140929     C           F3SEQN    ANDEQ0
233882140929     C           F3DSQN    ANDEQ0
233883140929      *
233884140929      *
233885141009     C           1         OCUR D1FATN
233886140929     C                     MOVELW1FATN    D1FATN
233887141009     C           2         OCUR D1FATN
233888141009     C                     MOVELW1FATN    D1FATN
233889140929     C                     MOVE AU@CI     D1CI02
233890140929      *
233891140929      *
233892140929W2   C           X@ECBA    WHEQ *ZERO
233893141002      *
233894141002      *
233895140929     C                     MOVE *ON       *IN,10
233896140929      *
233897140929      *
233898140929     C                     Z-ADDF3TAGC    S2TAGC
233899140929     C                     Z-ADDF3SEQN    S2SEQN
233900140929     C                     MOVELW1FATN    S2FATN
233901140929     C                     MOVE AU@CI     S2CI
233902140929      *
233903140929      *
233904140929     C                     MOVE F3TAGC    MTTAGC
233905140929     C                     EXSR @RTMT
233906140929      *
233907140929      *
233908141002     C                     ADD  1         D@RR
233909141005     C           D@RR      DIV  P02CSP    J
233910140929     C                     MVR            J
233911140929     C                     SELEC
233912140929     C           J         WHNE *ZERO
233913140929     C                     CLEARS2EOF
233914140929     C           AU@EOF    WHEQ *OFF
233915141005     C           D@RR      ANDGTP02CSP
233916140929     C                     MOVE '-/+'     S2EOF
233917140929     C           AU@EOF    WHEQ *OFF
233918140929     C                     MOVE ' /+'     S2EOF
233919141005     C           D@RR      WHGT P02CSP
233920140929     C           S1OPT     ANDEQ' 5'
233921140929     C           AU@EOF    ANDEQ*ON
233922140929     C                     MOVE '-/ '     S2EOF
233923141005     C           D@RR      WHGT P02CSP
233924140929     C           S1OPT     ANDNE' 5'
233925140929     C                     MOVE '-/+'     S2EOF
233926140929     C           S1OPT     WHNE ' 5'
233927140929     C                     MOVE ' /+'     S2EOF
233928140929     C                     OTHER
233929140929     C                     MOVE ' / '     S2EOF
233930140929     C                     ENDSL
233931141002      *
233932141002      *
233933141005     C           D@RR      DIV  P02CSP    K
233934141004     C                     MVR            K
233935141004     C           K         IFLE 1
233936141005     C                     MOVE *ON       *IN09
233937141004     C                     ENDIF
233938141006     C                     MOVE *IN09     S2I09
233939141006     C                     MOVE *ON       S2NEF
233940141005      *
233941141005      *
233942141005     C                     MOVEA*IN,01    S02C01
233943141005     C                     MOVEA*IN,80    S02C80
233944140929     C                     WRITES2SFL02C
233945141004      *
233946141004      *
233947141004     C                     Z-ADDD@RR      K
233948141004     C                     MOVE S2KD      S2AU,K
233949140929      *
233950140929      *
233951140929E2   C                     ENDSL
233952140929      *
233953140929      *
233954140929E1   C                     ENDDO
233955141010      *
233956141010      *
233957141010     C                     Z-ADDD@RR      P02CRR
233958141010     C           S1OPT     IFNE ' 5'
233959141010     C                     Z-ADD2         D@PTF
233962141010     C                     ENDIF
233963141010      *
233964141010      *
233965141010     C                     EXSR @FBF3
233966141010      *
233967141010      *
233968141010     C                     ENDSR
233969141010      *
233970141010      *-------------------------------------------------------------------------
233971141010     C           @FBF3     BEGSR
233972141010      *-------------------------------------------------------------------------
233973140929      *
233974140929      *
233977141010     C                     Z-ADDD@RR      I
233979141010      *
233980141010      *
233981141012     C                     MOVE *OFF      *IN99
233982141010B1   C           I         IFEQ *ZERO
233983141010     C                     Z-ADDP02CSP    I
233984141010X1   C                     ELSE
233985141010      *
233986141010      *
233987141010     C           I         DIV  P02CSP    J
233988141010     C                     MVR            J
233989141010      *
233990141010      * If J is not zero then "some" more records must be added to fill.
233991141010B2   C           J         IFNE *ZERO
233992141010     C           P02CSP    SUB  J         J
233993141010     C           I         ADD  J         I
233994141010      *
233995141010      *
233996141010X2   C                     ELSE
233997141010     C                     MOVE *ON       *IN99
234006141010E2   C                     ENDIF
234007141010E1   C                     ENDIF
234008141010      *
234009141010      *
234010141010     C           D@PTF     MULT P02CSP    J
234011141010     C           I         ADD  J         J
234012141010      *
234013141010      *
234014141010B1   C           J         IFGT 50
234015141010     C                     Z-ADD50        J
234016141010E1   C                     ENDIF
234017141010      *
234019141010      * Adjust current "last record" to reflect more records added.
234020141010B1   C           *IN99     IFEQ *ON
234021141010     C           J         ANDGTI
234022141010     C           I         CHAINS2SFL02C             99
234023141010B2   C           *IN99     IFEQ *OFF
234024141010     C                     MOVEAS02C01    *IN,01
234025141010     C                     MOVEAS02C80    *IN,80
234027141010     C                     MOVE *ON       *IN21
234029141010     C                     MOVE '-/+'     S2EOF
234030141010     C                     UPDATS2SFL02C
234031141010E2   C                     ENDIF
234032141010E1   C                     ENDIF
234033141010      *
234034141010      *
234035141010     C                     Z-ADDJ         I
234036140929      *
234037140929      *
234038141010     C           D@RR      DOWLTI
234039140929      *
234040140929      *
234041140929     C                     MOVEAD1,13     WK002C  2
234042140929     C                     CLEARS2SFL02C
234043140929     C                     MOVEAWK002C    D1,13
234044141002      *
234045141002      *
234046141002     C                     MOVE *ZEROS    S02C01
234047141002     C                     MOVEAS02C01    *IN,01
234048141002     C                     MOVE *ZEROS    S02C80
234049141002     C                     MOVEAS02C80    *IN,80
234050141002      *
234051141002      *
234052141002     C           1         SUBSTP00#01:2  *IN,02
234053141002      *
234054141002      *
234055141002     C                     ADD  1         D@RR
234056141002     C           D@RR      IFEQ I
234057140929     C                     MOVE *ON       AU@EOF
234058140929     C                     ELSE
234059140929     C                     MOVE *OFF      AU@EOF
234060140929     C                     ENDIF
234061141005     C           D@RR      DIV  P02CSP    J
234062140929     C                     MVR            J
234063140929     C                     SELEC
234064140929     C           J         WHNE *ZERO
234065140929     C                     CLEARS2EOF
234066140929     C           AU@EOF    WHEQ *OFF
234067141005     C           D@RR      ANDGTP02CSP
234068140929     C                     MOVE '-/+'     S2EOF
234069140929     C           AU@EOF    WHEQ *OFF
234070140929     C                     MOVE ' /+'     S2EOF
234071141005     C           D@RR      WHGT P02CSP
234072140929     C           TI@EOF    ANDEQ*ON
234073140929     C                     MOVE '-/ '     S2EOF
234074141005     C           D@RR      WHGT P02CSP
234075140929     C                     MOVE '-/+'     S2EOF
234076140929     C                     OTHER
234077140929     C                     MOVE ' / '     S2EOF
234078140929     C                     ENDSL
234079140930      *
234080140930      *
234081141005     C           D@RR      DIV  P02CSP    K
234082141004     C                     MVR            K
234083141004     C           K         IFLE 1
234084141005     C                     MOVE *ON       *IN09
234085141004     C                     ENDIF
234086141006     C                     MOVE *IN09     S2I09
234087141006     C                     MOVE *ON       S2NEF
234088141005      *
234089141005      *
234090141005     C                     MOVEA*IN,01    S02C01
234091141005     C                     MOVEA*IN,80    S02C80
234092140929     C                     WRITES2SFL02C
234093141004      *
234094141004      *
234095141004     C                     Z-ADDD@RR      K
234096141004     C                     MOVE S2KD      S2AU,K
234097140930      *
234098140930      *
234099140929     C                     ENDDO
234100141010      *
234101141010      *
234102141010     C                     CLEARD@PTF
234103140930      *
234104140930      *
234105141002     C                     Z-ADDD@RR      P02CRR
234106140929      *
234107140929      *
234108140929     C                     ENDSR
234109140928      *
234110140928      *-------------------------------------------------------------------------
234111140928     C           @RTTI     BEGSR
234112140928      *-------------------------------------------------------------------------
234113140928      *
234114140928      *
234115140928     C                     CLEARX@ECBA
234116140928      *
234117140928      *
234118140928     C           TIKEY1    SETLLDTAF2R1
234119140928     C           TIKEY2    READEDTAF2R1             N    99
234120140928     C                     MOVE *IN99     TI@EOF
234121140928      *
234122140928      *
234123140928B1   C           TI@EOF    IFEQ *ON
234124140928      *
234125140928      * No Title data found.
234126140928     C                     MOVE 'MSG1811' X@MI
234127140928     C                     Z-ADD7         X@ECBA
234128140928     C                     CLEARTIDS
234129140928E1   C                     ENDIF
234130140928      *
234131140928      *
234132140928B1   C           TITAGC    IFEQ 130
234133140928     C           DSEQN0    ANDEQ0
234134140928     C           TIDSQN    ANDEQ0
234135140928     C                     Z-ADD18        TI@LTS
234136140928X1   C                     ELSE
234137140928     C                     Z-ADD8         TI@LTS
234138140928E1   C                     ENDIF
234139140928      *
234140140928      *
234141140928     C                     Z-ADD0         I
234142140928     C                     Z-ADD0         J
234143140928     C                     Z-ADDTITAGC    F2TAGC
234144140928     C                     Z-ADDDSEQN0    F2SEQN
234145140928     C                     Z-ADDTIDSQN    F2DSQN
234146140928     C                     CLEARW1FTTL
234147140928B1   C           TI@EOF    DOWEQ*OFF
234148140928     C           TITAGC    ANDEQF2TAGC
234149140928     C           DSEQN0    ANDEQF2SEQN
234150140928     C           J         ANDLTTI@LTS
234151140928      *
234152140928      *
234153140928     C                     ADD  1         J
234154140928      *
234155140928      *
234156140928     C           W1FTTL    CAT  DTITL0:I  W1FTTL
234157140928      *
234158140928      *
234159140928     C           ' '       CHEKRDTITL0    I
234160140928     C           30        SUB  I         I
234161140928      *
234162140928      *
234163140928     C           TIKEY2    READEDTAF2R1             N    99
234164140928     C                     MOVE *IN99     TI@EOF
234165140928      *
234166140928      *
234167140928E1   C                     ENDDO
234168140928      *
234169140928      *
234170140928B1   C                     SELEC
234171140929W1   C           TI@EOF    WHEQ *ON
234172140929     C                     MOVE '*'       TI@CI
234173140928W1   C           TI@EOF    WHEQ *OFF
234174140928     C           TITAGC    ANDEQF2TAGC
234175140928     C           DSEQN0    ANDEQF2SEQN
234176140929     C                     MOVE '.'       TI@CI
234177140928W1   C                     OTHER
234178140929     C                     MOVE '*'       TI@CI
234179140928E1   C                     ENDSL
234180140928      *
234181140928      *
234182140928     C                     ENDSR
234183140928      *
234184140928      *-------------------------------------------------------------------------
234185140928     C           @RTAU     BEGSR
234186140928      *-------------------------------------------------------------------------
234187140928      *
234188140928      *
234189140928     C                     CLEARX@ECBA
234190140928      *
234191140928      *
234192140928     C           AUKEY1    SETLLDTAF3R1
234193140928     C           AUKEY2    READEDTAF3R1             N    99
234194140928     C                     MOVE *IN99     AU@EOF
234195140928      *
234196140928      *
234197140928     C           AU@EOF    IFEQ *ON
234198140928      *
234199140928      * No Author(s) details found for bibliographic record
234200140928     C                     MOVE 'MSG1810' X@MI
234201140928     C                     Z-ADD7         X@ECBA
234202140928     C                     CLEARAUDS
234203140928     C                     ENDIF
234204140928      *
234205140928      *
234206141008     C                     Z-ADD8         AU@LTS
234207140928     C                     CLEARW1FATN
234208140928      *
234209140928      *
234210140928     C                     Z-ADD0         I
234211140928     C                     Z-ADD0         J
234212140928     C                     Z-ADDAUTAGC    F3TAGC
234213140928     C                     Z-ADDAUSEQN    F3SEQN
234214140928     C           AU@EOF    DOWEQ*OFF
234215140928     C           AUTAGC    ANDEQF3TAGC
234216140928     C           AUSEQN    ANDEQF3SEQN
234217140928     C           J         ANDLTAU@LTS
234218140928      *
234219140928      *
234220140928     C                     ADD  1         J
234221140928      *
234222140928      *
234223140928     C           W1FATN    CAT  AUAUTN:I  W1FATN
234224140928      *
234225140928      *
234226140928     C           ' '       CHEKRAUAUTN    I
234227140928     C           30        SUB  I         I
234228140928      *
234229140928      *
234230140928     C           AUKEY2    READEDTAF3R1             N    99
234231140928     C                     MOVE *IN99     AU@EOF
234232140928      *
234233140928      *
234234140928     C                     ENDDO
234235140928      *
234236140928      *
234237140928B1   C                     SELEC
234238140929W1   C           AU@EOF    WHEQ *ON
234239140929     C                     MOVE '*'       AU@CI
234240140928W1   C           AU@EOF    WHEQ *OFF
234241140928     C           AUTAGC    ANDEQF3TAGC
234242140928     C           AUSEQN    ANDEQF3SEQN
234243140929     C                     MOVE '.'       AU@CI
234244140928W1   C                     OTHER
234245140929     C                     MOVE '*'       AU@CI
234246140928E1   C                     ENDSL
234247140928      *
234248140928      *
234249140928     C                     ENDSR
234250140923      *
234251140923      *-------------------------------------------------------------------------
234252140923     C           TS@F1O    BEGSR
234253140923      *-------------------------------------------------------------------------
234254140923      *
234255140923      *
234256140923     C                     CLEARX@ECBA
234257140923      *
234258140923      * Lock for update
234259140923     C           F1@LRU    IFEQ *ON
234260140923     C           F1KEY1    CHAINDTAF1R1              99
234261140923      * Get no lock
234262140923     C                     ELSE
234263140923     C           F1KEY1    CHAINDTAF1R1             N99
234264140923     C                     ENDIF
234265140923     C                     MOVE *IN99     F1@NRF
234266140923      *
234267140923      * Option is 1=Create, F6=Create, 3=Copy(exists), 7=Rename(exists)
234268140923B1   C                     SELEC
234269140923W1   C           S1OPT     WHEQ ' 1'
234270140923     C           S1OPT     OREQ 'KF'
234271140923     C           S1OPT     OREQ ' 3'
234272140923     C           F1@TE     ANDEQ*ON
234273140923     C           S1OPT     OREQ ' 7'
234274140923     C           F1@TE     ANDEQ*ON
234275140923      *
234276140923      *
234277140923B2   C                     SELEC
234278140923W2   C           F1@NRF    WHEQ *OFF
234279140923      *
234280140923      * Record already exists
234281140923B3   C           BLDLTD    IFEQ *BLANKS
234282140923     C                     MOVE 'MSG1860' X@MI
234283140923     C                     Z-ADD7         X@ECBA
234284140923X3   C                     ELSE
234285140923      *
234286140923      * Record exists but is flagged as deleted
234287140923     C                     MOVE 'MSG1861' X@MI
234288140923     C                     Z-ADD7         X@ECBA
234289140923E3   C                     ENDIF
234290140923E2   C                     ENDSL
234291140923      *
234292140923      * Else option is, 2=Change, 3=Copy, 4=Delete, 5=View, 7=Rename
234293140923     C           S1OPT     WHNE *BLANKS
234294140923      *
234295140923      * Record does not exist
234296140923B2   C                     SELEC
234297140923W2   C           F1@NRF    WHEQ *ON
234298140923     C                     MOVE 'MSG1862' X@MI
234299140923     C                     Z-ADD7         X@ECBA
234300140923      *
234301140923      * Record is deleted
234302140923W2   C           BLDLTD    WHNE *BLANKS
234303140923     C           S1OPT     ANDNE' 5'
234304140923     C           BLDLTD    ORNE *BLANKS
234305140923     C           S1OPT     ANDEQ' 5'
234306140923     C           F1@TE     ANDEQ*ON
234307140923     C                     MOVE 'MSG1375' X@MI
234308140923     C                     Z-ADD7         X@ECBA
234309140923      *
234310140923      *
234311140923E2   C                     ENDSL
234312140923      *
234313140923      *
234314140923E1   C                     ENDSL
234315140923      *
234316140923      *
234317140923     C                     MOVE *OFF      F1@TE
234318140923     C                     MOVE *OFF      F1@LRU
234319140923      *
234320140923      *
234321140923     C                     ENDSR
234322140923      *
234323140923      *-------------------------------------------------------------------------
234324140925     C           RT@F1     BEGSR
234325140923      *-------------------------------------------------------------------------
234326140923      *
234327140923      *
234328140923     C                     CLEARX@ECBA
234329140923      *
234330140923      * Current record
234331140923     C           #CRRCD    OCUR F1DS
234332140923      *
234333140923      *
234334140923B1   C           S1OPT     IFEQ 'KF'
234335140923     C           #INKEY    OCUR F1AK
234336140923E1   C                     ENDIF
234337140923      *
234338140923      *
234339140923     C                     MOVE 'F1>f?'   KY@DIR
234340140923     C                     EXSR PR@KY
234341140923     C           #CHKEY    OCUR F1AK
234342140923      *
234343140923      *
234344140923     C           *NOKEY    CLEARDTAF1R1
234345140923      *
234346140924      * Transfer, if any, default values.
234347140923     C                     MOVE 'V1>f?'   KY@DIR
234348140923     C                     EXSR PR@KY
234349140923      *
234350140923      *
234351140923     C                     EXSR TS@F1O
234352140923     C           X@ECBA    IFNE *ZERO
234353140923     C                     MOVE X@EC      E@EC
234354140923     C                     CALL 'QMHSNDPM'@SNDPM
234355140923     C                     MOVE E@EC      X@EC
234356140923     C                     ENDIF
234357140923      *
234358140923      *
234359140923     C                     MOVELF1DS      F@DS      P
234360140923      *
234361140923      * Original record
234362140923     C           #ORRCD    OCUR F1DS
234363140923      *
234364140923      *
234365140923     C                     SELEC
234366140923      *
234367140923      * Record has changed since last retrieval
234368140923     C           F1@COC    WHEQ *ON
234369140923     C           F1DS      ANDNEF@DS
234370140923     C                     MOVE *ON       F1@COC
234371140923     C                     MOVE 'MSG1842' X@MI
234372140923     C                     Z-ADD7         X@ECBA
234373140923      *
234374140923      *
234375140923     C           F1@COC    WHEQ *ON
234376140923     C           F1DS      ANDEQF@DS
234377140923     C                     MOVE *OFF      F1@COC
234378140923      *
234379140923      *
234380140923     C                     OTHER
234381140923     C                     MOVE *OFF      F1@COC
234382140923      *
234383140923      * Set original record
234384140923     C                     MOVELF@DS      F1DS      P
234385140923      *
234386140923      * Update record
234387140923     C           #UPRCD    OCUR F1DS
234388140923     C                     MOVELF@DS      F1DS      P
234389140923      *
234390140923      * Screen display record
234391140923     C           #SCRCD    OCUR F1DS
234392140923     C                     MOVELF@DS      F1DS      P
234393140923      *
234394140923      * Perform mandatory conversions
234395140923      ***C           ......    IFNE *ZEROS
234396140923      ***C                     RESETX@ID
234397140923      ***C                     MOVEL......    X@ID
234398140923      ***C                     CALL 'QWCCVTDT'@CVTFD
234399140923      ***C                     MOVELX@OD      .....
234400140923      ***C                     ENDIF
234401140923      *
234402140923      * Save before fields
234403140923      ***C                     MOVE ......    B1....
234404140923      *
234405140923      * Set display fields that cannot have the same name (lists)
234406140923      ***C                     MOVE ......    ...,01
234407140923      *
234408140923      *
234409140923     C                     ENDSL
234410140923      *
234411140923      * Screen display record
234412140923     C           #SCRCD    OCUR F1DS
234413140923      *
234414140923      *
234415140923     C                     ENDSR
234416140924      *
234417140924      *-------------------------------------------------------------------------
234418140924     C           @UPF1     BEGSR
234419140924      *-------------------------------------------------------------------------
234420140924      *
234421140924      * Processing updates
234422140926     C           S1OPT     IFNE ' 5'
234423140924     C                     MOVE 'EXM0002' X@MI
234424140924     C                     Z-ADD27        X@ECBA
234425140924     C                     MOVEL'*EXT'    X@PMQ     P
234426140924     C                     MOVEL'*STATUS' X@MT      P
234427140924     C                     MOVE FNM@11    F@FNAM
234428140924     C                     MOVE FLB@11    F@FLIB
234429140924     C                     MOVELIDF@      X@MDIT
234430140924     C                     CALL 'QMHSNDPM'@SNDPM
234431140924     C                     RESETX@PMQ
234432140924     C                     RESETX@MT
234433140926     C                     ENDIF
234434140924      *
234435140924      *
234436140924     C                     CLEARX@ECBA
234437140924      *
234438140924      *
234439140924     C                     MOVE *ON       F1@LRU
234440140928     C                     EXSR RT@F1
234441140924      *
234442140924      *
234443140924B1   C                     SELEC
234444140924      *
234445140924      * If error has occured and record found
234446140924W1   C           X@ECBA    WHNE *ZERO
234447140924     C           F1@NRF    ANDEQ*OFF
234448140924      *
234449140924      * Release the record lock.
234450140924     C           F1KEY1    SETLLDTAF1R1
234451140924      *
234452140924      * If error
234453140924W1   C           X@ECBA    WHNE *ZERO
234454140924      *
234455140924      * If no error has occured
234456140924W1   C                     OTHER
234457140924      *
234458140924      * Replace the file fields that cannot have the same name
234459140924      ***C                     Z-ADD....,01   ......
234460140924      *
234461140924      *
234462140924     C                     MOVELF1DS      F@DS      P
234463140924     C           #UPRCD    OCUR F1DS
234464140924     C                     MOVELF@DS      F1DS      P
234465140924      *
234466140924      * Peform mandatory conversions, ie dates
234467140924      ***C           ......    IFNE *ZERO
234468140924      ***C                     RESETX@ID
234469140924      ***C                     MOVEL......    X@ID
234470140924      ***C                     CALL 'QWCCVTDT'@CVTDT
234471140924      ***C                     MOVELX@OD      ......
234472140924      ***C                     ENDIF
234473140924      *
234474140924      *
234475140924B2   C                     SELEC
234476140924      * Create record if create option requested
234477140924      *
234478140924W2   C           S1OPT     WHEQ ' 1'
234479140924     C           S1OPT     OREQ 'KF'
234480140924     C           S1OPT     OREQ ' 3'
234481140924      *
234482140924      * Set creation information
234483140924     C                     MOVE S@USER    BLCUSR
234484140924     C                     MOVE S@PGM     BLCPGM
234485140924     C                     MOVEL'*CURRENT'X@IDF     P
234486140924     C                     EXSR @DTDTS
234487140924     C                     MOVE @DT       BLCDTS
234488140924     C                     MOVE S@USER    BLEUSR
234489140924     C                     MOVE S@PGM     BLEPGM
234490140924     C                     MOVE @DT       BLEDTS
234491140924      *
234492140924      *
234493140924     C                     WRITEDTAF1R1                98
234494140924B3   C           *IN98     IFEQ *ON
234495140924     C                     Z-ADD7         X@ECBA
234496140924     C                     MOVE 'MSG1848' X@MI
234497140924E3   C                     ENDIF
234498140926      *
234499140926      * Option is ' 4' delete
234500140926W2   C           S1OPT     WHEQ ' 4'
234501140926      *
234502140926      *
234503140928     C           #UPRCD    OCUR F1DS
234504140926      *
234505140926      * Perform real delete
234506140926      ***C           F1KEY1    DELETDTAF1R1              99
234507140926      *
234508140926      * Perform delete via flag
234509140926     C                     MOVE S@USER    BLEUSR
234510140926     C                     MOVE S@PGM     BLEPGM
234511140926     C                     MOVEL'*CURRENT'X@IDF
234512140926     C                     EXSR @DTDTS
234513140926     C                     MOVE @DT       BLEDTS
234514140926     C                     MOVE '*'       BLDLTD
234515140926     C                     UPDATDTAF1R1
234516140924      *
234517140924      * Option is not view
234518140924W2   C           S1OPT     WHNE ' 5'
234519140924      *
234520140924      *
234521140924     C           #ORRCD    OCUR F1DS
234522140924     C                     MOVELF1DS      F@DS      P
234523140924     C           #UPRCD    OCUR F1DS
234524140924      *
234525140924      * If original record and update record differ
234526140924B3   C           F1DS      IFNE F@DS
234527140924      *
234528140924      * Refresh record edit information
234529140924     C                     MOVE S@USER    BLEUSR
234530140924     C                     MOVE S@PGM     BLEPGM
234531140924     C                     MOVEL'*CURRENT'X@IDF     P
234532140924     C                     EXSR @DTDTS
234533140924     C                     MOVE @DT       BLEDTS
234534140924      *
234535140924      * Update file
234536140924     C                     UPDATDTAF1R1                98
234537140924B4   C           *IN98     IFEQ *ON
234538140924     C                     Z-ADD7         X@ECBA
234539140924     C                     MOVE 'MSG1848' X@MI
234540140924E4   C                     ENDIF
234541140924      *
234542140924      *
234543140924E3   C                     ENDIF
234544140924      *
234545140924      *
234546140924E2   C                     ENDSL
234547140926      *
234548140926      *
234549140926     C           X@ECBA    IFEQ *ZERO
234550140926     C           S1OPT     ANDNE' 5'
234551140926     C                     EXSR UP@F2
234552140926     C                     ENDIF
234553140926      *
234554140926      *
234555140926     C           X@ECBA    IFEQ *ZERO
234556140926     C           S1OPT     ANDNE' 5'
234557140926     C                     EXSR UP@F3
234558140926     C                     ENDIF
234559140924      *
234560140924      *
234561140924B2   C                     SELEC
234562140926      *
234563140926      * option is view, do nothing.
234564140926     C           S1OPT     WHEQ ' 5'
234565140924      *
234566140924      * If no errors and caller performs commit, do so.
234567140924W2   C           X@ECBA    WHEQ *ZERO
234568140924     C           E@CPC     ANDNE*ON
234569140924     C                     COMIT
234570140924      *
234571140924      * If errors and caller performs commit, roll back.
234572140924W2   C           X@ECBA    WHNE *ZERO
234573140924     C           E@CPC     ANDNE*ON
234574140924     C                     ROLBK
234575140924      *
234576140924      *
234577140924E2   C                     ENDSL
234578140924      *
234579140924      *
234580140924E1   C                     ENDSL
234581140924      *
234582140924      * Set back to screen
234583140924     C           #SCRCD    OCUR F1DS
234584140924      *
234585140924      *
234586140924     C                     ENDSR
234587140926      *
234588140926      *-------------------------------------------------------------------------
234589140926     C           UP@F2     BEGSR
234590140926      *-------------------------------------------------------------------------
234591140926      *
234592140926      *
234593140926     C                     CLEARX@ECBA
234594140928      *
234595140928      *
234596140926      *
234597140926      * Processing updates
234598140926      ***C                     Z-ADD1         I1
234599140926      *
234600140926      *
234601140926      ***C                     MOVE BLISBN    EISBN3
234602140926      ***C                     Z-ADD'T'       GTLTP0
234603140926      ***C                     Z-ADDI1        DSEQN0
234604140926      ***C                     CLEARI2
234605140926      ***C                     CLEARI
234606140926      ***C                     MOVE *OFF      F2@EOF
234607140926      ***C           TIKEY3    SETLLDTAF2R1
234608140926      ***C                     READ DTAF2R1                9899
234609140926      ***C           F2@EOF    DOWEQ*OFF
234610140926      ***C           *IN98     ANDNE*ON
234611140926      *
234612140926      *
234613140926      ***C           *IN99     IFNE *ON
234614140926      ***C                     DELETDTAF2R1
234615140926      ***C           TIKEY3    READEDTAF2R1                9899
234616140926      ***C                     ENDIF
234617140926      *
234618140926      *
234619140926      ***C           *IN98     IFNE *ON
234620140926      ***C           I         MULT 30        J
234621140926      ***C                     ADD  1         J
234622140926      ***C           J         IFGT 580
234623140926      ***C                     MOVE *ON       F2@EOF
234624140926      ***C                     ELSE
234625140926      ***C                     SUBSTD1FTTL:J  DTITL0    P
234626140926      ***C                     ADD  1         I
234627140926      ***C           DTITL0    IFNE *BLANKS
234628140926      ***C                     ADD  1         I2
234629140926      ***C                     MOVE I2        TIDSQN
234630140926      ***C                     WRITEDTAF2R1                98
234631140926      ***C                     ENDIF
234632140926      ***C                     ENDIF
234633140926      ***C                     ENDIF
234634140926      *
234635140926      *
234636140926      ***C           *IN98     IFEQ *ON
234637140926      ***C                     Z-ADD7         X@ECBA
234638140926      ***C                     MOVE 'MSG1902' X@MI
234639140926      ***C                     ENDIF
234640140926      *
234641140926      *
234642140926      *
234643140926      *
234644140926      ***C                     ENDDO
234645140926      *
234646140926      *
234647140926     C                     ENDSR
234648140928      *
234649140928      *-------------------------------------------------------------------------
234650140928     C           @UPTI     BEGSR
234651140928      *-------------------------------------------------------------------------
234652140928      *
234653140928     C                     UPDATDTAF2R1                98
234654140928     C                     WRITEDTAF2R1                98
234655140928      *
234656140928      *
234657140928     C                     ENDSR
234658140926      *
234659140926      *-------------------------------------------------------------------------
234660140926     C           UP@F3     BEGSR
234661140926      *-------------------------------------------------------------------------
234662140926      *
234663140926      *
234664140926     C                     CLEARX@ECBA
234665140926      *
234666140926      *
234667140926     C                     ENDSR
234668140928      *
234669140928      *-------------------------------------------------------------------------
234670140928     C           @UPAU     BEGSR
234671140928      *-------------------------------------------------------------------------
234672140928      *
234673140928     C                     UPDATDTAF3R1                98
234674140928     C                     WRITEDTAF3R1                98
234675140928      *
234676140928      *
234677140928     C                     ENDSR
235501140910      *
235502140910      *-------------------------------------------------------------------------
235503140910     C           @CND01    BEGSR
235504140910      *-------------------------------------------------------------------------
235505140910      *
235506140910      *
235507140910     C                     MOVE '*ENT'    @FMT
235508140910      *
235509140910      * Do until exit requested
235510140910B1   C           @FMT      DOWNE*BLANKS
235519140910      *
235520140910      *
235521140918B2   C           @FMT      IFEQ '*ENT'
235522140921      *
235523140921      *
235524140921     C           #CRRCD    OCUR F1DS
235525140910      *
235526140910      *
235527140913     C                     CLEARBO
235528140910     C                     Z-ADDE1        I
235529140910     C                     Z-ADD0         E2
235530140910      *
235531140910      * Move all 4=Delete from list to confirm delete
235532140918B3   C           E2        DOWLTO2
235533140910     C           I         ANDLEO1
235534140914     C                     MOVE AK,I      F1AK
235535140910     C                     MOVE F1@IOP    S1@IOP
235536140918B4   C           S1OPT     IFEQ ' 4'
235537140910     C                     ADD  1         E2
235538140914     C                     MOVE F1AK      BO,E2
235539140918E4   C                     ENDIF
235540140910     C                     ADD  1         I
235541140918E3   C                     ENDDO
235542140910      *
235543140910      *
235544140910     C                     Z-ADD1         I1
235545140910     C                     Z-ADD1         O2I1
235549140910      *
235550140910      *
235551140918E2   C                     ENDIF
235552140910      *
235553140910      *
235554140918B2   C           @FMT      IFEQ '*ENT'
235555140918     C           @FMT      OREQ '*CRT'
235556140910      *
235557140910      *
235558140910     C                     Z-ADDO2I1      I1
235562140910      *
235563140910      *
235564140918E2   C                     ENDIF
235565140922      *
235566140922      *
235567140922B2   C           @FMT      IFEQ '*ENT'
235568140922     C           @FMT      OREQ '*CRT'
235569140922     C           @FMT      OREQ '*RFD'
235573140922      *
235574140922      * Get for display
235575140922     C                     EXSR VL@C1
235576140922      *
235577140922      *
235578140922E2   C                     ENDIF
235579140918      *
235580140918      *
235581140918B2   C           @FMT      IFEQ '*ENT'
235582140918     C           @FMT      OREQ '*CRT'
235583140922     C           @FMT      OREQ '*RFD'
235584140918     C           @FMT      OREQ '*UPD'
235585140910      *
235586140910      * Clear subfile
235587140910     C                     MOVE *ON       *IN02
235588140924     C                     WRITEC1PNL02
235589140910     C                     MOVE *OFF      @CHG
235590140910      *
235591140910      * RollUp/PageDown
235592140910B3   C                     SELEC
235593140910W3   C           @ROLL     WHEQ UP
235594140910      *
235595140910      * Already at bottom of area
235596140910B4   C           D@MOB     IFEQ BOTTOM
235597140910     C                     MOVE 'CPD6A69' X@MI
235598140910     C                     CALL 'QMHSNDPM'@SNDSM
235599140910     C                     Z-ADDO2I1      I1
235600140910X4   C                     ELSE
235601140910     C                     Z-ADDI1        O2I1
235602140910E4   C                     ENDIF
235603140910      *
235604140910      * RollDown/PageUp
235605140910W3   C           @ROLL     WHEQ DOWN
235606140910      *
235607140910      * Already at top of area
235608140910     C           O2I1      SUB  D@RR1D    I1
235609140910     C                     SUB  1         I1
235610140910B4   C           I1        IFLE 0
235611140910     C                     MOVE 'CPD6A66' X@MI
235612140910     C                     CALL 'QMHSNDPM'@SNDSM
235613140910     C                     Z-ADD1         I1
235614140910E4   C                     ENDIF
235615140910     C                     Z-ADDI1        O2I1
235616140910      *
235617140910      * Enter or refresh requested
235618140910W3   C                     OTHER
235619140910      *
235620140910      *
235621140910E3   C                     ENDSL
235622140910      *
235623140910      *
235624140911     C                     MOVE *OFF      @NVR    1
235625140910     C                     Z-ADD*ZERO     D@RR1
235626140910B3   C           D@RR1     DOWLED@RR1D
235627140910     C           I1        ANDLEE2
235628140910     C           E2        ANDGT*ZERO
235629140910      *
235630140910      * Get data record
235631140924     C                     CLEARS1SFL02
235632140914     C                     MOVE BO,I1     F1AK
235633140919     C                     MOVE 'F1>f?'   KY@DIR
235634140922     C                     EXSR PR@KY
235635140920     C                     EXSR TS@F1O
235636140910      *
235637140910      * If valid record
235638140912B4   C           X@ECBA    IFEQ *ZERO
235639140910      *
235640140910      * Format subfile record as 'detail'
235641140910     C                     MOVE *ON       F1@CDI
235642140910     C                     MOVE *OFF      F1@EOF
235643140920     C                     EXSR FM@S1F
235644140910      *
235645140910      * Write subfile record
235646140910     C                     ADD  1         D@RR1
235647140924     C                     WRITES1SFL02
235648140910      *
235649140910      *
235650140910     C                     ADD  1         I1
235651140910      *
235652140912      * Else record cannot be displayed
235653140910X4   C                     ELSE
235654140910      *
235655140911      *
235656140911     C                     MOVE *ON       @NVR
235657140911      *
235658140910      * Find and remove record from original store
235659140914     C                     MOVE BO,I1     F1AK
235660140910     C                     Z-ADDE1        I
235661140914     C           F1PK      LOKUPPK,I                     99
235662140910B5   C           *IN99     IFEQ *ON
235663140914     C                     MOVE *LOVAL    PK,I
235664140914     C                     MOVE *LOVAL    AK,I
235665140910      *
235666140910      * Move elements down a row
235667140910     C                     Z-ADDI1        J
235668140910B6   C           J         DOWLEE2
235669140910     C           J         ADD  1         I
235670140910     C           I         IFLE O2
235671140913     C                     MOVE BO,I      BO,J
235672140913     C                     MOVE *LOVAL    BO,I
235673140910     C                     ELSE
235674140913     C                     MOVE *LOVAL    BO,J
235675140910     C                     ENDIF
235676140910     C                     ADD  1         J
235677140910E6   C                     ENDDO
235678140910      *
235679140910      * Reduce elements stored by 1
235680140910     C                     SUB  1         E2
235681140910      *
235682140910      * If number of elements is less than first line to display
235683140910B6   C           E2        IFLT O2I1
235684140910      *
235685140911      * Reset first line to display and element index
235686140910     C                     Z-ADDE2        O2I1
235687140910     C                     Z-ADDE2        I1
235688140910E6   C                     ENDIF
235689140910      *
235690140910      *
235691140910E5   C                     ENDIF
235692140910      *
235693140910      *
235694140910E4   C                     ENDIF
235695140910      *
235696140910      *
235697140910E3   C                     ENDDO
235698140910      *
235699140910      *
235700140911     C           @NVR      IFEQ *ON
235701140910     C                     MOVE 'MSG1863' X@MI
235702140910     C                     CALL 'QMHSNDPM'@SNDPM
235703140911     C                     ENDIF
235704140910      *
235705140910      * If no records to display
235706140910B3   C           E2        IFLE *ZERO
235707140910      *
235708140910      * Format subfile as '(No records to display)'
235709140910     C                     MOVE *OFF      *IN01
235710140910     C                     MOVE *ON       *IN02
235711140924     C                     WRITES1SFL02
235712140910E3   C                     ENDIF
235713140910      *
235714140910      * If end of file show it
235715140910B3   C           I1        IFGT E2
235716140910     C           E2        OREQ *ZERO
235717140910     C                     MOVE BOTTOM    D@MOB
235718140910     C                     Z-ADDO2I1      I1
235719140910X3   C                     ELSE
235720140910     C                     MOVE MORE      D@MOB
235721140910E3   C                     ENDIF
235722140910      *
235723140910      * End of create/update test
235724140910E2   C                     ENDIF
235725140910      *
235726140910      * Set/Reset display output
235727140910     C                     MOVE D@MOB     *IN25
235728140910      *
235729140910      * Process display format
235730140910     C                     WRITE#ERRCTL
235731140924     C                     WRITEC1FTR02
235732140910     C                     MOVE *OFF      *IN02
235733140924     C                     WRITEC1PNL02
235734140924     C                     READ C1PNL02                  99
235735140910     C                     MOVE *OFF      @CHG
235736140916     C                     MOVE *IN22     @VCF
235737140910      *
235738140910      * Set/Reset display input
235739140924     C                     CLEARE@FKY
235740140910     C                     CLEAR@FMT
235741140910     C                     SELEC
235742140910     C           *IN23     WHEQ *ON
235743140910     C                     MOVE UP        @ROLL
235744140910     C                     MOVE '*UPD'    @FMT
235745140910     C           *IN24     WHEQ *ON
235746140910     C                     MOVE DOWN      @ROLL
235747140910     C                     MOVE '*UPD'    @FMT
235748140910     C                     OTHER
235749140910     C                     CLEAR@ROLL
235750140910     C                     ENDSL
235751140910     C                     CALL 'QMHRMVPM'@RMVPM
235752140910      *
235753140910      * Test and validate display format
235754140910     C                     SELEC
235755140910      *
235756140910      * F3=Exit
235757140910     C           *INKC     WHEQ *ON
235758140924     C                     MOVE 'KC'      E@FKY
235759140910      *
235760140910      * F5=Refresh
235761140910     C           *INKE     WHEQ *ON
235762140910     C                     MOVE '*CRT'    @FMT
235763140910      *
235764140910      * F12=Cancel
235765140910     C           *INKL     WHEQ *ON
235766140924     C                     MOVE 'KL'      E@FKY
235767140910      *
235768140910      *   =Enter or RollDown or Rollup
235769140917     C           @VCF      WHNE *ON
235770140910     C           @ROLL     OREQ UP
235771140910     C           @ROLL     OREQ DOWN
235772140910      *
235773140910      * Panel has changed, Redisplay
235774140910     C           @FMT      IFEQ *BLANKS
235775140910     C           @CHG      IFEQ YES
235776140910     C                     MOVE '*DSP'    @FMT
235777140910      *
235778140910      * Process entered option(s) if allowed
235779140910     C                     ELSE
235780140910      *
235781140910      * For all stored 4=Delete, delete record
235782140911     C           1         DO   E2        I
235783140914     C                     MOVE BO,I      F1AK
235784140919     C                     MOVE 'F1>f?'   KY@DIR
235785140922     C                     EXSR PR@KY
235786140928     C                     MOVE *OFF      F1@COC
235788140926     C                     EXSR @UPF1
235790140910      *
235791140910      * Find 4=Delete in original store and remove it
235792140911     C                     Z-ADDE1        J
235793140914     C           F1PK      LOKUPPK,J                     99
235794140910     C           *IN99     IFEQ *ON
235795140914     C                     MOVE *LOVAL    PK,J
235796140914     C                     MOVE *LOVAL    AK,J
235797140910     C                     ENDIF
235798140910     C                     ENDDO
235804140910      *
235805140910      *
235806140910     C                     ENDIF
235807140910      *
235808140910      *
235809140910     C                     ENDIF
235810140910      *
235811140910      * Invalid function key
235812140910     C                     OTHER
235813140910     C                     MOVE 'CPD6A60' X@MI
235814140910     C                     CALL 'QMHSNDPM'@SNDSM
235815140910     C                     MOVE '*ERR'    @FMT
235816140910      *
235817140910      * End process display
235818140910     C                     ENDSL
235819140910      *
235820140910      * End of display loop
235821140910     C                     ENDDO
235822140910      *
235823140910      *
235824140910     C                     ENDSR
235825140910      *
235826140910      *-------------------------------------------------------------------------
235827140910     C           @SSS01    BEGSR
235828140910      *-------------------------------------------------------------------------
235829140910      *
235830140910      *
235831140910     C                     MOVE '*ENT'    @FMT
235832140910      *
235833140910      *
235834140910     C           @FMT      DOWNE*BLANKS
235835140910      *
235836140910      *
235837140910     C           @FMT      IFEQ '*ENT'
235838140910      *
235839140910      *
235840140918     C                     WRITESSSWDWW1
235841140910      *
235842140910      *
235843140910     C                     ENDIF
235844140910      *
235845140910      *
235846140918     C           @FMT      IFEQ '*ENT'
235847140918     C           @FMT      OREQ '*CRT'
235848140910      *
235849140910      *
235850140910     C                     ENDIF
235851140922      *
235852140922      *
235853140922     C           @FMT      IFEQ '*ENT'
235854140922     C           @FMT      OREQ '*CRT'
235855140922     C           @FMT      OREQ '*RFD'
235856140922      *
235857140922      * Get for display
235858140922     C                     EXSR @VST01
235859140922      *
235860140922      *
235861140922     C                     ENDIF
235862140918      *
235863140918      *
235864140918     C           @FMT      IFEQ '*ENT'
235865140918     C           @FMT      OREQ '*CRT'
235866140922     C           @FMT      OREQ '*RFD'
235867140918     C           @FMT      OREQ '*UPD'
235868140910      *
235869140910      *
235870140910     C                     SELEC
235871140910     C           @ROLL     WHEQ UP
235872140910     C                     MOVE 'CPD6A69' X@MI
235873140910     C                     CALL 'QMHSNDPM'@SNDSM
235874140910      *
235875140910      *
235876140910     C           @ROLL     WHEQ DOWN
235877140910     C                     MOVE 'CPD6A66' X@MI
235878140910     C                     CALL 'QMHSNDPM'@SNDSM
235879140910     C                     ENDSL
235880140910      *
235881140910      *
235882140910     C                     ENDIF
235883140910      *
235884140910      *
235885140918     C                     WRITESSSPNLC1
235886140921     C                     WRITESSSPNLD1
235887140921     C                     READ SSSPNLD1                 99
235888140910      *
235889140910      *
235890140910     C                     MOVE *IN21     @CHG
235891140916     C                     MOVE *IN22     @VCF
235892140924     C                     CLEARE@FKY
235893140910     C                     CLEAR@FMT
235894140910      *
235895140910      *
235896140910     C                     SELEC
235897140910     C           *IN23     WHEQ *ON
235898140910     C                     MOVE UP        @ROLL
235899140910     C                     MOVE '*UPD'    @FMT
235900140910     C           *IN24     WHEQ *ON
235901140910     C                     MOVE DOWN      @ROLL
235902140910     C                     MOVE '*UPD'    @FMT
235903140910     C                     OTHER
235904140910     C                     CLEAR@ROLL
235905140910     C                     ENDSL
235906140910     C                     CALL 'QMHRMVPM'@RMVPM
235907140910     C                     MOVEA*ALL'0'   *IN,50
235908140910      *
235909140910      *
235910140910     C                     SELEC
235911140910      *
235912140910      *
235913140910     C           *INKC     WHEQ *ON
235914140924     C                     MOVE 'KC'      E@FKY
235915140910      *
235916140910      *
235917140910     C           *INKE     WHEQ *ON
235918140910     C                     MOVE '*CRT'    @FMT
235919140910      *
235920140910      *
235921140910     C           *INKL     WHEQ *ON
235922140924     C                     MOVE 'KL'      E@FKY
235923140910      *
235924140910      *
235925140917     C           @VCF      WHNE *ON
235926140910     C           @ROLL     OREQ UP
235927140910     C           @ROLL     OREQ DOWN
235928140910      *
235929140910      *
235930140910     C                     MOVE *ON       D1DO
235931140914     C                     EXSR @VST01
235932140910      *
235933140910      *
235934140910     C           @FMT      IFEQ *BLANKS
235935140910      *
235936140910      * Details are valid, press Enter to confirm
235937140910     C           @CHG      IFEQ YES
235938140910     C                     MOVE 'MSG1532' X@MI
235939140910     C                     CALL 'QMHSNDPM'@SNDPM
235940140910     C                     MOVE '*DSP'    @FMT
235941140910     C                     ENDIF
235942140910      *
235943140910      *
235944140910     C                     ENDIF
235945140910      *
235946140910      *
235947140910     C                     OTHER
235948140910     C                     MOVE 'CPD6A60' X@MI
235949140910     C                     CALL 'QMHSNDPM'@SNDSM
235950140910     C                     MOVE '*ERR'    @FMT
235951140910      *
235952140910      *
235953140910     C                     ENDSL
235954140910      *
235955140910      *
235956140910     C                     ENDDO
235957140910      *
235958140910      *
235959140910     C                     ENDSR
235960140910      *
235961140910      *-------------------------------------------------------------------------
235962140914     C           @VST01    BEGSR
235963140910      *-------------------------------------------------------------------------
235964140910      *
235965140910      *
235966140917     C                     MOVE *OFF      *IN97
235967140917      *
235968140917      *
235969140917B1   C           D1DO      IFEQ *ON
235970140917      *
235971140917      *
235972140917     C                     MOVE *ALLX'00' @CR
235973140917     C                     MOVELC1SSFN    X@SID     P
235974140917     C                     CLEARC2SSFN
235975140917     C                     CLEARC3SSFN
235976140917     C                     CLEARSKSW
235977140917      *
235978140917      *
235986140917     C           ' '       CHEKRC1SSFN    C1SSSQ
235987140917     C                     Z-ADDC1SSSQ    BD004C
235988140917     C                     MOVE BN004C    X@LOD
235989140917     C                     CALL 'QLGCNVCS'@CNVCS       98
235990140917B2   C           X@SOD     IFNE '*ALL'
235991140917     C           X@SOD     ANDNE'*BLANKS'
235992140917     C           '*'       SCAN X@SID     I              99
235993140917     C           *IN99     IFEQ *ON
235994140917B2   C           I         ANDLT580
235995140917     C                     ADD  1         I
235996140917     C           ' '       CHECKX@SID:I   J              99
235997140917B3   C           *IN99     IFEQ *ON
235998140917     C                     MOVE *ON       *IN97
235999140917     C                     Z-ADD7         X@ECBA
236000140917     C                     MOVE 'MSG1840' X@MI
236001140917     C                     CALL 'QMHSNDPM'@SNDPM
236002140917     C                     MOVE '*ERR'    @FMT
236003140917E3   C                     ENDIF
236004140917E2   C                     ENDIF
236005140917B2   C           C1SSSQ    IFNE *ZERO
236006140917     C           X@ECBA    ANDEQ*ZERO
236007140917     C           C1SSSQ    SUBSTX@SOD:1   C2SSFN    P
236008140917     C                     MOVELX@SOD     W2FTTL    P
236009140917     C                     Z-ADD1         I
236011140917     C                     CLEARX@SID
236012140917B3   C           *IN99     DOUEQ*OFF
236013140917     C           VLCHR     CHECKX@SOD:I   I              99
236014140917     C           I         SUB  1         J
236015140917B4   C           J         IFGT *ZERO
236016140923     C           J         SUBSTX@SOD:1   X@SID     P
236017140929     C           ' '       CHEKRX@SID     K
236018140917     C           J         SUB  K         K
236019140917X4   C                     ELSE
236020140917     C                     CLEARX@SID
236021140917     C                     Z-ADD*ZERO     K
236022140917E4   C                     ENDIF
236023140917     C           I         ADD  1         J
236024140917B4   C           *IN99     IFEQ *ON
236025140917     C           J         ANDLE580
236026140917     C           580       SUB  J         I
236027140923     C           I         SUBSTX@SOD:J   X@SOD     P
236028140923     C           X@SID     CAT  X@SOD:K   X@SOD     P
236029140917     C           J         SUB  1         I
236030140917E4   C                     ENDIF
236031140917E3   C                     ENDDO
236032140917B3   C           X@SOD     IFEQ *BLANKS
236033140917     C                     MOVELW2FTTL    X@SOD     P
236034140917E3   C                     ENDIF
236035140917     C                     MOVELX@SOD     C3SSFN    P
236036140917     C                     Z-ADD1         I
236037140917     C           ' '       CHECKX@SOD:1   J
236038140917B3   C           I         DOWLE10
236039140917     C           J         ANDNE*ZERO
236040140917     C           ' '       SCAN X@SOD:J   K
236041140917B4   C           K         IFNE *ZERO
236042140917     C           K         SUB  J         K
236043140917     C           K         SUBSTX@SOD:J   SKSW,I    P
236044140917E4   C                     ENDIF
236045140917     C           J         ADD  K         K
236046140917     C           ' '       CHECKX@SOD:K   J
236047140917     C                     ADD  1         I
236048140917E3   C                     ENDDO
236049140917B3   C           I         IFGT 3
236050140917     C           SKSW,1    ANDEQ'TH'
236051140917     C                     CLEARSKSW,1
236052140917E3   C                     ENDIF
236053140917     C                     MOVEASKSW      C4SSFN    P
236054140917     C                     CLEARC1SSGT
236055140917B3   C           1         DO   10        I
236056140923     C           C1SSGT    CAT  SKSW,I:0  C1SSGT    P
236057140917E3   C                     ENDDO
236058140917     C           ' *'      CHEKRW2FTTL    I              99
236059140917B3   C           *IN99     IFEQ *ON
236060140923     C           I         SUBSTW2FTTL:1  W2FTTL    P
236061140917E3   C                     ENDIF
236062140917     C           ' '       CHEKRC1SSGT    J
236063140917B3   C           I         IFGT *ZERO
236064140917B4   C           J         IFEQ 10
236065140917     C                     MOVE '*'       C1SSGT
236066140917X4   C                     ELSE
236067140917     C                     CAT  '*':0     C1SSGT
236068140917E4   C                     ENDIF
236069140917E3   C                     ENDIF
236070140917      *
236071140917      *
236072140917E2   C                     ENDIF
236073140917      *
236074140917      *
236075140917     C                     ELSE
236076140917     C                     MOVELX@SOD     C1SSGT    P
236077140917     C                     MOVELX@SOD     C1SSFN    P
236078140917      *
236079140917      *
236080140917E2   C                     ENDIF
236081140917      *
236082140917      *
236083140917E1   C                     ENDIF
236084140910      *
236085140910      *
236086140910     C                     MOVE *OFF      D1DO
236087140910      *
236088140910      *
236089140910      *
236090140910     C                     ENDSR
236600000000      *
236700000000      *-------------------------------------------------------------------------
236800000000     C           @POS01    BEGSR
236900000000      *-------------------------------------------------------------------------
237000000000      *
237100000000      *
237200000000     C                     MOVE '*ENT'    @FMT
237300000000      *
237400000000      *
237500000000     C           @FMT      DOWNE*BLANKS
238100000000      *
238200000000      *
238300000000     C           @FMT      IFEQ '*ENT'
238400000000      *
238500000000      *
238600140918     C                     WRITEPOSWDWW1
239000000000      *
239100000000      *
239200000000     C                     ENDIF
239300000000      *
239400000000      *
239500140922     C           @FMT      IFEQ '*ENT'
239501140922     C           @FMT      OREQ '*CRT'
239502140916      *
239503140916      *
239504140916     C                     MOVE *BLANKS   P1ISBN
239600000000      *
239700000000      *
239800000000     C                     ENDIF
239801140922      *
239802140922      *
239803140922     C           @FMT      IFEQ '*ENT'
239804140922     C           @FMT      OREQ '*CRT'
239805140922     C           @FMT      OREQ '*RFD'
239809140922      *
239810140922      * Get for display
239811140922     C                     EXSR @VLL01
239812140922      *
239813140922      *
239814140922     C                     ENDIF
239815140918      *
239816140918      *
239817140918     C           @FMT      IFEQ '*ENT'
239818140918     C           @FMT      OREQ '*CRT'
239819140922     C           @FMT      OREQ '*RFD'
239820140918     C           @FMT      OREQ '*UPD'
239900000000      *
240000000000      *
240100000000     C                     SELEC
240200000000     C           @ROLL     WHEQ UP
240300000000     C                     MOVE 'CPD6A69' X@MI
240400000000     C                     CALL 'QMHSNDPM'@SNDSM
240500000000      *
240600000000      *
240700000000     C           @ROLL     WHEQ DOWN
240800000000     C                     MOVE 'CPD6A66' X@MI
240900000000     C                     CALL 'QMHSNDPM'@SNDSM
241000000000     C                     ENDSL
241400000000      *
241500000000      *
241600000000     C                     ENDIF
241700000000      *
241800000000      *
241900140918     C                     WRITEPOSPNLC1
241901140921     C                     WRITEPOSPNLD1
242000140921     C                     READ POSPNLD1                 99
242100000000      *
242200000000      *
242300000000     C                     MOVE *IN21     @CHG
242301140916     C                     MOVE *IN22     @VCF
242400140924     C                     CLEARE@FKY
242500000000     C                     CLEAR@FMT
242600000000      *
242700000000      *
242800000000     C                     SELEC
242801140907     C           *IN23     WHEQ *ON
242802140907     C                     MOVE UP        @ROLL
242803140907     C                     MOVE '*UPD'    @FMT
242900140907     C           *IN24     WHEQ *ON
243000000000     C                     MOVE DOWN      @ROLL
243100000000     C                     MOVE '*UPD'    @FMT
243500000000     C                     OTHER
243600000000     C                     CLEAR@ROLL
243700000000     C                     ENDSL
243800000000     C                     CALL 'QMHRMVPM'@RMVPM
243900140908     C                     MOVEA*ALL'0'   *IN,50
244000000000      *
244100000000      *
244200000000     C                     SELEC
244300000000      *
244400000000      *
244500000000     C           *INKC     WHEQ *ON
244600140924     C                     MOVE 'KC'      E@FKY
244700000000      *
244800000000      *
244900000000     C           *INKE     WHEQ *ON
245000000000     C                     MOVE '*CRT'    @FMT
245100000000      *
245200000000      *
245300000000     C           *INKL     WHEQ *ON
245400140924     C                     MOVE 'KL'      E@FKY
245500000000      *
245600000000      *
245700140917     C           @VCF      WHNE *ON
245800140907     C           @ROLL     OREQ UP
245900140907     C           @ROLL     OREQ DOWN
246000000000      *
246100000000      *
246200000000     C                     MOVE *ON       D1DO
246300000000     C                     EXSR @VLL01
246400000000      *
246500000000      *
246600000000     C           @FMT      IFEQ *BLANKS
246700000000      *
246800000000      * Details are valid, press Enter to confirm
246900000000     C           @CHG      IFEQ YES
247000000000     C                     MOVE 'MSG1532' X@MI
247100000000     C                     CALL 'QMHSNDPM'@SNDPM
247200000000     C                     MOVE '*DSP'    @FMT
247300000000     C                     ELSE
247400000000      *
247500000000      *
247501140916     C                     SELEC
247600140916     C           P1ISBN    WHEQ '*TOP'
247601140916     C                     MOVE *LOVAL    P1ISBN
247602140916     C           P1ISBN    WHEQ '*BOT'
247603140916     C                     MOVE *HIVAL    P1ISBN
248700140916     C                     ENDSL
248800000000      *
248900000000      *
249000000000     C                     ENDIF
249100000000      *
249200000000      *
249300000000     C                     ENDIF
249400000000      *
249500000000      *
249600000000     C                     OTHER
249700000000     C                     MOVE 'CPD6A60' X@MI
249800000000     C                     CALL 'QMHSNDPM'@SNDSM
249900000000     C                     MOVE '*ERR'    @FMT
250000000000      *
250100000000      *
250200000000     C                     ENDSL
250300000000      *
250400000000      *
250500000000     C                     ENDDO
250600000000      *
250700000000      *
250800000000     C                     ENDSR
250900000000      *
251000000000      *-------------------------------------------------------------------------
251100000000     C           @VLL01    BEGSR
251200000000      *-------------------------------------------------------------------------
258400000000      *
258500000000      *
258600000000     C                     MOVE *OFF      D1DO
258800000000      *
258900000000      *
259000000000     C                     ENDSR
259100000000      *
259200000000      *-------------------------------------------------------------------------
259300000000     C           @SBS01    BEGSR
259400000000      *-------------------------------------------------------------------------
259500000000      *
259600000000      *
259700000000     C                     MOVE '*ENT'    @FMT
259800000000      *
259900000000      *
260000000000     C           @FMT      DOWNE*BLANKS
260600000000      *
260700000000      *
260800000000     C           @FMT      IFEQ '*ENT'
260900000000      *
261000000000      *
261100140918     C                     WRITESBSWDWW1
261500000000      *
261600000000      *
261700000000     C                     ENDIF
261800000000      *
261900000000      *
261901140922     C           @FMT      IFEQ '*ENT'
262000140922     C           @FMT      OREQ '*CRT'
262500000000      *
262600000000      *
262700000000     C                     ENDIF
262701140922      *
262702140922      *
262703140922     C           @FMT      IFEQ '*ENT'
262704140922     C           @FMT      OREQ '*CRT'
262705140922     C           @FMT      OREQ '*RFD'
262706140922      *
262707140922      * Get for display
262708140922     C                     EXSR @VSS01
262709140922      *
262710140922      *
262711140922     C                     ENDIF
262712140918      *
262713140918      *
262714140918     C           @FMT      IFEQ '*ENT'
262715140918     C           @FMT      OREQ '*CRT'
262716140922     C           @FMT      OREQ '*RFD'
262717140918     C           @FMT      OREQ '*UPD'
262800000000      *
262900000000      *
263000000000     C                     SELEC
263100000000     C           @ROLL     WHEQ UP
263200000000     C                     MOVE 'CPD6A69' X@MI
263300000000     C                     CALL 'QMHSNDPM'@SNDSM
263400000000      *
263500000000      *
263600000000     C           @ROLL     WHEQ DOWN
263700000000     C                     MOVE 'CPD6A66' X@MI
263800000000     C                     CALL 'QMHSNDPM'@SNDSM
263900000000     C                     ENDSL
264300000000      *
264400000000      *
264500000000     C                     ENDIF
264600000000      *
264700000000      *
264800140918     C                     WRITESBSPNLC1
264801140921     C                     WRITESBSPNLD1
264900140921     C                     READ SBSPNLD1                 99
265000000000      *
265100000000      *
265200000000     C                     MOVE *IN21     @CHG
265201140916     C                     MOVE *IN22     @VCF
265300140924     C                     CLEARE@FKY
265400000000     C                     CLEAR@FMT
265500000000      *
265600000000      *
265700000000     C                     SELEC
265701140907     C           *IN23     WHEQ *ON
265702140907     C                     MOVE UP        @ROLL
265703140907     C                     MOVE '*UPD'    @FMT
265800140907     C           *IN24     WHEQ *ON
265900000000     C                     MOVE DOWN      @ROLL
266000000000     C                     MOVE '*UPD'    @FMT
266400000000     C                     OTHER
266500000000     C                     CLEAR@ROLL
266600000000     C                     ENDSL
266700000000     C                     CALL 'QMHRMVPM'@RMVPM
266800140908     C                     MOVEA*ALL'0'   *IN,50
266900000000      *
267000000000      *
267100000000     C                     SELEC
267200000000      *
267300000000      *
267400000000     C           *INKC     WHEQ *ON
267700140924     C                     MOVE 'KC'      E@FKY
267800000000      *
267900000000      *
268000000000     C           *INKE     WHEQ *ON
268100000000     C                     MOVE '*CRT'    @FMT
268200000000      *
268300000000      *
268400000000     C           *INKL     WHEQ *ON
268700140924     C                     MOVE 'KL'      E@FKY
268800000000      *
268900000000      *
269000140917     C           @VCF      WHNE *ON
269100140907     C           @ROLL     OREQ UP
269200140907     C           @ROLL     OREQ DOWN
269300000000      *
269400000000      *
269500000000     C                     MOVE *ON       D1DO
269600140914     C                     EXSR @VSS01
269700000000      *
269800000000      *
269900000000     C           @FMT      IFEQ *BLANKS
270000000000      *
270100000000      * Details are valid, press Enter to continue
270200000000     C           @CHG      IFEQ YES
270300000000     C                     MOVE 'MSG1532' X@MI
270400000000     C                     CALL 'QMHSNDPM'@SNDPM
270500000000     C                     MOVE '*DSP'    @FMT
270600000000     C                     ELSE
271100000000      *
271200000000      *
271300000000     C                     ENDIF
271400000000      *
271500000000      *
271600000000     C                     ENDIF
271700000000      *
271800000000      *
271900000000     C                     OTHER
272000000000     C                     MOVE 'CPD6A60' X@MI
272100000000     C                     CALL 'QMHSNDPM'@SNDSM
272200000000     C                     MOVE '*ERR'    @FMT
272300000000      *
272400000000      *
272500000000     C                     ENDSL
272600000000      *
272700000000      *
272800000000     C                     ENDDO
272900000000      *
273000000000      *
273100000000     C                     ENDSR
273200000000      *
273300000000      *-------------------------------------------------------------------------
273400140914     C           @VSS01    BEGSR
273500000000      *-------------------------------------------------------------------------
273600000000      *
273700000000      * Invalid option for show deleted records
273800140918     C           C1DLTD    IFNE '*'
273900140905     C           C1DLTD    ANDNE'N'
273901140924     C           C1DLTD    ANDNE'O'
274100000000     C           D1DO      ANDEQ*ON
274200000000     C                     MOVE 'MSG1835' X@MI
274300000000     C                     CALL 'QMHSNDPM'@SNDPM
274400140906     C                     MOVE *ON       *IN97
274500000000     C                     MOVE '*ERR'    @FMT
274600000000     C                     ENDIF
275700000000      *
275800000000      *
275900000000     C                     MOVE *OFF      D1DO
276000000000      *
276100000000      *
276200000000     C                     ENDSR
276646140911      *
276647140911      *-------------------------------------------------------------------------
276648140920     C           SQ@F1     BEGSR
276649140911      *-------------------------------------------------------------------------
276650140911      *
276651140911      *
276652140911     C                     SELEC
276653140918     C           C1SUPN    WHNE *ZERO
276654140918     C           C1SKSN    ANDNE'*ALL'
276655140919     C                     Z-ADD2         F1@SQ
276656140918     C           C1SUPN    WHNE *ZERO
276657140919     C                     Z-ADD4         F1@SQ
276658140918     C           C1SKSN    WHNE '*ALL'
276659140919     C                     Z-ADD3         F1@SQ
276660140911      *
276661140911      *
276662140911     C                     OTHER
276663140919     C                     Z-ADD1         F1@SQ
276664140911      *
276665140911      *
276666140911     C                     ENDSL
276667140911      *
276668140911      *
276669140911     C                     ENDSR
276670140911      *
276671140911      *-------------------------------------------------------------------------
276672140920     C           SL@F1     BEGSR
276673140911      *-------------------------------------------------------------------------
276674140911      *
276675140911      *
276676140911     C                     SELEC
276677140919     C           F1@SQ     WHEQ 1
276678140911     C           F1R1K1    SETLLDTAF1R1
276679140919     C           F1@SQ     WHEQ 2
276680140911     C           F1R2K1    SETLLDTAF1R2
276681140919     C           F1@SQ     WHEQ 3
276682140911     C           F1R3K1    SETLLDTAF1R3
276683140919     C           F1@SQ     WHEQ 4
276684140911     C           F1R4K1    SETLLDTAF1R4
276685140911     C                     ENDSL
276686140911      *
276687140911      *
276688140911     C                     ENDSR
276689140911      *
276690140911      *-------------------------------------------------------------------------
276691140920     C           SG@F1     BEGSR
276692140911      *-------------------------------------------------------------------------
276693140911      *
276694140911      *
276695140911     C                     SELEC
276696140919     C           F1@SQ     WHEQ 1
276697140911     C           F1R1K1    SETGTDTAF1R1
276698140919     C           F1@SQ     WHEQ 2
276699140911     C           F1R2K1    SETGTDTAF1R2
276700140919     C           F1@SQ     WHEQ 3
276701140911     C           F1R3K1    SETGTDTAF1R3
276702140919     C           F1@SQ     WHEQ 4
276703140911     C           F1R4K1    SETGTDTAF1R4
276704140911     C                     ENDSL
276705140911      *
276706140911      *
276707140911     C                     ENDSR
276708140911      *
276709140911      *-------------------------------------------------------------------------
276710140920     C           RD@F1     BEGSR
276711140911      *-------------------------------------------------------------------------
276712140911      *
276713140911      *
276714140919     C                     MOVE *OFF      F1@VR
276715140919     C           F1@EOF    DOUEQ*ON
276716140919     C           F1@VR     OREQ YES
276717140911      *
276718140911      *
276719140911     C                     SELEC
276720140919     C           F1@SQ     WHEQ 1
276721140911     C                     READ DTAF1R1             N    99
276722140919     C           F1@SQ     WHEQ 2
276723140924     C           F1R2K2    READEDTAF1R2             N    99
276724140919     C           F1@SQ     WHEQ 3
276725140911     C                     READ DTAF1R3             N    99
276726140919     C           F1@SQ     WHEQ 4
276727140924     C           F1R4K2    READEDTAF1R4             N    99
276728140911     C                     ENDSL
276729140915     C                     MOVE *IN99     F1@EOF
276730140911      *
276731140911      *
276732140920     C           F1@EOF    CASEQ*OFF      VL@F1S
276733140911     C                     ENDCS
276734140915      *
276735140915      *
276736140911     C                     ENDDO
276737140911      *
276738140911      *
276739140911     C                     ENDSR
276740140911      *
276741140911      *-------------------------------------------------------------------------
276742140920     C           RP@F1     BEGSR
276743140911      *-------------------------------------------------------------------------
276744140911      *
276745140911      *
276746140919     C                     MOVE *OFF      F1@VR
276747140919     C           F1@EOF    DOUEQ*ON
276748140919     C           F1@VR     OREQ YES
276749140911      *
276750140911      *
276751140911     C                     SELEC
276752140919     C           F1@SQ     WHEQ 1
276753140911     C                     READPDTAF1R1             N    99
276754140919     C           F1@SQ     WHEQ 2
276755140924     C           F1R2K2    REDPEDTAF1R2             N    99
276756140919     C           F1@SQ     WHEQ 3
276757140919     C                     READPDTAF1R3             N    99
276758140919     C           F1@SQ     WHEQ 4
276759140924     C           F1R4K2    REDPEDTAF1R4             N    99
276760140911     C                     ENDSL
276761140915     C                     MOVE *IN99     F1@EOF
276762140911      *
276763140911      *
276764140920     C           F1@EOF    CASEQ*OFF      VL@F1S
276765140911     C                     ENDCS
276766140915      *
276767140915      *
276768140911     C                     ENDDO
276769140911      *
276770140911      *
276771140911     C                     ENDSR
276772140911      *
276773140911      *-------------------------------------------------------------------------
276774140920     C           VL@F1S    BEGSR
276775140911      *-------------------------------------------------------------------------
276776140911      *
276777140911      * Default to record is valid
276778140919     C                     MOVE *ON       F1@VR
276779140911      *
276780140924      * Select deleted records, *=All, N=None, O=Only.
276781140911     C                     SELEC
276782140918     C           C1DLTD    WHNE '*'
276783140918     C           V1DLTD    ANDNEBLDLTD
276784140919     C                     MOVE *OFF      F1@VR
276785140911     C                     ENDSL
276786140911      *
276787140911      * Select search key/short name
276788140915     C                     SELEC
276789140919     C           C1SKSN    WHEQ '*BLANKS'
276790140919     C           V1SKSN    IFNE BLSKSN
276791140919     C                     MOVE *OFF      F1@VR
276792140919     C                     ENDIF
276793140919      *
276794140919      * Select search key/short name
276795140919     C           C1SKSN    WHNE '*ALL'
276796140919     C           '*'       SCAN C1SKSN    I
276797140919     C           I         IFEQ *ZERO
276798140919     C                     Z-ADD10        I
276799140919     C                     ELSE
276800140919     C                     SUB  1         I
276803140919     C                     ENDIF
276804140919     C           I         SUBSTBLSKSN:1  WK010C 10 P
276805140919     C           V1SKSN    IFNE WK010C
276806140919     C                     MOVE *OFF      F1@VR
276807140919     C                     ENDIF
276808140919     C                     ENDSL
276814140911      *
276815140911      * Select supplier, if entered must match
276816140911     C                     SELEC
276817140918     C           C1SUPN    WHNE *ZERO
276818140918     C           V1SUPN    ANDNEBLSUPN
276819140919     C                     MOVE *OFF      F1@VR
276820140911     C                     ENDSL
276821140911      *
276822140923      * Select imprint, test against imprint prefix
276823140911     C                     SELEC
276824140918     C           C1IMPN    WHNE *ZERO
276826140923     C           ' '       CHEKRV1ISBP    I
276827140923     C           I         IFEQ *ZERO
276828140923     C                     Z-ADD8         I
276831140923     C                     ENDIF
276832140923     C           I         SUBSTBLISBN:1  WK008C  8 P
276833140923     C           V1ISBP    IFNE WK008C
276834140923     C                     MOVE *OFF      F1@VR
276835140923     C                     ENDIF
276837140911     C                     ENDSL
276838140919      *
276839140919      *
276840140920     C           F1@VR     CASEQ*OFF      TE@F1S
276841140919     C                     ENDCS
276842140911      *
276843140911      *
276844140911     C                     ENDSR
276845140918      *
276846140918      *-------------------------------------------------------------------------
276847140920     C           TE@F1S    BEGSR
276848140918      *-------------------------------------------------------------------------
276849140918      *
276850140918      * Search key/short name
276851140918     C                     SELEC
276852140919     C           C1SKSN    WHEQ '*BLANKS'
276853140919     C           V1SKSN    IFNE BLSKSN
276854140919     C                     MOVE *ON       F1@EOF
276855140919     C                     ENDIF
276856140919      *
276857140919      * Select search key/short name
276858140919     C           C1SKSN    WHNE '*ALL'
276859140919     C           '*'       SCAN C1SKSN    I
276860140919     C           I         IFEQ *ZERO
276861140919     C                     Z-ADD10        I
276862140919     C                     ELSE
276863140919     C                     SUB  1         I
276864140919     C                     ENDIF
276865140919     C           I         SUBSTBLSKSN:1  WK010C 10 P
276866140919     C           V1SKSN    IFNE WK010C
276867140919     C                     MOVE *ON       F1@EOF
276868140919     C                     ENDIF
276869140919     C                     ENDSL
276871140918      *
276872140918      * Supplier
276873140918     C                     SELEC
276874140918     C           C1SUPN    WHNE *ZERO
276875140918     C           V1SUPN    ANDNEBLSUPN
276876140919     C                     MOVE *ON       F1@EOF
276877140918     C                     ENDSL
276878140923      *
276879140923      * Imprint
276880140923     C                     SELEC
276881140923     C           C1IMPN    WHNE *ZERO
276882140923     C           ' '       CHEKRV1ISBP    I
276883140923     C           I         IFEQ *ZERO
276884140923     C                     Z-ADD8         I
276887140923     C                     ENDIF
276888140923     C           I         SUBSTBLISBN:1  WK008C  8 P
276889140923     C           V1ISBP    IFNE WK008C
276890140923     C                     MOVE *ON       F1@EOF
276891140923     C                     ENDIF
276892140923     C                     ENDSL
276893140918      *
276894140918      *
276895140918     C                     ENDSR
362200000000      *
362300000000      *-------------------------------------------------------------------------
362400140903     C           @RTES     BEGSR
362500000000      *-------------------------------------------------------------------------
362600000000      *
362700000000      *
362800000000     C                     CLEARX@ECBA
363100140905     C           ESKEY1    CHAINMTSUPPF              99
363101140906      *
363102140906      * Invalid supplier
363103140903     C                     SELEC
363200140903     C           *IN99     WHEQ *ON
363300000000     C                     MOVE 'MSG1351' X@MI
363400000000     C                     Z-ADD7         X@ECBA
363401140905     C                     CLEARESDS
363402140906      *
363403140906      * Supplier is flagged as deleted
363404140917     C           *IN99     WHEQ *OFF
363405140905     C           ESDLTD    ANDNE*BLANKS
363406140903     C                     MOVE 'MSG1352' X@MI
363407140903     C                     Z-ADD7         X@ECBA
363600140905     C                     ENDSL
363700000000      *
363800000000      *
363900000000     C                     ENDSR
363901140903      *
363902140903      *-------------------------------------------------------------------------
363903140903     C           @RTIP     BEGSR
363904140903      *-------------------------------------------------------------------------
363905140903      *
363906140903      *
363907140903     C                     CLEARX@ECBA
363908140906     C           IPKEY1    CHAINMTIMPNF              99
363909140903      *
363910140903      * Invalid imprint
363912140903     C                     SELEC
363913140903     C           *IN99     WHEQ *ON
363914140903     C                     MOVE 'MSG1560' X@MI
363915140903     C                     Z-ADD7         X@ECBA
363916140905     C                     CLEARIPDS
363917140906      *
363918140906      * Imprint is flagged as deleted
363919140917     C           *IN99     WHEQ *OFF
363920140903     C           IPDLTD    ANDNE*BLANKS
363921140903     C                     MOVE 'MSG1561' X@MI
363922140903     C                     Z-ADD7         X@ECBA
363923140905     C                     ENDSL
363926140903      *
363927140903      *
363928140903     C                     ENDSR
363929140928      *
363930140928      *-------------------------------------------------------------------------
363931140928     C           @RTMT     BEGSR
363932140928      *-------------------------------------------------------------------------
363933140928      *
363934140928      *
363935140928     C                     CLEARX@ECBA
363936140928     C           MTKEY1    CHAINMRCCDEF              99
363937140928      *
363938140928      * Invalid MARC code
363939140928     C                     SELEC
363940140928     C           *IN99     WHEQ *ON
363941140928     C                     MOVE 'MSG1562' X@MI
363942140928     C                     Z-ADD7         X@ECBA
363943140928     C                     CLEARMTDS
363944140928      *
363945140928      * MARC code is flaged as deleted
363946140928     C           *IN99     WHEQ *OFF
363947140928     C           MTDLTD    ANDNE*BLANKS
363948140928     C                     MOVE 'MSG1563' X@MI
363949140928     C                     Z-ADD7         X@ECBA
363950140928     C                     ENDSL
363951140928      *
363952140928      *
363953140928     C                     ENDSR
363954140928      *
363955140928      *-------------------------------------------------------------------------
363956140928     C           @RTBN     BEGSR
363957140928      *-------------------------------------------------------------------------
363958140928      *
363959140928      *
363960140928     C                     CLEARX@ECBA
363961140928     C           BNKEY1    CHAINBNDTYPF              99
363962140928      *
363963140928      * Invalid binding type.
363964140928     C                     SELEC
363965140928     C           *IN99     WHEQ *ON
363966140928     C                     MOVE 'MSG1564' X@MI
363967140928     C                     Z-ADD7         X@ECBA
363968140928     C                     CLEARBNDS
363969140928      *
363970140928      * Binding type is flagged as deleted.
363971140928     C           *IN99     WHEQ *OFF
363972140928     C           MTDLTD    ANDNE*BLANKS
363973140928     C                     MOVE 'MSG1565' X@MI
363974140928     C                     Z-ADD7         X@ECBA
363975140928     C                     ENDSL
363976140928      *
363977140928      *
363978140928     C                     ENDSR
363979140919      *
363980140919      *-------------------------------------------------------------------------
363981140919     C           PI@AK     BEGSR
363982140919      *-------------------------------------------------------------------------
363983140919      *
363984140919      *
363985140919     C                     Z-ADDO1        E1
363986140919     C                     MOVE *LOVAL    AK
363987140919     C                     MOVE *LOVAL    PK
363988140919      *
363989140919      *
363990140919     C                     ENDSR
363991140919      *
363992140919      *-------------------------------------------------------------------------
363993140919     C           PR@AK1    BEGSR
363994140919      *-------------------------------------------------------------------------
363995140919      *
363996140919      * Save F1AK
363997140919     C                     MOVE F1AK      F@AK
363998140919     C                     Z-ADD*ZERO     X@ECBA
363999140919      *
364000140919      * Find '1:Detail' options
364001140919     C                     MOVE *LOVAL    F1AK
364002140919     C                     MOVE *ON       F1@CDI
364003140919     C           F1AK      LOKUPAK,AK@SQ             99
364004140919     C                     MOVE *IN99     AK@I
364005140919      *
364006140919      * No '1:Detail' options found.
364007140919B1   C           AK@I      IFEQ *OFF
364008140919     C                     MOVE F@AK      F1AK
364009140919     C                     Z-ADD7         X@ECBA
364010140919     C                     MOVE 'MSG1846' X@MI
364011140919E1   C                     ENDIF
364012140919      *
364013140919      *
364014140919     C                     ENDSR
380501140911      *
380502140911      *-------------------------------------------------------------------------
380503140911     C           @DTDTS    BEGSR
380504140911      *-------------------------------------------------------------------------
380505140911      *
380506140911      *
380507140911     C                     MOVEL'*YMD'    X@ODF     P
380508140911     C                     CALL 'QWCCVTDT'@CVTDT
380509140911      *
380510140911      *
380511140911     C                     RESET@DT
380512140911      *
380513140911      *
380514140911     C           X@ECBA    IFEQ *ZERO
380515140911     C           X@ODC     ADD  19        DT@Y             00CC
380516140911     C                     MULT 100       DT@Y             CC00
380517140911     C                     ADD  X@OD1     DT@Y             CCYY
380518140911     C                     Z-ADDX@OD2     DT@M             CCYYMM
380519140911     C                     Z-ADDX@OD3     DT@D             CCYYMMDD
380520140911     C           X@ODT     DIV  10000     DT@H             CCYYMMDDHH
380521140911     C           X@ODT     DIV  100       DT@MI            CCYYMMDDHHMM
380522140911     C                     Z-ADDX@ODT     DT@S             CCYYMMDDHHMMSS
380523140911     C           X@ODU     MULT 1000      DT@U             CCYYMMDDHHMMSSUUUUUU
380524140911     C                     ENDIF
380525140911      *
380526140911      *
380527140911     C                     ENDSR
380528140911      *
380529140911      *-------------------------------------------------------------------------
380530140911     C           @DTSDT    BEGSR
380531140911      *-------------------------------------------------------------------------
380532140911      *
380533140911      *
380534140911     C           DT@Y      DIV  100       WK0020  20
380535140911     C                     MVR            X@OD1            .YY
380536140911     C           WK0020    SUB  19        X@ODC            CYY
380537140911     C                     Z-ADDDT@M      X@OD2            CCYYMM
380538140911     C                     Z-ADDDT@D      X@OD3            CCYYMMDD
380539140911     C           DT@H      MULT 10000     WK0060  60
380540140911     C                     Z-ADDWK0060    X@ODT            HH
380541140911     C           DT@MI     MULT 100       WK0060
380542140911     C                     ADD  WK0060    X@ODT            HHMM
380543140911     C                     ADD  DT@S      X@ODT            HHMMSS
380544140911     C                     Z-ADDDT@U      X@ODU            UUUUUU
380545140911      *
380546140911      *
380547140911     C                     MOVELX@OD      X@ID
380548140911      *
380549140911      *
380550140911     C                     MOVEL'*YMD'    X@IDF     P
380551140911     C                     CALL 'QWCCVTDT'@CVTDT
380552140911     C           X@ECBA    IFNE *ZERO
380553140911     C                     RESETX@OD
380554140911     C                     ENDIF
380555140911      *
380556140911      *
380557140911     C                     ENDSR
380558140829      *
380559140829      *-------------------------------------------------------------------------
380560140919     C           PR@PG     BEGSR
380561140913      *-------------------------------------------------------------------------
380581140829      *
380582140907      * Prevent length errors being missed causing hard to find bugs.
380583140907     C                     Z-ADD*ZERO     X@ECBA
380584140907     C                     MOVE 'MSD1001' X@MI
380585140907      *
380586140907      * Always test
380587140914     C                     MOVE *HIVAL    F1PK
380588140914     C                     MOVE *HIVAL    PK,1
380589140914     C           F1PK      IFNE PK,1
380590140907     C                     MOVE *ON       *IN99
380591140907     C                     MOVEL'*DIAG'   X@MT      P
380592140914     C                     MOVEL'F1PK    'F@FNAM    P
380593140914     C                     MOVEL'PK,1    'F@FLIB    P
380594140907     C                     MOVELIDF@      X@MDIT
380595140907     C                     CALL 'QMHSNDPM'@SNDPM
380596140907     C                     RESETX@MT
380597140907     C                     ENDIF
380598140914     C                     RESETF1PK
380599140914     C                     RESETPK,1
380600140914      *
380601140914      * Always test
380602140914     C                     MOVE *HIVAL    F1PK
380603140914     C                     MOVE *HIVAL    O1PK
380604140914     C           F1PK      IFNE O1PK
380605140914     C                     MOVE *ON       *IN99
380606140914     C                     MOVEL'*DIAG'   X@MT      P
380607140914     C                     MOVEL'F1PK    'F@FNAM    P
380608140914     C                     MOVEL'O1PK    'F@FLIB    P
380609140914     C                     MOVELIDF@      X@MDIT
380610140914     C                     CALL 'QMHSNDPM'@SNDPM
380611140914     C                     RESETX@MT
380612140914     C                     ENDIF
380613140914     C                     RESETF1PK
380614140914     C                     RESETO1PK
380615140907      *
380616140907      * Always test
380617140914     C                     MOVE *HIVAL    F1AK
380618140914     C                     MOVE *HIVAL    F@AK
380619140914     C           F1AK      IFNE F@AK
380620140907     C                     MOVE *ON       *IN99
380621140907     C                     MOVEL'*DIAG'   X@MT      P
380622140914     C                     MOVEL'F1AK    'F@FNAM    P
380623140914     C                     MOVEL'F@AK    'F@FLIB    P
380624140907     C                     MOVELIDF@      X@MDIT
380625140907     C                     CALL 'QMHSNDPM'@SNDPM
380626140907     C                     RESETX@MT
380627140907     C                     ENDIF
380628140914     C                     RESETF1AK
380629140914     C                     RESETF@AK
380630140907      *
380631140907      * Always test
380632140914     C                     MOVE *HIVAL    AK,1
380633140913     C                     MOVE *HIVAL    BO,1
380634140914     C           AK,1      IFNE BO,1
380635140907     C                     MOVE *ON       *IN99
380636140907     C                     MOVEL'*DIAG'   X@MT      P
380637140914     C                     MOVEL'AK,1    'F@FNAM    P
380638140913     C                     MOVEL'BO,1    'F@FLIB    P
380639140907     C                     MOVELIDF@      X@MDIT
380640140907     C                     CALL 'QMHSNDPM'@SNDPM
380641140907     C                     RESETX@MT
380642140907     C                     ENDIF
380643140914     C                     RESETAK,1
380644140913     C                     RESETBO,1
380645140907      *
380646140907      * Always test
380647140914     C                     MOVE *HIVAL    F1AK
380648140914     C                     MOVE *HIVAL    AK,1
380649140914     C           F1AK      IFNE AK,1
380650140907     C                     MOVE *ON       *IN99
380651140907     C                     MOVEL'*DIAG'   X@MT      P
380652140914     C                     MOVEL'F1AK    'F@FNAM    P
380653140914     C                     MOVEL'AK,1    'F@FLIB    P
380654140907     C                     MOVELIDF@      X@MDIT
380655140907     C                     CALL 'QMHSNDPM'@SNDPM
380656140907     C                     RESETX@MT
380657140907     C                     ENDIF
380658140914     C                     RESETF1AK
380659140914     C                     RESETAK,1
380660140907      *
380661140907      * Always test
380662140914     C                     MOVE *HIVAL    F1AK
380663140907     C                     MOVE *HIVAL    F1R1
380664140914     C           F1AK      IFNE F1R1
380665140907     C                     MOVE *ON       *IN99
380666140907     C                     MOVEL'*DIAG'   X@MT      P
380667140914     C                     MOVEL'F1AK    'F@FNAM    P
380668140907     C                     MOVEL'F1R1    'F@FLIB    P
380669140907     C                     MOVELIDF@      X@MDIT
380670140907     C                     CALL 'QMHSNDPM'@SNDPM
380671140907     C                     RESETX@MT
380672140907     C                     ENDIF
380673140914     C                     RESETF1AK
380674140907     C                     RESETF1R1
380675140907      *
380676140907      * Always test
380677140907     C                     MOVE *HIVAL    F1@IOP
380678140907     C                     MOVE *HIVAL    S1@IOP
380679140907     C           F1@IOP    IFNE S1@IOP
380680140907     C                     MOVE *ON       *IN99
380681140907     C                     MOVEL'*DIAG'   X@MT      P
380682140907     C                     MOVEL'F1@IOP  'F@FNAM    P
380683140907     C                     MOVEL'S1@IOP  'F@FLIB    P
380684140907     C                     MOVELIDF@      X@MDIT
380685140907     C                     CALL 'QMHSNDPM'@SNDPM
380686140907     C                     RESETX@MT
380687140907     C                     ENDIF
380688140907     C                     RESETF1@IOP
380689140907     C                     RESETS1@IOP
380690140907      *
380691140907      *
380692140907     C           *IN99     IFEQ *ON
380693140907     C                     MOVE 'MSC1001' X@MI
380694140907     C                     MOVEL'*ESCAPE' X@MT      P
380695140907     C                     Z-ADD1         BZ0002
380696140907     C                     CALL 'QMHSNDPM'@SNDPM       98
380697140907     C                     ENDIF
380701140908      *
380702140829      *
380703140829     C                     ENDSR
389700000000      *
389800000000      *-------------------------------------------------------------------------
389900000000     C           *INZSR    BEGSR
389901140908      *-------------------------------------------------------------------------
389913140906      *
389914140907      * Set mode
389917140906     C                     SELEC
389918140906     C           E@OPT     WHEQ ' 5'
389920140923     C                     MOVE '*V99*V99'@MODE
389921140906     C           E@OPT     WHEQ 'F4'
389923140923     C                     MOVE '*S99*S99'@MODE
389924140906     C                     OTHER
389926140923     C                     MOVE '*M99*M99'@MODE
389927140906     C                     ENDSL
389941140924      *
389943140924      *
389944140924     C           *LIKE     DEFN S@PGM     E@PGM
389945140924     C           *LIKE     DEFN S1OPT     E@OPT
389946140924     C                     MOVE E@FKY     E@FKY   2
389947140924     C           *LIKE     DEFN *IN       E@CPC
389948140924      *
389949140924     C           *LIKE     DEFN C1SKSN    E@SKSN
389950140924     C           *LIKE     DEFN C1SUPN    E@SUPN
389951140924     C           *LIKE     DEFN C1IMPN    E@IMPN
389952140924     C           *LIKE     DEFN C1DLTD    E@DLTD
389953140924     C           *LIKE     DEFN BLISBN    E@ISBN
390100000000      *
390200000000      *
390300000000     C           *LIKE     DEFN *IN       D@MOB
390500000000     C           *LIKE     DEFN *IN       @CHG
390713140924     C           *LIKE     DEFN S@PGM     X@PGM
390800000000     C                     MOVE *BLANKS   @FMT    4
390801141006     C           *LIKE     DEFN @FMT      @FMT01
390802141006     C           *LIKE     DEFN @FMT      @FMT02
390901140916     C           *LIKE     DEFN *IN       @ROLL
390902140916     C           *LIKE     DEFN *IN       @VCF
391000140919     C                     MOVE *BLANKS   KY@DIR  5
391200000000     C                     MOVEL'*'       PGMQ
391300000000     C           *NAMVAR   DEFN *LDA      #LDA
391400000000     C                     IN   #LDA
391401140924      *
391402140924      *
391403140924     C           *LIKE     DEFN C1SKSN    M1SKSN
391404140924     C           *LIKE     DEFN C1SUPN    M1SUPN
391405140924     C           *LIKE     DEFN C1IMPN    M1IMPN
391406140924     C           *LIKE     DEFN C1DLTD    M1DLTD
391407140924      *
391408140924      *
391409140924     C           *LIKE     DEFN BLSKSN    V1SKSN
391410140924     C           *LIKE     DEFN BLSUPN    V1SUPN
391411140924     C           *LIKE     DEFN BLIMPN    V1IMPN
391412140924     C           *LIKE     DEFN IPISBP    V1ISBP
391413140924     C           *LIKE     DEFN BLDLTD    V1DLTD
391414140924      *
391415140924      *
391416140924     C           *LIKE     DEFN C1DLTD    B1DLTD
391417140924      *
391418140924      *
391419140924     C                     MOVE FLB@11    VCOID
391500000000      *
391600000000      *
391700000000     C                     Z-ADD0         D@RR1   40
391701141002     C           *LIKE     DEFN D@RR1     D@RR
391702140910     C                     Z-ADD0         I       50
391703140910     C           *LIKE     DEFN I         J
391704140929     C           *LIKE     DEFN I         K
392200140919     C           *LIKE     DEFN *IN       F1@TE
392202140921     C           *LIKE     DEFN *IN       F1@VR
392203140921     C           *LIKE     DEFN *IN       F1@EOF
392204140921     C           *LIKE     DEFN *IN       F1@NRF
392205140921     C           *LIKE     DEFN *IN       F1@RHC
392206140921     C           *LIKE     DEFN *IN       F1@COC
392207140923     C           *LIKE     DEFN *IN       F1@LRU
392208140921     C           *LIKE     DEFN I         F1@SQ
392209140921      *
392300000000     C           *LIKE     DEFN *IN       D1DO
392301140921     C           *LIKE     DEFN I         D@VPF1
392302141006     C                     Z-ADD0         D@SE00  21
392303141006     C           *LIKE     DEFN D@SE00    D@SE01
392304141006     C           *LIKE     DEFN D@SE00    D@SE02
392305140921      *
392400140919     C           *LIKE     DEFN *IN       C1@CE
392401140921      *
392402140921     C           *LIKE     DEFN I         E1
392403140921     C           *LIKE     DEFN *IN       S1@DO
392404140914     C           *LIKE     DEFN *IN       S1DO
392405140920     C           *LIKE     DEFN *IN       S1@WCR
392406140921     C           *LIKE     DEFN I         S1S
392407140921     C           *LIKE     DEFN *IN       S1@S1O
392600000000     C           *LIKE     DEFN I         F1V
392601000000     C                     Z-ADD1         F1V
392602140921      *
392900000000     C           *LIKE     DEFN I         I1
393000140910     C           *LIKE     DEFN I         O2I1
393001140921     C           *LIKE     DEFN I         E2
393100000000     C           *LIKE     DEFN I         W1
393200000000     C           *LIKE     DEFN I         W2
393300000000     C           *LIKE     DEFN I         W3
393301140926     C           *LIKE     DEFN I         I2
393302140921      *
393303140919     C           *LIKE     DEFN *IN       AK@I
393304140919     C           *LIKE     DEFN I         AK@SQ
393305140925      *
393308140925     C           *LIKE     DEFN *IN       TI@EOF
393310140928     C           *LIKE     DEFN TITAGC    F2TAGC
393311140928     C           *LIKE     DEFN DSEQN0    F2SEQN
393312140928     C           *LIKE     DEFN TIDSQN    F2DSQN
393313140928     C           *LIKE     DEFN *IN       TI@CI
393314140928     C           *LIKE     DEFN I         TI@LTS
393315140924      *
393316140924     C           *LIKE     DEFN *IN       AU@EOF
393317140928     C           *LIKE     DEFN AUTAGC    F3TAGC
393318140928     C           *LIKE     DEFN AUSEQN    F3SEQN
393319140928     C           *LIKE     DEFN AUDSQN    F3DSQN
393320140928     C           *LIKE     DEFN *IN       AU@CI
393321140928     C           *LIKE     DEFN I         AU@LTS
393322000000      *
393323000000      *
393324140919     C           *LIKE     DEFN *IN       PG@PCK
393325141006      *
393326141006      *
393327141008     C           *LIKE     DEFN *IN       @NSU
393328141006     C           *LIKE     DEFN *IN       @VOR
393329141006     C                     MOVE *OFF      @VOR
396400000000      *
396500000000      *
396600000000      ***C           *LIKE     DEFN I1        P.
396700000000      ***C           *LIKE     DEFN I1        I.
396800000000      ***C           *LIKE     DEFN W3        W.
396900000000      *
397000000000      *
397100000000     C           *LIKE     DEFN E@OPT     X@OPT
397200140924     C           *LIKE     DEFN E@FKY     X@FKEY
397900000000      *
398000000000      *
398001141006     C           *LIKE     DEFN S2CI      T1CI
398100141006     C           *LIKE     DEFN I         T1I
398101141006     C           *LIKE     DEFN I         T2I
398102141010     C           *LIKE     DEFN I         D@PTF
398200000000      *
398300000000      *
398500000000     C           *LIKE     DEFN KST@11    F1@KEY
399401140916      *
399402140916      *
399403140916     C           *LIKE     DEFN BLISBN    X@ISBN
399404140916     C                     MOVE X@EFLG    X@EFLG  1
399405140916     C           @M11IS    PLIST
399406140916     C                     PARM           X@ISBN
399407140916     C                     PARM           X@EFLG
399408140916      *
399409140916      *
399410140918     C           *LIKE     DEFN E@SUPN    X@SUPN
399411140916     C           SO1730    PLIST
399412140916     C                     PARM S@PGM     X@PGM
399413140918     C                     PARM 'F4'      X@OPT
399414140924     C           E@FKY     PARM *BLANKS   X@FKEY
399415140918     C                     PARM *ZERO     X@SUPN
399416140916     C           E@EC      PARM           X@EC
399417140923      *
399418140918      *
399419140918     C           *LIKE     DEFN E@SKSN    X@SKSN
399420140918     C           *LIKE     DEFN E@IMPN    X@IMPN
399421140918     C           *LIKE     DEFN E@DLTD    X@DLTD
399424140918     C           SO1710    PLIST
399425140918     C                     PARM S@PGM     X@PGM
399426140918     C                     PARM 'F4'      X@OPT
399427140924     C           E@FKY     PARM *BLANKS   X@FKEY
399428140918     C                     PARM *BLANKS   X@SKSN
399429140918     C                     PARM *ZERO     X@SUPN
399430140918     C                     PARM *ZERO     X@IMPN
399431140918     C                     PARM 'Y'       X@DLTD
399432140918     C                     PARM *BLANKS   X@ISBN
399433140918     C           E@EC      PARM           X@EC
399434140916      *
399435140916      *
399457140916     C           F1KEY1    KLIST
399458140916     C                     KFLD           BLISBN
399459140916     C           F1R1K1    KLIST
399460140916     C                     KFLD           F1ISBN
399461140916     C           F1R2K1    KLIST
399462140916     C                     KFLD           F1SUPN
399463140916     C                     KFLD           F1SKSN
399464140916     C                     KFLD           F1ISBN
399465140924     C           F1R2K2    KLIST
399466140924     C                     KFLD           F1SUPN
399467140916     C           F1R3K1    KLIST
399468140916     C                     KFLD           F1SKSN
399469140916     C                     KFLD           F1ISBN
399470140916     C           F1R4K1    KLIST
399471140916     C                     KFLD           F1SUPN
399472140916     C                     KFLD           F1ISBN
399473140924     C           F1R4K2    KLIST
399474140924     C                     KFLD           F1SUPN
399475140916      *
399476140916      *
399477140916     C           ESKEY1    KLIST
399478140916     C                     KFLD           ESUPN4
399479140916      *
399480140916      *
399481140916     C           IPKEY1    KLIST
399482140916     C                     KFLD           IPIMPN
399483140928      *
399484140928      *
399485140928     C           MTKEY1    KLIST
399486140928     C                     KFLD           MTTAGC
399487140928      *
399488140928      *
399489140928     C           BNKEY1    KLIST
399490140928     C                     KFLD           BNBIND
399491140916      *
399492140916      *
399493140926     C           TIKEY1    KLIST
399494140926     C                     KFLD           EISBN3
399495140926     C                     KFLD           TITAGC
399496140926     C                     KFLD           DSEQN0
399497140926     C                     KFLD           TIDSQN
399498140916     C           TIKEY2    KLIST
399499140916     C                     KFLD           EISBN3
399500140925     C           TIKEY3    KLIST
399501140925     C                     KFLD           EISBN3
399502140926     C                     KFLD           TITAGC
399503140925     C                     KFLD           DSEQN0
399504140916      *
399505140916      *
399506140926     C           AUKEY1    KLIST
399507140926     C                     KFLD           AUISBN
399508140926     C                     KFLD           AUTAGC
399509140926     C                     KFLD           AUSEQN
399510140926     C                     KFLD           AUDSQN
399511140924     C           AUKEY2    KLIST
399512140924     C                     KFLD           AUISBN
399513140924     C           AUKEY3    KLIST
399514140924     C                     KFLD           AUISBN
399515140926     C                     KFLD           AUTAGC
399516140924     C                     KFLD           AUSEQN
399517140916      *
399518140916      *
399519000000     C           @SNDPM    PLIST
399600000000     C                     PARM           X@MI    7
399700000000     C                     PARM C@PMFN    X@QMFN 20
399800000000     C                     PARM           X@MDIT256
399900000000     C                     PARM           X@LOMD
400000000000     C                     PARM           X@MT   10
400100000000     C                     PARM           X@PMQ  10
400200000000     C                     PARM           X@PSC
400300000000     C                     PARM           X@MK
400400000000     C                     PARM           X@EC
400500000000      *
400600000000      *
400700000000     C           @SNDSM    PLIST
400800000000     C                     PARM           X@MI
400900000000     C                     PARM C@SMFN    X@QMFN
401000000000     C                     PARM           X@MDIT
401100000000     C                     PARM           X@LOMD
401200000000     C                     PARM           X@MT
401300000000     C                     PARM           X@PMQ
401400000000     C                     PARM           X@PSC
401500000000     C                     PARM           X@MK
401600000000     C                     PARM           X@EC
401700000000      *
401800000000      *
401900000000     C                     MOVEL'*DIAG   'X@MT      P
402000000000     C                     MOVEL'*'       X@PMQ     P
402100000000      *
402200000000      *
402300000000     C           @CVTDT    PLIST
402400000000     C                     PARM           X@IDF  10
402500000000     C                     PARM           X@ID
402600000000     C                     PARM           X@ODF  10
402700000000     C                     PARM           X@OD
402800000000     C                     PARM           X@EC
402900000000      *
403000000000      *
403100000000     C           @CVTFD    PLIST
403200000000     C                     PARM '*YYMD'   X@IDF
403300000000     C                     PARM           X@ID
403400000000     C                     PARM '*JOB'    X@ODF
403500000000     C                     PARM           X@OD
403600000000     C                     PARM           X@EC
403700000000      *
403800000000      *
403900000000     C           @CVTDD    PLIST
404000000000     C                     PARM '*JOB'    X@IDF
404100000000     C                     PARM           X@ID
404200000000     C                     PARM '*YYMD'   X@ODF
404300000000     C                     PARM           X@OD
404400000000     C                     PARM           X@EC
404401140917      *
404402140917      *
404403140917     C           @CNVCS    PLIST
404404140917     C                     PARM @RCB      X@RCB  22
404405140917     C                     PARM           X@SID
404406140917     C                     PARM           X@SOD
404407140917     C                     PARM           X@LOD   4
404408140917     C                     PARM           X@EC
404500000000      *
404600000000      *
404700000000     C           @RMVPM    PLIST
404800000000     C                     PARM '*'       X@PMQ
404900000000     C                     PARM           X@PSC
405000000000     C                     PARM *BLANKS   X@MKTR  4
405100000000     C                     PARM '*ALL    'X@MTR  10
405200000000     C                     PARM           X@EC
421200000000      *
421300000000      *
421400000000     C                     ENDSR
